Run by AMM on 17 Aug 2016 13:19:11
Integrate with swab data
8268 antibiotic days in all participants
swabs with antibiotics taken between previous swab and current one

      staph |
antibiotics |
taken since |
  last swob |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,731       96.59       96.59
          1 |        308        3.41      100.00
------------+-----------------------------------
      Total |      9,039      100.00
swabs with antibiotics taken in previous 6 months

      staph |
antibiotics |
 taken last |
 six months |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,353       92.41       92.41
          1 |        686        7.59      100.00
------------+-----------------------------------
      Total |      9,039      100.00
. 
. ** add baseline data

. 
. use "E:\users\amy.mason\staph_carriage\Datasets\clean_data.dta", clear

. 
. 
. 
. keep patid timepoint spatype

. 
. order patid timepoint spatype

. 
. replace spatype= subinstr(spatype, "contaminated", "",.)
(1 real change made)

. 
. bysort patid timepoint: assert _n==1

. 
. by patid: gen initialspa = spatype[1]
(3,405 missing values generated)

. 
. by patid: gen secondspa = spatype[2]
(4,085 missing values generated)

. 
. save temp, replace
file temp.dta saved

. 
. 
. 
. use temp, clear

. 
. split spatype, p(/)
variables created as string: 
spatype1  spatype2  spatype3  spatype4  spatype5

. 
. drop spatype

. 
. reshape long spatype, i(patid timepoint) j(current)
(note: j = 1 2 3 4 5)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                     9039   ->   45195
Number of variables                   9   ->       6
j variable (5 values)                     ->   current
xij variables:
         spatype1 spatype2 ... spatype5   ->   spatype
-----------------------------------------------------------------------------

. 
. 
. 
. split initialspa, p(/)
variables created as string: 
initialspa1  initialspa2  initialspa3  initialspa4  initialspa5

. 
. split secondspa, p(/)
variables created as string: 
secondspa1  secondspa2  secondspa3  secondspa4  secondspa5

. 
. drop initialspa secondspa

. 
. rename secondspa1 initialspa6

. 
. rename secondspa2 initialspa7

. 
. rename secondspa3 initialspa8

. 
. rename secondspa4 initialspa9

. 
. rename secondspa5 initialspa10

. 
. reshape long initialspa, i(patid timepoint current) j(start)
(note: j = 1 2 3 4 5 6 7 8 9 10)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                    45195   ->  451950
Number of variables                  14   ->       6
j variable (10 values)                    ->   start
xij variables:
initialspa1 initialspa2 ... initialspa10  ->   initialspa
-----------------------------------------------------------------------------

. 
. 
. 
. rename spatype spatype1

. 
. rename initial spatype2

. 
. merge m:1 spatype1 spatype2 using "E:\users\amy.mason\staph_carriage\Datasets\spa_BURP", update
(note: variable spatype2 was str5, now str6 to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                       507,690
        from master                   450,923  (_merge==1)
        from using                     56,767  (_merge==2)

    matched                             1,027
        not updated                     1,027  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. 
. drop if _merge==2
(56,767 observations deleted)

. 
. assert inlist(_merge,1,3)

. 
. 
. 
. rename _merge _merge1

. 
. rename dist dist1

. 
. rename spatype1 spatype_temp

. 
. rename spatype2 spatype1

. 
. rename spatype_temp spatype2

. 
. 
. 
. merge m:1 spatype1 spatype2 using "E:\users\amy.mason\staph_carriage\Datasets\spa_BURP", update

    Result                           # of obs.
    -----------------------------------------
    not matched                       507,398
        from master                   450,669  (_merge==1)
        from using                     56,729  (_merge==2)

    matched                             1,281
        not updated                     1,281  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. 
. drop if _merge==2
(56,729 observations deleted)

. 
. assert inlist(_merge,1,3)

. 
. 
. 
. assert dist==. if dist1!=.

. 
. assert dist1==. if dist!=.

. 
. 
. 
. gen masterdist = min(dist1, dist)
(449,642 missing values generated)

. 
. replace masterdist=0 if spatype1==spatype2
(365,150 real changes made)

. sort patid timepoint

. order patid timepoint spa* master

. * first find minimum distance between each current spatype and the initial set 

. 
. by patid timepoint current: egen minCOST = min(masterdist)
not sorted
r(5);

. sort patid timepoint current start

. keep patid timepoint masterdist current start spa*

. 
. sort patid timepoint current start

. 
. use "E:\users\amy.mason\staph_carriage\Datasets\clean_data.dta", clear

. 
. 
. 
. keep patid timepoint spatype

. 
. order patid timepoint spatype

. 
. replace spatype= subinstr(spatype, "contaminated", "",.)
(1 real change made)

. 
. bysort patid timepoint: assert _n==1

. 
. by patid: gen initialspa = spatype[1]
(3,405 missing values generated)

. 
. by patid: gen secondspa = spatype[2]
(4,085 missing values generated)

. 
. save temp, replace
file temp.dta saved

. 
. 
. 
. use temp, clear

. 
. use temp, clear

. 
. split spatype, p(/)
variables created as string: 
spatype1  spatype2  spatype3  spatype4  spatype5

. 
. drop spatype

. 
. reshape long spatype, i(patid timepoint) j(current)
(note: j = 1 2 3 4 5)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                     9039   ->   45195
Number of variables                   9   ->       6
j variable (5 values)                     ->   current
xij variables:
         spatype1 spatype2 ... spatype5   ->   spatype
-----------------------------------------------------------------------------

. drop if spatype=="" & current!=1
(35,941 observations deleted)

. 
. split initialspa, p(/)
variables created as string: 
initialspa1  initialspa2  initialspa3  initialspa4  initialspa5

. 
. split secondspa, p(/)
variables created as string: 
secondspa1  secondspa2  secondspa3  secondspa4  secondspa5

. 
. drop initialspa secondspa

. 
. rename secondspa1 initialspa6

. 
. rename secondspa2 initialspa7

. 
. rename secondspa3 initialspa8

. 
. rename secondspa4 initialspa9

. 
. rename secondspa5 initialspa10

. reshape long initialspa, i(patid timepoint current) j(start)
(note: j = 1 2 3 4 5 6 7 8 9 10)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                     9254   ->   92540
Number of variables                  14   ->       6
j variable (10 values)                    ->   start
xij variables:
initialspa1 initialspa2 ... initialspa10  ->   initialspa
-----------------------------------------------------------------------------

. drop if initialspa=="" & start!=1
(77,266 observations deleted)

. tab start

      start |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      9,254       60.59       60.59
          2 |        397        2.60       63.19
          3 |         45        0.29       63.48
          4 |         21        0.14       63.62
          5 |         21        0.14       63.76
          6 |      5,150       33.72       97.47
          7 |        301        1.97       99.44
          8 |         41        0.27       99.71
          9 |         22        0.14       99.86
         10 |         22        0.14      100.00
------------+-----------------------------------
      Total |     15,274      100.00

. list if start ==10

       +---------------------------------------------------------+
       | patid   timepo~t   current   start   spatype   initia~a |
       |---------------------------------------------------------|
12396. |  1366          0         1      10      t084       t730 |
12402. |  1366          2         1      10      t493       t730 |
12408. |  1366          2         2      10      t089       t730 |
12414. |  1366          2         3      10      t084       t730 |
12420. |  1366          2         4      10      t267       t730 |
       |---------------------------------------------------------|
12426. |  1366          2         5      10      t730       t730 |
12432. |  1366          4         1      10      t084       t730 |
12438. |  1366          4         2      10      t089       t730 |
12444. |  1366          6         1      10      t084       t730 |
12450. |  1366          6         2      10      t089       t730 |
       |---------------------------------------------------------|
12456. |  1366          8         1      10      t084       t730 |
12462. |  1366          8         2      10      t089       t730 |
12468. |  1366         10         1      10      t089       t730 |
12474. |  1366         12         1      10      t089       t730 |
12480. |  1366         12         2      10      t084       t730 |
       |---------------------------------------------------------|
12486. |  1366         14         1      10      t089       t730 |
12492. |  1366         14         2      10      t084       t730 |
12498. |  1366         16         1      10      t089       t730 |
12504. |  1366         18         1      10      t084       t730 |
12510. |  1366         20         1      10      t084       t730 |
       |---------------------------------------------------------|
12516. |  1366         22         1      10      t084       t730 |
12522. |  1366         24         1      10      t084       t730 |
       +---------------------------------------------------------+

