Run by AMM on 29 Sep 2016 17:15:50

    Result                           # of obs.
    -----------------------------------------
    not matched                           627
        from master                       344  (_merge==1)
        from using                        283  (_merge==2)

    matched                               696
        not updated                       696  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------
(344 observations deleted)
(283 observations deleted)
r(9);

. do "C:\Users\AMY~1.MAS\AppData\Local\Temp\9\STD09000000.tmp"

. 
. #delimit ;
delimiter now ;
. twoway (rcapsym lci uci num if method=="tg", s(i))
> (scatter diff num if method=="tg" & strpos(type, "Aqu") ,mcolor(red) msize(tiny) 
>         xlabel(1(1)28, valuelabel angle(90))  ylabel(-0.05(0.05)0.05,angle(0)) 
> (scatter diff num if method=="tg" & strpos(type, "Chromo") ,mcolor(blue) msize(tiny) 
>         xlabel(1(1)28, valuelabel angle(90))  ylabel(-0.05(0.05)0.05,angle(0))  
> (scatter diff num if method=="tg" & strpos(type, "Viru") ,mcolor(green) msize(tiny) 
>         xlabel(1(1)28, valuelabel angle(90))  ylabel(-0.05(0.05)0.05,angle(0)) 
> (scatter diff num if method=="tg" & strpos(type, "ccr") ,mcolor(black) msize(tiny) 
>         xlabel(1(1)28, valuelabel angle(90))  ylabel(-0.05(0.05)0.05,angle(0))  
> legend(off) 
> title("Genefinder vs. Typewriter agreement",size(small) ) 
> fysize(30) 
> subtitle("More cases where Genefinder=P and Typewriter=A is positive", size(small) )
> graphregion(fcolor(white)) xtitle("")), yline(0, lcolor(black))  ;
parentheses do not balance
r(198);

end of do-file

r(198);

. help twoway

. 
. use pipeline_clean_all_values_wide, clear
file pipeline_clean_all_values_wide.dta not found
r(601);

. 
. *keep if strpos(type, "viru")

. 
. table valuegenefinder valuetypewriter 
variable valuegenefinder not found
r(111);

. 
. 
. 
. gen match = ( valuetypewriter== valuegen)
valuetypewriter not found
r(111);

. 
. 
. 
. gen AA=( valuegenefinder=="A" &  valuetypewriter=="A")
valuegenefinder not found
r(111);

. 
. gen AP=( valuegenefinder=="A" &  valuetypewriter=="P")
valuegenefinder not found
r(111);

. 
. gen PA=( valuegenefinder=="P" &  valuetypewriter=="A")
valuegenefinder not found
r(111);

. 
. gen PP=( valuegenefinder=="P" &  valuetypewriter=="P")
valuegenefinder not found
r(111);

. 
. 
. 
. sort site
variable site not found
r(111);

. 
. 
. 
. * collapse to produce graph

. 
. collapse (count) match (sum) AA AP PA PP summatch= match, by(site type)
variable site not found
(error in option by())
r(111);

. 
. 
. 
. for any lci uci diff:gen X=.

->  gen lci=.
(696 missing values generated)

->  gen uci=.
(696 missing values generated)

->  gen diff=.
(696 missing values generated)

. 
. local max=_N

. 
. 
. 
. 
. 
. forvalues i=1(1)`max'{
  2. 
. display site[`i']
  3. 
. local a= AA[`i']
  4. 
. local b= AP[`i']
  5. 
. local c= PA[`i']
  6. 
. local d= PP[`i']
  7. 
. mcci `a' `b' `c' `d'
  8. 
. replace diff = r(D_f)  if _n==`i'
  9. 
. replace lci = r(lb_D_f)  if _n==`i'
 10. 
. replace uci = r(ub_D_f)  if _n==`i'
 11. 
. }
site not found
r(111);

. 
. 
. 
. gen prop = abs(diff)
(696 missing values generated)

. 
. gsort -prop

. 
. gen num =_n

. 
. gen method= "tg"

. 
. labmask num, values(site)
variable site not found
(error in option values())
r(111);

. 
. 
. 
. preserve
already preserved
r(621);

. 
. rename * tg*

. 
. rename tgsite site
variable tgsite not found
r(111);

. 
. rename tgnum num

. 
. save tgdata, replace
(note: file tgdata.dta not found)
file tgdata.dta saved

. 
. restore

. 
. 
. 
. gsort site - prop
variable site not found
r(111);

. 
. gen num2=_n

. 
. labmask num2, values(site)
variable site not found
(error in option values())
r(111);

. 
. * project: staph pipeline

. 
. * author: Amy Mason

. 
. * start date: July 2016

. 
. * raw data files in E:\users\amy.mason\Pipeline_27_07_2016\Inputs

. 
. 
. 
. sysdir set PERSONAL "E:\users\amy.mason\ADO"

. 
. sysdir set STBPLUS  "E:\users\amy.mason\ADO\stbplus"

. 
. sysdir set OLDPLACE "E:\users\amy.mason\ADO\oldplace"

. 
. set logtype text

. 
. 
. 
. *******************

. 
. cd E:\users\amy.mason\Pipeline_27_07_2016\
E:\users\amy.mason\Pipeline_27_07_2016

. 
. 
. 
. set more off

. 
. * data input

. 
. *run inputs016.do

. 
. 
. 
. 
. 
. * clean data

. 
. cd E:\users\amy.mason\Pipeline_27_07_2016\
E:\users\amy.mason\Pipeline_27_07_2016

. 
. run clean_pheno.do
