Run by AMM on  9 Dec 2016 18:20:20
 starting with 8992 records from 521 paticipants
SEX

     sex at |
   baseline |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |        281       53.93       53.93
       Male |        240       46.07      100.00
------------+-----------------------------------
      Total |        521      100.00
AGE

    variable |         N       p50       iqr       min       p25       p75       max
-------------+----------------------------------------------------------------------
         age |       521        51        37        16        27        64        93
------------------------------------------------------------------------------------
ETHNIC

                  EthnicBackground |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                  1a White British |        476       91.36       91.36
                    1b White Irish |          3        0.58       91.94
         1c Other white background |         29        5.57       97.50
          2c Mixed White and Asian |          4        0.77       98.27
     2d Any other Mixed background |          2        0.38       98.66
                         3a Indian |          1        0.19       98.85
     3d Any other Asian Background |          2        0.38       99.23
                        4b African |          1        0.19       99.42
                         5 Chinese |          1        0.19       99.62
                       6 Any other |          1        0.19       99.81
7 Do not wish to give ethnic group |          1        0.19      100.00
-----------------------------------+-----------------------------------
                             Total |        521      100.00

                      |           Ethnic_group
     EthnicBackground |     Other  Other W..  White B.. |     Total
----------------------+---------------------------------+----------
     1a White British |         0          0        476 |       476 
       1b White Irish |         0          0          3 |         3 
1c Other white back.. |         0         29          0 |        29 
2c Mixed White and .. |         4          0          0 |         4 
2d Any other Mixed .. |         2          0          0 |         2 
            3a Indian |         1          0          0 |         1 
3d Any other Asian .. |         2          0          0 |         2 
           4b African |         1          0          0 |         1 
            5 Chinese |         1          0          0 |         1 
          6 Any other |         1          0          0 |         1 
7 Do not wish to gi.. |         1          0          0 |         1 
----------------------+---------------------------------+----------
                Total |        13         29        479 |       521 

residence

                             Residence |      Freq.     Percent        Cum.
---------------------------------------+-----------------------------------
           6 Educational establishment |          6        1.30        1.30
7 Hotel, boarding house or guest house |          1        0.22        1.52
                              8 Hostel |          1        0.22        1.74
            9 None of above / Own home |        453       98.26      100.00
---------------------------------------+-----------------------------------
                                 Total |        461      100.00

                      |                       Residence
      residence_group |            6 Educa..  7 Hotel..   8 Hostel  9 None .. |     Total
----------------------+-------------------------------------------------------+----------
          No response |        60          0          0          0          0 |        60 
own home/None of th.. |         0          0          0          0        453 |       453 
          shared home |         0          6          1          1          0 |         8 
----------------------+-------------------------------------------------------+----------
                Total |        60          6          1          1        453 |       521 

Current Employment at recruitment

CurrentlyEm |
     ployed |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |        273       52.40       52.40
        Yes |        248       47.60      100.00
------------+-----------------------------------
      Total |        521      100.00
Healthcare related employment at recruitment

HeathcareRe |
latedEmploy |
         ed |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |        401       76.97       76.97
        Yes |        120       23.03      100.00
------------+-----------------------------------
      Total |        521      100.00
Participation in contact sport

SportsActiv |
        ity |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |        327       62.76       62.76
        Yes |        194       37.24      100.00
------------+-----------------------------------
      Total |        521      100.00
Looks after anyone with a disability/old age

LookAfterD |    LookAfterOldAge
 isability |        No        Yes |     Total
-----------+----------------------+----------
        No |       399         41 |       440 
       Yes |        39         42 |        81 
-----------+----------------------+----------
     Total |       438         83 |       521 


  LookAfter |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |        399       76.58       76.58
        Yes |        122       23.42      100.00
------------+-----------------------------------
      Total |        521      100.00
Ever had vascular access

VascularAcc |
        ess |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |        172       33.01       33.01
    Unknown |         17        3.26       36.28
        Yes |        332       63.72      100.00
------------+-----------------------------------
      Total |        521      100.00
Ever had Catheter

   Catheter |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |        383       73.51       73.51
    Unknown |         19        3.65       77.16
        Yes |        119       22.84      100.00
------------+-----------------------------------
      Total |        521      100.00
inpatient

     IPEver |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |        170       32.63       32.63
  Not known |         73       14.01       46.64
        Yes |        278       53.36      100.00
------------+-----------------------------------
      Total |        521      100.00

    variable |         N       p50       iqr       min       p25       p75       max
-------------+----------------------------------------------------------------------
inpatient_~s |       278  806.7083      1276  1.547917       340      1616      7980
------------------------------------------------------------------------------------

inpatient_summ |      Freq.     Percent        Cum.
---------------+-----------------------------------
 > 30 days ago |        271       52.02       52.02
            No |        243       46.64       98.66
Within 30 days |          7        1.34      100.00
---------------+-----------------------------------
         Total |        521      100.00
outpatient

     OPEver |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |         87       16.70       16.70
  Not known |         73       14.01       30.71
        Yes |        361       69.29      100.00
------------+-----------------------------------
      Total |        521      100.00

    variable |         N       p50       iqr       min       p25       p75       max
-------------+----------------------------------------------------------------------
outpatient~s |       361       283  692.5625  1.645833        91  783.5625     18522
------------------------------------------------------------------------------------

outpatient_sum |
             m |      Freq.     Percent        Cum.
---------------+-----------------------------------
 > 30 days ago |        324       62.19       62.19
            No |        160       30.71       92.90
Within 30 days |         37        7.10      100.00
---------------+-----------------------------------
         Total |        521      100.00
people with no household members
Number of household members

  number in |
  household |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         69       13.24       13.24
          2 |        220       42.23       55.47
          3 |         97       18.62       74.09
          4 |         86       16.51       90.60
          5 |         34        6.53       97.12
          6 |         11        2.11       99.23
          7 |          3        0.58       99.81
          9 |          1        0.19      100.00
------------+-----------------------------------
      Total |        521      100.00

 number in |                          household_group
 household |         1          2          3          4         5+  shared .. |     Total
-----------+------------------------------------------------------------------+----------
         1 |        61          0          0          0          0          8 |        69 
         2 |         0        220          0          0          0          0 |       220 
         3 |         0          0         97          0          0          0 |        97 
         4 |         0          0          0         86          0          0 |        86 
         5 |         0          0          0          0         34          0 |        34 
         6 |         0          0          0          0         11          0 |        11 
         7 |         0          0          0          0          3          0 |         3 
         9 |         0          0          0          0          1          0 |         1 
-----------+------------------------------------------------------------------+----------
     Total |        61        220         97         86         49          8 |       521 


       type of living |                          household_group
         arrangements |         1          2          3          4         5+  shared .. |     Total
----------------------+------------------------------------------------------------------+----------
          No response |        60          0          0          0          0          0 |        60 
own home/None of th.. |         1        220         97         86         49          0 |       453 
          shared home |         0          0          0          0          0          8 |         8 
----------------------+------------------------------------------------------------------+----------
                Total |        61        220         97         86         49          8 |       521 

district nurse

DistrictNur |
     seCare |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |        435       83.49       83.49
  Not known |          8        1.54       85.03
        Yes |         78       14.97      100.00
------------+-----------------------------------
      Total |        521      100.00

    variable |         N       p50       iqr       min       p25       p75       max
-------------+----------------------------------------------------------------------
DistrictNu~s |        78    2364.5      4961         5       651      5612     17193
------------------------------------------------------------------------------------

DistrictNurse_ |
          summ |      Freq.     Percent        Cum.
---------------+-----------------------------------
 > 30 days ago |         76       14.59       14.59
            No |        443       85.03       99.62
Within 30 days |          2        0.38      100.00
---------------+-----------------------------------
         Total |        521      100.00

districtnur |
         se |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |        443       85.03       85.03
        Yes |         78       14.97      100.00
------------+-----------------------------------
      Total |        521      100.00
inpatient - adding outside of ORH appointments

InPatientN |          inpatient_summ
     onORH | > 30 da..         No  Within .. |     Total
-----------+---------------------------------+----------
        No |       101         96          1 |       198 
 Not known |         3         17          0 |        20 
       Yes |       167        130          6 |       303 
-----------+---------------------------------+----------
     Total |       271        243          7 |       521 


    variable |         N       p50       iqr       min       p25       p75       max
-------------+----------------------------------------------------------------------
inpatient_~2 |       303      4240      6410         7      1632      8042     20750
------------------------------------------------------------------------------------
(3 real changes made)
(129 real changes made)

inpatient_summ |      Freq.     Percent        Cum.
---------------+-----------------------------------
 > 30 days ago |        398       76.39       76.39
            No |        113       21.69       98.08
Within 30 days |         10        1.92      100.00
---------------+-----------------------------------
         Total |        521      100.00

  inpatient |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |        113       21.69       21.69
        Yes |        408       78.31      100.00
------------+-----------------------------------
      Total |        521      100.00
outpatient - adding outside of ORH appointments

OutPatient |         outpatient_summ
    NonORH | > 30 da..         No  Within .. |     Total
-----------+---------------------------------+----------
        No |        51         22          4 |        77 
 Not known |         6         18          1 |        25 
       Yes |       267        120         32 |       419 
-----------+---------------------------------+----------
     Total |       324        160         37 |       521 


    variable |         N       p50       iqr       min       p25       p75       max
-------------+----------------------------------------------------------------------
outpatient~2 |       417      1511      3598         5       324      3922     17643
------------------------------------------------------------------------------------

outpatient_sum |
             m |      Freq.     Percent        Cum.
---------------+-----------------------------------
 > 30 days ago |        421       80.81       80.81
            No |         40        7.68       88.48
Within 30 days |         60       11.52      100.00
---------------+-----------------------------------
         Total |        521      100.00

 outpatient |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |         40        7.68        7.68
        Yes |        481       92.32      100.00
------------+-----------------------------------
      Total |        521      100.00
surgery

UndergoneSu |
      rgery |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |        139       26.68       26.68
  Not known |         12        2.30       28.98
        Yes |        370       71.02      100.00
------------+-----------------------------------
      Total |        521      100.00

    variable |         N       p50       iqr       min       p25       p75       max
-------------+----------------------------------------------------------------------
surgery_days |       370      2745      5359         3       718      6077     21199
------------------------------------------------------------------------------------

  surgery_summ |      Freq.     Percent        Cum.
---------------+-----------------------------------
 > 30 days ago |        360       69.10       69.10
            No |        151       28.98       98.08
Within 30 days |         10        1.92      100.00
---------------+-----------------------------------
         Total |        521      100.00

    surgery |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |        151       28.98       28.98
        Yes |        370       71.02      100.00
------------+-----------------------------------
      Total |        521      100.00
GP appointments

GPAppointme |
         nt |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |          3        0.58        0.58
  Not known |          9        1.73        2.30
        Yes |        509       97.70      100.00
------------+-----------------------------------
      Total |        521      100.00

    variable |         N       p50       iqr       min       p25       p75       max
-------------+----------------------------------------------------------------------
     GP_days |       509        77       166         1        27       193      6454
------------------------------------------------------------------------------------
(366 real changes made)
(12 real changes made)

       GP_summ |      Freq.     Percent        Cum.
---------------+-----------------------------------
 > 30 days ago |        366       70.25       70.25
            No |         12        2.30       72.55
Within 30 days |        143       27.45      100.00
---------------+-----------------------------------
         Total |        521      100.00

         GP |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |         12        2.30        2.30
        Yes |        509       97.70      100.00
------------+-----------------------------------
      Total |        521      100.00
Skin
45 participants reported skin problems prior to start of study
has had skin treatment within 30 days of recruitment

          skin |      Freq.     Percent        Cum.
---------------+-----------------------------------
     > 30 days |         38       84.44       84.44
            No |          6       13.33       97.78
within 30 days |          1        2.22      100.00
---------------+-----------------------------------
         Total |         45      100.00
has had skin treatment within 30 days of recruitment

          skin |      Freq.     Percent        Cum.
---------------+-----------------------------------
     > 30 days |         38        7.29        7.29
Did Not Report |        476       91.36       98.66
            No |          6        1.15       99.81
within 30 days |          1        0.19      100.00
---------------+-----------------------------------
         Total |        521      100.00
Long Term Illness
Type 1 disbetes

      Type1 |
DiabetesYOn |
    Insulin |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        516       99.04       99.04
          1 |          5        0.96      100.00
------------+-----------------------------------
      Total |        521      100.00
Type 2 disbetes

     Type 2 |
diabetesYOn |
     OralPx |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        497       95.39       95.39
          1 |         24        4.61      100.00
------------+-----------------------------------
      Total |        521      100.00
Asthma or COPD on inhaled steriods

Asthma/COPD |
      onINh |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        489       93.86       93.86
          1 |         32        6.14      100.00
------------+-----------------------------------
      Total |        521      100.00
History of Cancer

   CancerHx |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        498       95.59       95.59
          1 |         23        4.41      100.00
------------+-----------------------------------
      Total |        521      100.00
History of dermatitis or psoriasis

HxDerm/Psor |
      iasis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        481       92.32       92.32
          1 |         40        7.68      100.00
------------+-----------------------------------
      Total |        521      100.00
(53 real changes made, 53 to missing)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    Dialysis |         53           0           0          0          0
53 missing BMI

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    BMIclean |        468    26.53825    6.283667       15.4       66.8

      BMI30 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        427       81.96       81.96
          1 |         94       18.04      100.00
------------+-----------------------------------
      Total |        521      100.00
history of drug misuse

      IDUHx |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        518       99.42       99.42
          1 |          3        0.58      100.00
------------+-----------------------------------
      Total |        521      100.00
dialysis

   Dialysis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        521      100.00      100.00
------------+-----------------------------------
      Total |        521      100.00
cirrhosis

  Cirrhosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        520       99.81       99.81
          1 |          1        0.19      100.00
------------+-----------------------------------
      Total |        521      100.00
Long Term Illness

        LTI |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        365       70.06       70.06
          1 |        156       29.94      100.00
------------+-----------------------------------
      Total |        521      100.00
. 
. * create list of all spatypes

. 
. use "E:\users\amy.mason\staph_carriage\Datasets\clean_data.dta", clear

. 
. keep patid timepoint spatype

. 
. split spatype, parse(/)
variables created as string: 
spatype1  spatype2  spatype3  spatype4  spatype5

. 
. drop spatype

. 
. reshape long spatype, i(patid timepoint) j(spanum)
(note: j = 1 2 3 4 5)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                     8992   ->   44960
Number of variables                   7   ->       4
j variable (5 values)                     ->   spanum
xij variables:
         spatype1 spatype2 ... spatype5   ->   spatype
-----------------------------------------------------------------------------

. 
. drop if spatype==""
(40,303 observations deleted)

. 
. 
. 
. * merge with CC groups data

. 
. merge m:1 spatype using "E:\users\amy.mason\staph_carriage\Datasets\CC", update

    Result                           # of obs.
    -----------------------------------------
    not matched                            85
        from master                        11  (_merge==1)
        from using                         74  (_merge==2)

    matched                             4,646
        not updated                     4,646  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. 
. 
. 
. replace CCname="new " + spatype if _merge==1 & strpos(spatype, "tx")
(11 real changes made)

. 
. replace CC="999" if strpos(CCname, "new")
(11 real changes made)

. 
. noi di "new spatypes that were not on Ridom database"
new spatypes that were not on Ridom database

. 
. noi list if CC=="999"

      +------------------------------------------------------------------------+
      | patid   timepo~t   spanum   spatype    CC     CCname            _merge |
      |------------------------------------------------------------------------|
4647. |   671         80        1      txAE   999   new txAE   master only (1) |
4648. |   671         86        1      txAE   999   new txAE   master only (1) |
4649. |   671         88        1      txAE   999   new txAE   master only (1) |
4650. |  1231         82        1      txAG   999   new txAG   master only (1) |
4651. |  1231         78        1      txAG   999   new txAG   master only (1) |
      |------------------------------------------------------------------------|
4652. |  1295         82        1      txAH   999   new txAH   master only (1) |
4653. |   424         86        1      txAI   999   new txAI   master only (1) |
4654. |   424         80        1      txAI   999   new txAI   master only (1) |
4655. |   424         84        1      txAI   999   new txAI   master only (1) |
4656. |   424         88        1      txAI   999   new txAI   master only (1) |
      |------------------------------------------------------------------------|
4657. |  1332         82        1      txAJ   999   new txAJ   master only (1) |
      +------------------------------------------------------------------------+

. 
. assert CC!="" if _merge==1

. 
. drop if _merge==2
(74 observations deleted)

. 
. assert inlist(_merge, 1,3)

. 
. drop _merge

. 
. 
. 
. * save matching of spatypes to CC

. 
. preserve
already preserved
r(621);

. 
. keep spatype CC CCname

. 
. duplicates drop

Duplicates in terms of all variables

(4,312 observations deleted)

. 
. save "E:\users\amy.mason\staph_carriage\Datasets\CCnames", replace
file E:\users\amy.mason\staph_carriage\Datasets\CCnames.dta saved

. 
. restore

. 
. 
. 
. * start counting types

. 
. sort spatype CC 
variable spatype not found
r(111);

. 
. noi by spatype: assert CC[_n]==CC[1]
variable spatype not found
r(111);

. 
. gen count=1

. 
. 
. 
. * add summary of data to 

. 
. collapse (sum) count, by(spatype CC CCname)
variable spatype not found
(error in option by())
r(111);

. 
. summ count

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       count |    115,836           1           0          1          1

. 
. noi di "Number of distinct spatypes seen " r(N)
Number of distinct spatypes seen 115836

. 
. noi di "list of spatypes where more than 100 samples seens"
list of spatypes where more than 100 samples seens

. 
. noi list spatype CC* count if count> 100 
variable spatype not found
r(111);

. 
. 
. 
. summ count if strpos(CC, "#")
CC not found
r(111);

. 
. noi display r(N) " distinct standalone spatypes found in " r(sum) " samples"
115836 distinct standalone spatypes found in 115836 samples

. 
. noi di "stand alone samples"
stand alone samples

. 
. sort CC
variable CC not found
r(111);

. 
. noi list spatype CC if  strpos(CC, "#")
variable spatype not found
r(111);

. 
. 
. 
. summ count if strpos(CCname, "no")
CCname not found
r(111);

. 
. noi display r(N) " distinct spatypes in CC with no founder, found in " r(sum) " samples"
115836 distinct spatypes in CC with no founder, found in 115836 samples

. 
. noi list spatype CC* count if strpos(CCname, "no")
variable spatype not found
r(111);

. 
. 
. 
. summ count if strpos(CC, "Ex")
CC not found
r(111);

. 
. noi display r(N) " distinct spatypes excluded, found in " r(sum) " samples"
115836 distinct spatypes excluded, found in 115836 samples

. 
. noi list spatype CC* count if  strpos(CC, "Ex")
variable spatype not found
r(111);

. 
. * create list of all spatypes

. 
. use "E:\users\amy.mason\staph_carriage\Datasets\clean_data.dta", clear

. 
. keep patid timepoint spatype

. 
. split spatype, parse(/)
variables created as string: 
spatype1  spatype2  spatype3  spatype4  spatype5

. 
. drop spatype

. 
. reshape long spatype, i(patid timepoint) j(spanum)
(note: j = 1 2 3 4 5)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                     8992   ->   44960
Number of variables                   7   ->       4
j variable (5 values)                     ->   spanum
xij variables:
         spatype1 spatype2 ... spatype5   ->   spatype
-----------------------------------------------------------------------------

. 
. drop if spatype==""
(40,303 observations deleted)

. 
. 
. 
. * merge with CC groups data

. 
. merge m:1 spatype using "E:\users\amy.mason\staph_carriage\Datasets\CC", update

    Result                           # of obs.
    -----------------------------------------
    not matched                            85
        from master                        11  (_merge==1)
        from using                         74  (_merge==2)

    matched                             4,646
        not updated                     4,646  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. 
. 
. 
. replace CCname="new " + spatype if _merge==1 & strpos(spatype, "tx")
(11 real changes made)

. 
. replace CC="999" if strpos(CCname, "new")
(11 real changes made)

. 
. noi di "new spatypes that were not on Ridom database"
new spatypes that were not on Ridom database

. 
. noi list if CC=="999"

      +------------------------------------------------------------------------+
      | patid   timepo~t   spanum   spatype    CC     CCname            _merge |
      |------------------------------------------------------------------------|
4647. |   671         86        1      txAE   999   new txAE   master only (1) |
4648. |   671         80        1      txAE   999   new txAE   master only (1) |
4649. |   671         88        1      txAE   999   new txAE   master only (1) |
4650. |  1231         78        1      txAG   999   new txAG   master only (1) |
4651. |  1231         82        1      txAG   999   new txAG   master only (1) |
      |------------------------------------------------------------------------|
4652. |  1295         82        1      txAH   999   new txAH   master only (1) |
4653. |   424         80        1      txAI   999   new txAI   master only (1) |
4654. |   424         88        1      txAI   999   new txAI   master only (1) |
4655. |   424         84        1      txAI   999   new txAI   master only (1) |
4656. |   424         86        1      txAI   999   new txAI   master only (1) |
      |------------------------------------------------------------------------|
4657. |  1332         82        1      txAJ   999   new txAJ   master only (1) |
      +------------------------------------------------------------------------+

. 
. assert CC!="" if _merge==1

. 
. drop if _merge==2
(74 observations deleted)

. 
. assert inlist(_merge, 1,3)

. 
. drop _merge

. 
. 
. 
. * save matching of spatypes to CC

. 
. preserve

. 
. keep spatype CC CCname

. 
. duplicates drop

Duplicates in terms of all variables

(4,312 observations deleted)

. 
. save "E:\users\amy.mason\staph_carriage\Datasets\CCnames", replace
file E:\users\amy.mason\staph_carriage\Datasets\CCnames.dta saved

. 
. restore

. 
. 
. 
. * start counting types

. 
. sort spatype CC 

. 
. noi by spatype: assert CC[_n]==CC[1]

. 
. gen count=1

. 
. 
. 
. * add summary of data to 

. 
. collapse (sum) count, by(spatype CC CCname)

. 
. summ count

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       count |        345    13.49855    27.17344          1        360

. 
. noi di "Number of distinct spatypes seen " r(N)
Number of distinct spatypes seen 345

. 
. noi di "list of spatypes where more than 100 samples seens"
list of spatypes where more than 100 samples seens

. 
. noi list spatype CC* count if count> 100 

     +------------------------------------+
     | spatype   CC        CCname   count |
     |------------------------------------|
  1. |    t002    4    spa-CC 002     119 |
  3. |    t005    2    spa-CC 005     113 |
  7. |    t012    1    spa-CC 084     360 |
 12. |    t021    1    spa-CC 084     108 |
 28. |    t084    1    spa-CC 084     146 |
     |------------------------------------|
 62. |    t127    1    spa-CC 084     134 |
     +------------------------------------+

. 
. 
. 
. summ count if strpos(CC, "#")

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       count |         28    5.035714    5.859352          1         30

. 
. noi display r(N) " distinct standalone spatypes found in " r(sum) " samples"
28 distinct standalone spatypes found in 141 samples

. 
. noi di "stand alone samples"
stand alone samples

. 
. sort CC

. 
. noi list spatype CC if  strpos(CC, "#")

     +----------------+
     | spatype     CC |
     |----------------|
  1. |    t273     #1 |
  2. |   t1736    #10 |
  3. |   t3610    #11 |
  4. |   t6154    #14 |
  5. |   t6292    #15 |
     |----------------|
  6. |   t6794    #16 |
  7. |   t6800    #17 |
  8. |   t6814    #19 |
  9. |    t537     #2 |
 10. |   t6820    #20 |
     |----------------|
 11. |   t6821    #21 |
 12. |   t6823    #22 |
 13. |   t6825    #23 |
 14. |   t6828    #24 |
 15. |   t6833    #25 |
     |----------------|
 16. |   t8062    #26 |
 17. |   t8585    #28 |
 18. |    t730     #3 |
 19. |   t8811    #30 |
 20. |   t9794    #32 |
     |----------------|
 21. |  t10514    #34 |
 22. |  t11040    #35 |
 23. |  t14942    #36 |
 24. |    t773     #4 |
 25. |    t939     #6 |
     |----------------|
 26. |   t1166     #7 |
 27. |   t1362     #8 |
 28. |   t1445     #9 |
     +----------------+

. 
. 
. 
. summ count if strpos(CCname, "no")

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       count |          9           7    7.729812          1         25

. 
. noi display r(N) " distinct spatypes in CC with no founder, found in " r(sum) " samples"
9 distinct spatypes in CC with no founder, found in 63 samples

. 
. noi list spatype CC* count if strpos(CCname, "no")

     +------------------------------------+
     | spatype   CC        CCname   count |
     |------------------------------------|
234. |   t3072   15    no founder       1 |
235. |   t6806   15    no founder       6 |
236. |    t148   16    no founder       5 |
237. |   t3092   16    no founder      13 |
238. |  t15776   17    no founder       1 |
     |------------------------------------|
239. |    t337   17    no founder      25 |
240. |   t4549   18    no founder       2 |
241. |    t525   19    no founder       3 |
242. |    t375   19    no founder       7 |
     +------------------------------------+

. 
. 
. 
. summ count if strpos(CC, "Ex")

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       count |          0

. 
. noi display r(N) " distinct spatypes excluded, found in " r(sum) " samples"
0 distinct spatypes excluded, found in 0 samples

. 
. noi list spatype CC* count if  strpos(CC, "Ex")

. run getdata_sept16_ext.do
file getdata_sept16_ext.do not found
r(601);

. 
. cd "E:\users\amy.mason\staph_carriage\Programs"
E:\users\amy.mason\staph_carriage\Programs

. 
. 
. 
. set more off

. 
. * data input; contain instructions on updating data from Ridom and access database

. 
. run getdata_sept16_ext.do
