----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\users\amy.mason\staph_carriage\Programs\site.log
  log type:  text
 opened on:  25 Nov 2016, 15:49:28

. 
. noi di "Run by AMM on $S_DATE $S_TIME"
Run by AMM on 25 Nov 2016 15:49:28

. 
. cd E:\users\amy.mason\Pipeline_27_07_2016\Datasets
E:\users\amy.mason\Pipeline_27_07_2016\Datasets

. 
. 
. 
. use pipeline_clean_all_values_wide, clear

. 
. 
. 
. **************************

. 
. noi di  "Recall order is  Mykrobe Mykrobe Genefinder"
Recall order is  Mykrobe Mykrobe Genefinder

. 
. 
. 
. 
. 
. noi tab site ValueA, m

               |                                   ValueAll
          site |       AAA        AAP        APA        APP        PAP        PPA        PPP |     Total
---------------+-----------------------------------------------------------------------------+----------
      aac6aph2 |     1,300          0          2          1          0          0         76 |     1,379 
    aaddaph4ia |     1,291          0          2          0          0          0         86 |     1,379 
    aadeant6ia |     1,328          0         28          2          0          0         21 |     1,379 
        ant9ia |     1,227          0          4          3          0          0        145 |     1,379 
        ant9ib |     1,379          0          0          0          0          0          0 |     1,379 
        aph2ic |     1,379          0          0          0          0          0          0 |     1,379 
  apha3aph3iii |     1,327          0          0          1          0          0         51 |     1,379 
          arca |     1,372          0          1          0          0          0          6 |     1,379 
          arcb |     1,373          0          0          0          0          6          0 |     1,379 
          arcc |     1,373          0          0          0          0          6          0 |     1,379 
          arcd |     1,373          0          0          0          0          6          0 |     1,379 
          blaz |       222          0         19          7          0          1      1,130 |     1,379 
           cat |     1,379          0          0          0          0          0          0 |     1,379 
          ccra |     1,009          0          2          3          0          0        365 |     1,379 
          ccrb |     1,010          9          1         22          0          1        336 |     1,379 
         ccrca |     1,338          0          8          1          0          9         23 |     1,379 
         ccrcb |     1,333          0         22          0          0         22          2 |     1,379 
         ccrcc |     1,338          0         16          1          0          6         18 |     1,379 
           cfr |     1,376          0          0          1          0          0          2 |     1,379 
           chp |       449          0          1         46          0          0        883 |     1,379 
          dfra |     1,341          0          3          0          0          1         34 |     1,379 
          dfrb |     1,297          0          0          0          1          0         81 |     1,379 
          dfrc |     1,341          0          0          3          0         34          1 |     1,379 
          dfrd |     1,379          0          0          0          0          0          0 |     1,379 
          dfrg |     1,325          0          1          0          0          0         53 |     1,379 
          dfrk |     1,373          0          0          0          0          0          6 |     1,379 
          erma |     1,229          0          1          5          0          0        144 |     1,379 
          ermb |     1,375          0          1          0          0          0          3 |     1,379 
          ermc |     1,191          0         10          2          0          0        176 |     1,379 
          ermt |     1,359          0          0          0          0          0         20 |     1,379 
          ermy |     1,379          0          0          0          0          0          0 |     1,379 
           eta |     1,338          0          1          0          0          0         40 |     1,379 
           etb |     1,372          0          1          1          0          0          5 |     1,379 
           etd |     1,320          0          1          1          0          0         57 |     1,379 
          fusa |     1,320          0          0          2          0          0         57 |     1,379 
          fusb |     1,355          0          2          0          0          0         22 |     1,379 
          fusc |     1,302          0          1          2          0          0         74 |     1,379 
     grla/gyra |     1,072          0          1          0          2          0        304 |     1,379 
          iles |     1,379          0          0          0          0          0          0 |     1,379 
          isab |     1,379          0          0          0          0          0          0 |     1,379 
          lnua |     1,364          6          0          0          0          0          9 |     1,379 
          lnub |     1,378          0          0          0          0          0          1 |     1,379 
          lukm |     1,370          0          0          0          0          0          9 |     1,379 
         lukmf |     1,370          0          0          0          0          6          3 |     1,379 
        lukpvf |     1,266          0          2          0          0          0        111 |     1,379 
        lukpvs |     1,266          0          3          1          0          0        109 |     1,379 
          meca |       999          0          1          2          0          0        377 |     1,379 
          mecc |     1,362          0          0          0          0          0         17 |     1,379 
          mphc |     1,361          0          1          0          0          0         17 |     1,379 
          msra |     1,360          0          1          0          0          0         18 |     1,379 
          mupa |     1,362          2          0          0          0          0         15 |     1,379 
          mupb |     1,379          0          0          0          0          0          0 |     1,379 
          qaca |     1,333          0          1          1          0          0         44 |     1,379 
          qacb |     1,333          0          2          0          0         44          0 |     1,379 
       qaccsmr |     1,319          0          7          2          0          1         50 |     1,379 
          rpob |     1,354          0          1          0          1          0         23 |     1,379 
           sak |       306          0          3          5          0          0      1,065 |     1,379 
          sasx |     1,364          0          1          0          0         14          0 |     1,379 
          sat4 |     1,327          0          2          1          0          0         49 |     1,379 
           scn |       144          0          3         15          0          0      1,217 |     1,379 
           sea |     1,080          0          1          3          0          0        295 |     1,379 
           seb |     1,267          0          1          2          0          0        109 |     1,379 
           sec |     1,149          0          1          4          0          0        225 |     1,379 
           sed |     1,313          0          0          0          0          0         66 |     1,379 
           see |     1,375          0          0          0          0          0          4 |     1,379 
           seg |       600          0          6         20          0          0        753 |     1,379 
           seh |     1,241          0          2          2          0          0        134 |     1,379 
           sei |       596          0          3         33          0          6        741 |     1,379 
           sej |     1,310          0          0          0          0          0         69 |     1,379 
          selr |     1,312          0          0          0          0          0         67 |     1,379 
           sep |     1,268          0          0          2          0          1        108 |     1,379 
           seu |       595          0          2         57          0          0        725 |     1,379 
           str |     1,375          0          0          0          0          0          4 |     1,379 
          tetk |     1,272          0          4          4          0          0         99 |     1,379 
          tetl |     1,377          0          0          0          0          0          2 |     1,379 
          tetm |     1,339          0          1          1          0          0         38 |     1,379 
          teto |     1,379          0          0          0          0          0          0 |     1,379 
         tsst1 |     1,119          0          1          4          0          0        255 |     1,379 
          vana |     1,379          0          0          0          0          0          0 |     1,379 
          vanb |     1,379          0          0          0          0          0          0 |     1,379 
          vanc |     1,379          0          0          0          0          0          0 |     1,379 
          vgaa |     1,378          0          0          0          0          0          1 |     1,379 
          vgab |     1,379          0          0          0          0          0          0 |     1,379 
          vgba |     1,379          0          0          0          0          0          0 |     1,379 
---------------+-----------------------------------------------------------------------------+----------
         Total |   104,159         17        179        263          4        164     11,050 |   115,836 


. 
. gen agree  = (ValueA=="AAA"| ValueA=="PPP" )

. 
. drop if agree==1
(115,209 observations deleted)

. use pipeline_clean_all_values_wide, clear

. 
. 
. 
. **************************

. 
. noi di  "Recall order is  Mykrobe Mykrobe Genefinder"
Recall order is  Mykrobe Mykrobe Genefinder

. 
. 
. 
. gen agree  = (ValueA=="AAA"| ValueA=="PPP" )

. 
. drop if agree==1
(115,209 observations deleted)

. 
. noi di "disagreements: sites"
disagreements: sites

. 
. noi tab site, order
option order not allowed
r(198);

. 
. noi di "disagreements: samples"
disagreements: samples

. 
. noi tab sample, order
option order not allowed
r(198);

. 
. noi di "disagreements: set"
disagreements: set

. 
. noi tab set, order
option order not allowed
r(198);

. noi tab site, sort

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
           seu |         59        9.41        9.41
           chp |         47        7.50       16.91
          qacb |         46        7.34       24.24
         ccrcb |         44        7.02       31.26
           sei |         42        6.70       37.96
          dfrc |         37        5.90       43.86
          ccrb |         33        5.26       49.12
    aadeant6ia |         30        4.78       53.91
          blaz |         27        4.31       58.21
           seg |         26        4.15       62.36
         ccrcc |         23        3.67       66.03
         ccrca |         18        2.87       68.90
           scn |         18        2.87       71.77
          sasx |         15        2.39       74.16
          ermc |         12        1.91       76.08
       qaccsmr |         10        1.59       77.67
           sak |          8        1.28       78.95
          tetk |          8        1.28       80.22
        ant9ia |          7        1.12       81.34
          arcb |          6        0.96       82.30
          arcc |          6        0.96       83.25
          arcd |          6        0.96       84.21
          erma |          6        0.96       85.17
          lnua |          6        0.96       86.12
         lukmf |          6        0.96       87.08
          ccra |          5        0.80       87.88
           sec |          5        0.80       88.68
         tsst1 |          5        0.80       89.47
          dfra |          4        0.64       90.11
        lukpvs |          4        0.64       90.75
           sea |          4        0.64       91.39
           seh |          4        0.64       92.03
      aac6aph2 |          3        0.48       92.50
          fusc |          3        0.48       92.98
     grla/gyra |          3        0.48       93.46
          meca |          3        0.48       93.94
          sat4 |          3        0.48       94.42
           seb |          3        0.48       94.90
           sep |          3        0.48       95.37
    aaddaph4ia |          2        0.32       95.69
           etb |          2        0.32       96.01
           etd |          2        0.32       96.33
          fusa |          2        0.32       96.65
          fusb |          2        0.32       96.97
        lukpvf |          2        0.32       97.29
          mupa |          2        0.32       97.61
          qaca |          2        0.32       97.93
          rpob |          2        0.32       98.25
          tetm |          2        0.32       98.56
  apha3aph3iii |          1        0.16       98.72
          arca |          1        0.16       98.88
           cfr |          1        0.16       99.04
          dfrb |          1        0.16       99.20
          dfrg |          1        0.16       99.36
          ermb |          1        0.16       99.52
           eta |          1        0.16       99.68
          mphc |          1        0.16       99.84
          msra |          1        0.16      100.00
---------------+-----------------------------------
         Total |        627      100.00

. noi di "disagreements: sites"
disagreements: sites

. 
. noi tab site, sort

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
           seu |         59        9.41        9.41
           chp |         47        7.50       16.91
          qacb |         46        7.34       24.24
         ccrcb |         44        7.02       31.26
           sei |         42        6.70       37.96
          dfrc |         37        5.90       43.86
          ccrb |         33        5.26       49.12
    aadeant6ia |         30        4.78       53.91
          blaz |         27        4.31       58.21
           seg |         26        4.15       62.36
         ccrcc |         23        3.67       66.03
         ccrca |         18        2.87       68.90
           scn |         18        2.87       71.77
          sasx |         15        2.39       74.16
          ermc |         12        1.91       76.08
       qaccsmr |         10        1.59       77.67
           sak |          8        1.28       78.95
          tetk |          8        1.28       80.22
        ant9ia |          7        1.12       81.34
          arcb |          6        0.96       82.30
          arcc |          6        0.96       83.25
          arcd |          6        0.96       84.21
          erma |          6        0.96       85.17
          lnua |          6        0.96       86.12
         lukmf |          6        0.96       87.08
          ccra |          5        0.80       87.88
           sec |          5        0.80       88.68
         tsst1 |          5        0.80       89.47
          dfra |          4        0.64       90.11
        lukpvs |          4        0.64       90.75
           sea |          4        0.64       91.39
           seh |          4        0.64       92.03
      aac6aph2 |          3        0.48       92.50
          fusc |          3        0.48       92.98
     grla/gyra |          3        0.48       93.46
          meca |          3        0.48       93.94
          sat4 |          3        0.48       94.42
           seb |          3        0.48       94.90
           sep |          3        0.48       95.37
    aaddaph4ia |          2        0.32       95.69
           etb |          2        0.32       96.01
           etd |          2        0.32       96.33
          fusa |          2        0.32       96.65
          fusb |          2        0.32       96.97
        lukpvf |          2        0.32       97.29
          mupa |          2        0.32       97.61
          qaca |          2        0.32       97.93
          rpob |          2        0.32       98.25
          tetm |          2        0.32       98.56
  apha3aph3iii |          1        0.16       98.72
          arca |          1        0.16       98.88
           cfr |          1        0.16       99.04
          dfrb |          1        0.16       99.20
          dfrg |          1        0.16       99.36
          ermb |          1        0.16       99.52
           eta |          1        0.16       99.68
          mphc |          1        0.16       99.84
          msra |          1        0.16      100.00
---------------+-----------------------------------
         Total |        627      100.00

. 
. noi di "disagreements: samples"
disagreements: samples

. 
. noi tab sample, sort

           Sample_id |      Freq.     Percent        Cum.
---------------------+-----------------------------------
    RH11000301-155-1 |         21        3.35        3.35
 H094920323-271-A1-2 |         10        1.59        4.94
    H113640238-143-1 |          9        1.44        6.38
           C00003385 |          8        1.28        7.66
           C00003320 |          7        1.12        8.77
           C00003248 |          6        0.96        9.73
           C00003272 |          6        0.96       10.69
           C00003315 |          6        0.96       11.64
    H122880144-207-1 |          6        0.96       12.60
    H133580080-596-1 |          6        0.96       13.56
           C00003152 |          5        0.80       14.35
           C00003421 |          5        0.80       15.15
           C00003423 |          5        0.80       15.95
           C00003425 |          5        0.80       16.75
    H092520302-216-1 |          5        0.80       17.54
    H110740135-193-2 |          5        0.80       18.34
    H113560219-469-2 |          5        0.80       19.14
H114140657-280-B01-2 |          5        0.80       19.94
    H114160352-129-1 |          5        0.80       20.73
    H121120058-504-1 |          5        0.80       21.53
    H121320081-505-1 |          5        0.80       22.33
 H125000105-229-G0-2 |          5        0.80       23.13
    H125000105-833-2 |          5        0.80       23.92
    H133000236-626-1 |          5        0.80       24.72
    H133020301-629-1 |          5        0.80       25.52
    H133120386-618-1 |          5        0.80       26.32
    H133300151-657-1 |          5        0.80       27.11
    H133720214-574-1 |          5        0.80       27.91
    H133720215-575-1 |          5        0.80       28.71
    H133860126-577-1 |          5        0.80       29.51
    H133960276-571-1 |          5        0.80       30.30
           C00003134 |          4        0.64       30.94
           C00003207 |          4        0.64       31.58
           C00003317 |          4        0.64       32.22
           C00003340 |          4        0.64       32.85
           C00003377 |          4        0.64       33.49
           C00003382 |          4        0.64       34.13
           C00003393 |          4        0.64       34.77
           C00003406 |          4        0.64       35.41
H105040039-373-G12-2 |          4        0.64       36.04
    H114720434-145-1 |          4        0.64       36.68
           C00001086 |          3        0.48       37.16
           C00001446 |          3        0.48       37.64
           C00002656 |          3        0.48       38.12
           C00003140 |          3        0.48       38.60
           C00003229 |          3        0.48       39.07
           C00003301 |          3        0.48       39.55
           C00003318 |          3        0.48       40.03
           C00003321 |          3        0.48       40.51
           C00003337 |          3        0.48       40.99
           C00003341 |          3        0.48       41.47
           C00003347 |          3        0.48       41.95
           C00003411 |          3        0.48       42.42
           C00007064 |          3        0.48       42.90
           C00008638 |          3        0.48       43.38
           C00013217 |          3        0.48       43.86
    H104420250-444-2 |          3        0.48       44.34
    H110820268-195-2 |          3        0.48       44.82
 H120420116-223-A0-2 |          3        0.48       45.30
 H120600058-224-B0-2 |          3        0.48       45.77
    H121320099-507-1 |          3        0.48       46.25
    H121340220-509-1 |          3        0.48       46.73
H122900151-350-H09-2 |          3        0.48       47.21
    H123120336-557-1 |          3        0.48       47.69
H124420844-355-E10-2 |          3        0.48       48.17
    H132540570-419-2 |          3        0.48       48.64
    RH08000028-150-1 |          3        0.48       49.12
RH11000090-289-C02-2 |          3        0.48       49.60
           C00000785 |          2        0.32       49.92
           C00000786 |          2        0.32       50.24
           C00000790 |          2        0.32       50.56
           C00000800 |          2        0.32       50.88
           C00000815 |          2        0.32       51.20
           C00000817 |          2        0.32       51.52
           C00001091 |          2        0.32       51.83
           C00001265 |          2        0.32       52.15
           C00003122 |          2        0.32       52.47
           C00003130 |          2        0.32       52.79
           C00003137 |          2        0.32       53.11
           C00003165 |          2        0.32       53.43
           C00003306 |          2        0.32       53.75
           C00003307 |          2        0.32       54.07
           C00003314 |          2        0.32       54.39
           C00003333 |          2        0.32       54.70
           C00003339 |          2        0.32       55.02
           C00003389 |          2        0.32       55.34
           C00003395 |          2        0.32       55.66
           C00003396 |          2        0.32       55.98
           C00003397 |          2        0.32       56.30
           C00003415 |          2        0.32       56.62
           C00003419 |          2        0.32       56.94
           C00003422 |          2        0.32       57.26
           C00012749 |          2        0.32       57.58
           C00013230 |          2        0.32       57.89
 H101120403-273-C1-2 |          2        0.32       58.21
    H104080090-443-2 |          2        0.32       58.53
    H104600048-190-2 |          2        0.32       58.85
    H105020486-191-2 |          2        0.32       59.17
H105260391-374-H12-2 |          2        0.32       59.49
    H110520238-116-2 |          2        0.32       59.81
    H111640001-197-2 |          2        0.32       60.13
    H113640215-127-2 |          2        0.32       60.45
 H114080202-255-A1-2 |          2        0.32       60.77
    H114120077-144-1 |          2        0.32       61.08
H114680370-339-E08-2 |          2        0.32       61.40
    H120440759-384-2 |          2        0.32       61.72
 H120840083-225-C0-2 |          2        0.32       62.04
    H121000455-532-1 |          2        0.32       62.36
    H121300130-139-1 |          2        0.32       62.68
    H121320082-506-1 |          2        0.32       63.00
H122560310-348-F09-2 |          2        0.32       63.32
    H123100271-555-1 |          2        0.32       63.64
    H123120337-556-1 |          2        0.32       63.96
H123700164-353-C10-2 |          2        0.32       64.27
    H124860349-210-1 |          2        0.32       64.59
    H124940430-401-1 |          2        0.32       64.91
H130240275-357-G10-2 |          2        0.32       65.23
    H132620132-420-2 |          2        0.32       65.55
    H133180046-621-1 |          2        0.32       65.87
    H133180047-622-1 |          2        0.32       66.19
    H133520197-646-1 |          2        0.32       66.51
    H133760113-576-1 |          2        0.32       66.83
    H133920237-578-1 |          2        0.32       67.15
    RH10000448-161-1 |          2        0.32       67.46
 RH11000042-258-D1-2 |          2        0.32       67.78
RH11000044-286-H01-2 |          2        0.32       68.10
RH11000072-288-B02-2 |          2        0.32       68.42
 RH12000505-239-A0-2 |          2        0.32       68.74
    RH12000540-156-1 |          2        0.32       69.06
           C00000784 |          1        0.16       69.22
           C00000787 |          1        0.16       69.38
           C00000788 |          1        0.16       69.54
           C00000789 |          1        0.16       69.70
           C00000799 |          1        0.16       69.86
           C00000806 |          1        0.16       70.02
           C00000808 |          1        0.16       70.18
           C00000809 |          1        0.16       70.33
           C00000816 |          1        0.16       70.49
           C00000818 |          1        0.16       70.65
           C00000820 |          1        0.16       70.81
           C00000828 |          1        0.16       70.97
           C00000829 |          1        0.16       71.13
           C00000831 |          1        0.16       71.29
           C00000857 |          1        0.16       71.45
           C00001079 |          1        0.16       71.61
           C00001080 |          1        0.16       71.77
           C00001100 |          1        0.16       71.93
           C00001102 |          1        0.16       72.09
           C00001226 |          1        0.16       72.25
           C00001240 |          1        0.16       72.41
           C00001387 |          1        0.16       72.57
           C00002620 |          1        0.16       72.73
           C00003084 |          1        0.16       72.89
           C00003092 |          1        0.16       73.05
           C00003093 |          1        0.16       73.21
           C00003111 |          1        0.16       73.37
           C00003115 |          1        0.16       73.52
           C00003121 |          1        0.16       73.68
           C00003125 |          1        0.16       73.84
           C00003144 |          1        0.16       74.00
           C00003155 |          1        0.16       74.16
           C00003158 |          1        0.16       74.32
           C00003164 |          1        0.16       74.48
           C00003176 |          1        0.16       74.64
           C00003195 |          1        0.16       74.80
           C00003221 |          1        0.16       74.96
           C00003223 |          1        0.16       75.12
           C00003224 |          1        0.16       75.28
           C00003240 |          1        0.16       75.44
           C00003242 |          1        0.16       75.60
           C00003249 |          1        0.16       75.76
           C00003250 |          1        0.16       75.92
           C00003252 |          1        0.16       76.08
           C00003253 |          1        0.16       76.24
           C00003254 |          1        0.16       76.40
           C00003259 |          1        0.16       76.56
           C00003260 |          1        0.16       76.71
           C00003270 |          1        0.16       76.87
           C00003277 |          1        0.16       77.03
           C00003278 |          1        0.16       77.19
           C00003290 |          1        0.16       77.35
           C00003292 |          1        0.16       77.51
           C00003302 |          1        0.16       77.67
           C00003303 |          1        0.16       77.83
           C00003319 |          1        0.16       77.99
           C00003332 |          1        0.16       78.15
           C00003348 |          1        0.16       78.31
           C00003351 |          1        0.16       78.47
           C00003352 |          1        0.16       78.63
           C00003354 |          1        0.16       78.79
           C00003355 |          1        0.16       78.95
           C00003362 |          1        0.16       79.11
           C00003379 |          1        0.16       79.27
           C00003381 |          1        0.16       79.43
           C00003410 |          1        0.16       79.59
           C00003414 |          1        0.16       79.74
           C00007083 |          1        0.16       79.90
           C00007096 |          1        0.16       80.06
           C00008625 |          1        0.16       80.22
           C00008949 |          1        0.16       80.38
           C00008960 |          1        0.16       80.54
           C00012738 |          1        0.16       80.70
           C00012775 |          1        0.16       80.86
           C00012776 |          1        0.16       81.02
           C00012780 |          1        0.16       81.18
           C00012784 |          1        0.16       81.34
           C00013162 |          1        0.16       81.50
           C00013165 |          1        0.16       81.66
           C00013195 |          1        0.16       81.82
           C00013213 |          1        0.16       81.98
           C00013221 |          1        0.16       82.14
           C00013224 |          1        0.16       82.30
           C00013231 |          1        0.16       82.46
           C00013235 |          1        0.16       82.62
           C00013241 |          1        0.16       82.78
           C00013248 |          1        0.16       82.93
           C00013318 |          1        0.16       83.09
           C00013326 |          1        0.16       83.25
           C00013335 |          1        0.16       83.41
           C00013362 |          1        0.16       83.57
           C00013364 |          1        0.16       83.73
           C00013367 |          1        0.16       83.89
           C00013393 |          1        0.16       84.05
           C00013401 |          1        0.16       84.21
           C00013406 |          1        0.16       84.37
    H034660053-158-1 |          1        0.16       84.53
H065060092-367-A12-2 |          1        0.16       84.69
 H065120079-263-A1-2 |          1        0.16       84.85
 H074780626-266-D1-2 |          1        0.16       85.01
    H080980484-164-1 |          1        0.16       85.17
 H082600495-244-F0-2 |          1        0.16       85.33
 H091100226-245-G0-2 |          1        0.16       85.49
 H093620523-269-G1-2 |          1        0.16       85.65
    H100140197-167-2 |          1        0.16       85.81
    H100200151-169-2 |          1        0.16       85.96
    H100800158-172-2 |          1        0.16       86.12
    H101020134-173-2 |          1        0.16       86.28
    H101520278-175-2 |          1        0.16       86.44
    H101580214-176-2 |          1        0.16       86.60
 H101740329-274-D1-2 |          1        0.16       86.76
 H101740629-240-B0-2 |          1        0.16       86.92
 H102820334-277-G1-2 |          1        0.16       87.08
 H102840444-246-H0-2 |          1        0.16       87.24
    H103060332-756-2 |          1        0.16       87.40
    H103220288-184-2 |          1        0.16       87.56
 H103360314-241-C0-2 |          1        0.16       87.72
    H103440108-442-2 |          1        0.16       87.88
H103560109-371-E12-2 |          1        0.16       88.04
 H104340410-220-F0-2 |          1        0.16       88.20
    H104420050-188-2 |          1        0.16       88.36
 H105020135-247-A0-2 |          1        0.16       88.52
 H105140339-248-B0-2 |          1        0.16       88.68
    H111600186-455-2 |          1        0.16       88.84
    H111740190-456-2 |          1        0.16       89.00
    H111940137-460-2 |          1        0.16       89.15
H111960080-332-F07-2 |          1        0.16       89.31
    H112060137-461-2 |          1        0.16       89.47
    H112540036-142-1 |          1        0.16       89.63
    H112660153-200-1 |          1        0.16       89.79
    H113020155-466-2 |          1        0.16       89.95
    H113140144-468-2 |          1        0.16       90.11
H113420072-336-B08-2 |          1        0.16       90.27
    H113880160-476-1 |          1        0.16       90.43
    H113920345-478-1 |          1        0.16       90.59
    H114340058-470-2 |          1        0.16       90.75
    H114700366-481-1 |          1        0.16       90.91
    H114720432-482-1 |          1        0.16       91.07
    H120220271-381-2 |          1        0.16       91.23
    H120680309-385-2 |          1        0.16       91.39
H120860096-346-D09-2 |          1        0.16       91.55
    H121060252-533-1 |          1        0.16       91.71
    H121100042-534-1 |          1        0.16       91.87
    H121120051-535-1 |          1        0.16       92.03
    H121800040-510-1 |          1        0.16       92.19
    H122660093-513-1 |          1        0.16       92.34
    H122840129-206-1 |          1        0.16       92.50
    H122960028-515-1 |          1        0.16       92.66
    H122960030-517-1 |          1        0.16       92.82
    H123020176-551-1 |          1        0.16       92.98
    H123020177-552-1 |          1        0.16       93.14
    H123020178-553-1 |          1        0.16       93.30
    H123100270-554-1 |          1        0.16       93.46
    H123120338-558-1 |          1        0.16       93.62
    H123220266-561-1 |          1        0.16       93.78
    H124060094-134-1 |          1        0.16       93.94
 H124420845-227-E0-2 |          1        0.16       94.10
    H124720623-209-1 |          1        0.16       94.26
H125280642-356-F10-2 |          1        0.16       94.42
    H125280642-841-2 |          1        0.16       94.58
    H130660215-405-2 |          1        0.16       94.74
    H131660094-412-2 |          1        0.16       94.90
    H131800554-414-2 |          1        0.16       95.06
    H131800573-415-2 |          1        0.16       95.22
    H132280003-416-2 |          1        0.16       95.37
    H132920375-623-1 |          1        0.16       95.53
    H133060079-613-1 |          1        0.16       95.69
    H133100176-615-1 |          1        0.16       95.85
    H133200270-608-1 |          1        0.16       96.01
    H133240054-609-1 |          1        0.16       96.17
    H133560609-593-1 |          1        0.16       96.33
    H133580086-601-1 |          1        0.16       96.49
    H133580087-582-1 |          1        0.16       96.65
    H133900439-581-1 |          1        0.16       96.81
    H133960268-568-1 |          1        0.16       96.97
    H133960269-569-1 |          1        0.16       97.13
 RH07000425-233-C0-2 |          1        0.16       97.29
 RH10000375-235-E0-2 |          1        0.16       97.45
 RH10000389-236-F0-2 |          1        0.16       97.61
RH11000029-284-F01-2 |          1        0.16       97.77
RH11000133-292-F02-2 |          1        0.16       97.93
RH11000142-293-G02-2 |          1        0.16       98.09
RH11000146-294-H02-2 |          1        0.16       98.25
RH12000046-298-D03-2 |          1        0.16       98.41
RH12000340-301-G03-2 |          1        0.16       98.56
RH12000346-307-E04-2 |          1        0.16       98.72
    RH12000366-426-2 |          1        0.16       98.88
    RH12000370-430-2 |          1        0.16       99.04
    RH12000374-434-2 |          1        0.16       99.20
    RH12000375-435-2 |          1        0.16       99.36
    RH12000376-436-2 |          1        0.16       99.52
    RH12000379-439-2 |          1        0.16       99.68
    RH12000381-441-2 |          1        0.16       99.84
 RH12000503-261-G1-2 |          1        0.16      100.00
---------------------+-----------------------------------
               Total |        627      100.00

. 
. noi di "disagreements: set"
disagreements: set

. 
. noi tab set, sort

        set |      Freq.     Percent        Cum.
------------+-----------------------------------
 Collindale |        349       55.66       55.66
  Oxford501 |        233       37.16       92.82
  Oxford491 |         45        7.18      100.00
------------+-----------------------------------
      Total |        627      100.00

. noi tab site set

               |               set
          site | Collind..  Oxford491  Oxford501 |     Total
---------------+---------------------------------+----------
      aac6aph2 |         3          0          0 |         3 
    aaddaph4ia |         0          0          2 |         2 
    aadeant6ia |        25          1          4 |        30 
        ant9ia |         4          0          3 |         7 
  apha3aph3iii |         0          0          1 |         1 
          arca |         1          0          0 |         1 
          arcb |         3          1          2 |         6 
          arcc |         3          1          2 |         6 
          arcd |         3          1          2 |         6 
          blaz |        19          4          4 |        27 
          ccra |         3          0          2 |         5 
          ccrb |         4          7         22 |        33 
         ccrca |        16          1          1 |        18 
         ccrcb |        39          2          3 |        44 
         ccrcc |        21          0          2 |        23 
           cfr |         1          0          0 |         1 
           chp |         3          4         40 |        47 
          dfra |         4          0          0 |         4 
          dfrb |         0          1          0 |         1 
          dfrc |        37          0          0 |        37 
          dfrg |         1          0          0 |         1 
          erma |         3          0          3 |         6 
          ermb |         0          0          1 |         1 
          ermc |         2          4          6 |        12 
           eta |         1          0          0 |         1 
           etb |         1          1          0 |         2 
           etd |         1          0          1 |         2 
          fusa |         0          0          2 |         2 
          fusb |         1          0          1 |         2 
          fusc |         1          0          2 |         3 
     grla/gyra |         2          0          1 |         3 
          lnua |         6          0          0 |         6 
         lukmf |         6          0          0 |         6 
        lukpvf |         2          0          0 |         2 
        lukpvs |         3          0          1 |         4 
          meca |         3          0          0 |         3 
          mphc |         1          0          0 |         1 
          msra |         0          0          1 |         1 
          mupa |         2          0          0 |         2 
          qaca |         2          0          0 |         2 
          qacb |        38          8          0 |        46 
       qaccsmr |         2          2          6 |        10 
          rpob |         1          0          1 |         2 
           sak |         4          0          4 |         8 
          sasx |        15          0          0 |        15 
          sat4 |         1          0          2 |         3 
           scn |         3          0         15 |        18 
           sea |         2          0          2 |         4 
           seb |         1          1          1 |         3 
           sec |         2          0          3 |         5 
           seg |         2          2         22 |        26 
           seh |         2          0          2 |         4 
           sei |        14          1         27 |        42 
           sep |         0          1          2 |         3 
           seu |        28          2         29 |        59 
          tetk |         5          0          3 |         8 
          tetm |         0          0          2 |         2 
         tsst1 |         2          0          3 |         5 
---------------+---------------------------------+----------
         Total |       349         45        233 |       627 


. import excel "E:\users\amy.mason\Pipeline_27_07_2016\Inputs\Typewriter_thresholds_10Feb15.xlsx", sheet("target list 1") firstrow
>  clear

. import excel "E:\users\amy.mason\Pipeline_27_07_2016\Inputs\Typewriter_thresholds_10Feb15.xlsx", sheet("target list 1") firstrow
>  clear

. 
. rename s 23s
1 new variable name invalid
    You attempted to rename s to 23s.  That is an invalid Stata variable name.
r(198);

. 
. * picks up extra blank line from excel  - drop

. 
. drop if Sample ==""
Sample not found
r(111);

. 
. gen method="typewriter coverage"

. 
. rename BLASTDV sample
variable BLASTDV not found
r(111);

. 
. *reshape to one line per site/sample

. 
. renpfix "" value

. 
. rename valuesample sample
variable valuesample not found
r(111);

. 
. rename valuemethod method

. 
. reshape long value, i(sample method comments) j(site) string
variable sample not found
r(111);

. 
. save coverage_tw, replace
(note: file coverage_tw.dta not found)
file coverage_tw.dta saved

. noi di "typewriter coverage"
typewriter coverage

. 
. 
. 
. import excel "E:\users\amy.mason\Pipeline_27_07_2016\Inputs\Typewriter_thresholds_10Feb15.xlsx", sheet("target list 1") firstrow
>  clear

. 
. rename s twentythree_s

. 
. * picks up extra blank line from excel  - drop

. 
. drop if Sample ==""
Sample not found
r(111);

. 
. gen method="typewriter coverage"

. 
. rename BLASTDB sample

. 
. *reshape to one line per site/sample

. 
. renpfix "" value

. 
. rename valuesample sample

. 
. rename valuemethod method

. 
. reshape long value, i(sample method comments) j(site) string
variable comments not found
r(111);

. 
. save coverage_tw, replace
file coverage_tw.dta saved

. noi di "typewriter coverage"
typewriter coverage

. 
. 
. 
. import excel "E:\users\amy.mason\Pipeline_27_07_2016\Inputs\Typewriter_thresholds_10Feb15.xlsx", sheet("target list 1") firstrow
>  clear

. 
. rename s twentythree_s

. 
. * picks up extra blank line from excel  - drop

. 
. gen method="typewriter coverage"

. 
. rename BLASTDB sample

. 
. drop if sample ==""
(0 observations deleted)

. 
. *reshape to one line per site/sample

. 
. renpfix "" value

. 
. rename valuesample sample

. 
. rename valuemethod method

. 
. reshape long value, i(sample method) j(site) string
(note: j = IsaB aac6aph2 aadDaph4Ia aadEant6Ia ant9_Iaspc ant9_Ibspc aph2Ic aphA3aph3III blaZ cat cfr dfrB_1 dfrB_2 dfr_A dfr_C df
> r_D dfr_G dfr_K ermA_1 ermA_2 ermB ermC ermT ermY fusA_1 fusA_2 fusA_3 fus_B fus_C grlA_1 grlA_2 grlA_3 gyrA_1 gyrA_2 gyrA_3 gyr
> A_4 ileS_1 ileS_2 ileS_3 lnu_A lnu_B mecA mecC mphC msrA mupA mupB rpoB_1 rpoB_2 sat4 str tetK tetL tetM tetO twentythree_s van_
> A van_B van_C vgaA vgaB vgbA)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                     1390   ->   86180
Number of variables                  64   ->       4
j variable (62 values)                    ->   site
xij variables:
  valueIsaB valueaac6aph2 ... valuevgbA   ->   value
-----------------------------------------------------------------------------

. 
. save coverage_tw, replace
file coverage_tw.dta saved

. import excel "E:\users\amy.mason\Pipeline_27_07_2016\Inputs\Typewriter_thresholds_10Feb15.xlsx", sheet("target list 2") firstrow
>  clear

. 
. * typewriter sets

. 
. noi di "typewriter coverage"
typewriter coverage

. 
. 
. 
. import excel "E:\users\amy.mason\Pipeline_27_07_2016\Inputs\Typewriter_thresholds_10Feb15.xlsx", sheet("target list 1") firstrow
>  clear

. 
. rename s twentythree_s

. 
. gen method="typewriter coverage"

. 
. rename BLASTDB sample

. 
. drop if sample ==""
(0 observations deleted)

. 
. *reshape to one line per site/sample

. 
. renpfix "" value

. 
. rename valuesample sample

. 
. rename valuemethod method

. 
. reshape long value, i(sample method) j(site) string
(note: j = IsaB aac6aph2 aadDaph4Ia aadEant6Ia ant9_Iaspc ant9_Ibspc aph2Ic aphA3aph3III blaZ cat cfr dfrB_1 dfrB_2 dfr_A dfr_C df
> r_D dfr_G dfr_K ermA_1 ermA_2 ermB ermC ermT ermY fusA_1 fusA_2 fusA_3 fus_B fus_C grlA_1 grlA_2 grlA_3 gyrA_1 gyrA_2 gyrA_3 gyr
> A_4 ileS_1 ileS_2 ileS_3 lnu_A lnu_B mecA mecC mphC msrA mupA mupB rpoB_1 rpoB_2 sat4 str tetK tetL tetM tetO twentythree_s van_
> A van_B van_C vgaA vgaB vgbA)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                     1390   ->   86180
Number of variables                  64   ->       4
j variable (62 values)                    ->   site
xij variables:
  valueIsaB valueaac6aph2 ... valuevgbA   ->   value
-----------------------------------------------------------------------------

. 
. save coverage_tw1, replace
(note: file coverage_tw1.dta not found)
file coverage_tw1.dta saved

. 
. 
. 
. import excel "E:\users\amy.mason\Pipeline_27_07_2016\Inputs\Typewriter_thresholds_10Feb15.xlsx", sheet("target list 2") firstrow
>  clear

. 
. 
. 
. rename s twentythree_s
s ambiguous abbreviation
r(111);

. 
. * picks up extra blank line from excel  - drop

. 
. gen method="typewriter coverage"

. 
. rename BLASTDB sample

. 
. drop if sample ==""
(0 observations deleted)

. 
. *reshape to one line per site/sample

. 
. renpfix "" value

. 
. rename valuesample sample

. 
. rename valuemethod method

. 
. reshape long value, i(sample method) j(site) string
(note: j = acrB acrC acrD arcA ccrA_1 ccrA_2 ccrA_3 ccrA_4 ccrB_1 ccrB_2 ccrB_3 ccrB_4 ccrB_6 ccrC_a ccrC_b ccrC_c chp eta etb etd
>  lukM lukMF lukPVF lukPVS qac_A qac_B qac_Csmr sak sasX scn sea_1 sea_2 seb sec sed see seg seh_1 seh_2 sei sej selR sep seu_1 s
> eu_2 tsst1)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                     1390   ->   63940
Number of variables                  48   ->       4
j variable (46 values)                    ->   site
xij variables:
     valueacrB valueacrC ... valuetsst1   ->   value
-----------------------------------------------------------------------------

. 
. 
. 
. append using coverage_tw1.dta, force
(note: variable site was str8, now str13 to accommodate using data's values)

. 
. save coverage_tw, replace
file coverage_tw.dta saved

. noi di "typewriter coverage"
typewriter coverage

. 
. 
. 
. import excel "E:\users\amy.mason\Pipeline_27_07_2016\Inputs\Typewriter_thresholds_10Feb15.xlsx", sheet("target list 1") firstrow
>  clear

. 
. rename s twentythree_s

. 
. gen method="typewriter coverage"

. 
. rename BLASTDB sample

. 
. drop if sample ==""
(0 observations deleted)

. 
. *reshape to one line per site/sample

. 
. renpfix "" value

. 
. rename valuesample sample

. 
. rename valuemethod method

. 
. reshape long value, i(sample method) j(site) string
(note: j = IsaB aac6aph2 aadDaph4Ia aadEant6Ia ant9_Iaspc ant9_Ibspc aph2Ic aphA3aph3III blaZ cat cfr dfrB_1 dfrB_2 dfr_A dfr_C df
> r_D dfr_G dfr_K ermA_1 ermA_2 ermB ermC ermT ermY fusA_1 fusA_2 fusA_3 fus_B fus_C grlA_1 grlA_2 grlA_3 gyrA_1 gyrA_2 gyrA_3 gyr
> A_4 ileS_1 ileS_2 ileS_3 lnu_A lnu_B mecA mecC mphC msrA mupA mupB rpoB_1 rpoB_2 sat4 str tetK tetL tetM tetO twentythree_s van_
> A van_B van_C vgaA vgaB vgbA)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                     1390   ->   86180
Number of variables                  64   ->       4
j variable (62 values)                    ->   site
xij variables:
  valueIsaB valueaac6aph2 ... valuevgbA   ->   value
-----------------------------------------------------------------------------

. 
. save coverage_tw1, replace
file coverage_tw1.dta saved

. 
. 
. 
. import excel "E:\users\amy.mason\Pipeline_27_07_2016\Inputs\Typewriter_thresholds_10Feb15.xlsx", sheet("target list 2") firstrow
>  clear

. 
. 
. 
. gen method="typewriter coverage"

. 
. rename BLASTDB sample

. 
. drop if sample ==""
(0 observations deleted)

. 
. *reshape to one line per site/sample

. 
. renpfix "" value

. 
. rename valuesample sample

. 
. rename valuemethod method

. 
. reshape long value, i(sample method) j(site) string
(note: j = acrB acrC acrD arcA ccrA_1 ccrA_2 ccrA_3 ccrA_4 ccrB_1 ccrB_2 ccrB_3 ccrB_4 ccrB_6 ccrC_a ccrC_b ccrC_c chp eta etb etd
>  lukM lukMF lukPVF lukPVS qac_A qac_B qac_Csmr sak sasX scn sea_1 sea_2 seb sec sed see seg seh_1 seh_2 sei sej selR sep seu_1 s
> eu_2 tsst1)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                     1390   ->   63940
Number of variables                  48   ->       4
j variable (46 values)                    ->   site
xij variables:
     valueacrB valueacrC ... valuetsst1   ->   value
-----------------------------------------------------------------------------

. 
. 
. 
. append using coverage_tw1.dta, force
(note: variable site was str8, now str13 to accommodate using data's values)

. 
. save coverage_tw, replace
file coverage_tw.dta saved

. 
. use pipeline_clean_all_values_wide, clear

. 
. 
. 
. **************************

. 
. noi di  "Recall order is  Mykrobe Mykrobe Genefinder"
Recall order is  Mykrobe Mykrobe Genefinder

. 
. 
. 
. gen agree  = (ValueA=="AAA"| ValueA=="PPP" )

. 
. drop if agree==1
(115,209 observations deleted)

. 
. noi di "disagreements: sites"
disagreements: sites

. 
. noi tab site, sort

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
           seu |         59        9.41        9.41
           chp |         47        7.50       16.91
          qacb |         46        7.34       24.24
         ccrcb |         44        7.02       31.26
           sei |         42        6.70       37.96
          dfrc |         37        5.90       43.86
          ccrb |         33        5.26       49.12
    aadeant6ia |         30        4.78       53.91
          blaz |         27        4.31       58.21
           seg |         26        4.15       62.36
         ccrcc |         23        3.67       66.03
         ccrca |         18        2.87       68.90
           scn |         18        2.87       71.77
          sasx |         15        2.39       74.16
          ermc |         12        1.91       76.08
       qaccsmr |         10        1.59       77.67
           sak |          8        1.28       78.95
          tetk |          8        1.28       80.22
        ant9ia |          7        1.12       81.34
          arcb |          6        0.96       82.30
          arcc |          6        0.96       83.25
          arcd |          6        0.96       84.21
          erma |          6        0.96       85.17
          lnua |          6        0.96       86.12
         lukmf |          6        0.96       87.08
          ccra |          5        0.80       87.88
           sec |          5        0.80       88.68
         tsst1 |          5        0.80       89.47
          dfra |          4        0.64       90.11
        lukpvs |          4        0.64       90.75
           sea |          4        0.64       91.39
           seh |          4        0.64       92.03
      aac6aph2 |          3        0.48       92.50
          fusc |          3        0.48       92.98
     grla/gyra |          3        0.48       93.46
          meca |          3        0.48       93.94
          sat4 |          3        0.48       94.42
           seb |          3        0.48       94.90
           sep |          3        0.48       95.37
    aaddaph4ia |          2        0.32       95.69
           etb |          2        0.32       96.01
           etd |          2        0.32       96.33
          fusa |          2        0.32       96.65
          fusb |          2        0.32       96.97
        lukpvf |          2        0.32       97.29
          mupa |          2        0.32       97.61
          qaca |          2        0.32       97.93
          rpob |          2        0.32       98.25
          tetm |          2        0.32       98.56
  apha3aph3iii |          1        0.16       98.72
          arca |          1        0.16       98.88
           cfr |          1        0.16       99.04
          dfrb |          1        0.16       99.20
          dfrg |          1        0.16       99.36
          ermb |          1        0.16       99.52
           eta |          1        0.16       99.68
          mphc |          1        0.16       99.84
          msra |          1        0.16      100.00
---------------+-----------------------------------
         Total |        627      100.00

. 
. noi di "disagreements: samples"
disagreements: samples

. 
. noi tab sample, sort

           Sample_id |      Freq.     Percent        Cum.
---------------------+-----------------------------------
    RH11000301-155-1 |         21        3.35        3.35
 H094920323-271-A1-2 |         10        1.59        4.94
    H113640238-143-1 |          9        1.44        6.38
           C00003385 |          8        1.28        7.66
           C00003320 |          7        1.12        8.77
           C00003248 |          6        0.96        9.73
           C00003272 |          6        0.96       10.69
           C00003315 |          6        0.96       11.64
    H122880144-207-1 |          6        0.96       12.60
    H133580080-596-1 |          6        0.96       13.56
           C00003152 |          5        0.80       14.35
           C00003421 |          5        0.80       15.15
           C00003423 |          5        0.80       15.95
           C00003425 |          5        0.80       16.75
    H092520302-216-1 |          5        0.80       17.54
    H110740135-193-2 |          5        0.80       18.34
    H113560219-469-2 |          5        0.80       19.14
H114140657-280-B01-2 |          5        0.80       19.94
    H114160352-129-1 |          5        0.80       20.73
    H121120058-504-1 |          5        0.80       21.53
    H121320081-505-1 |          5        0.80       22.33
 H125000105-229-G0-2 |          5        0.80       23.13
    H125000105-833-2 |          5        0.80       23.92
    H133000236-626-1 |          5        0.80       24.72
    H133020301-629-1 |          5        0.80       25.52
    H133120386-618-1 |          5        0.80       26.32
    H133300151-657-1 |          5        0.80       27.11
    H133720214-574-1 |          5        0.80       27.91
    H133720215-575-1 |          5        0.80       28.71
    H133860126-577-1 |          5        0.80       29.51
    H133960276-571-1 |          5        0.80       30.30
           C00003134 |          4        0.64       30.94
           C00003207 |          4        0.64       31.58
           C00003317 |          4        0.64       32.22
           C00003340 |          4        0.64       32.85
           C00003377 |          4        0.64       33.49
           C00003382 |          4        0.64       34.13
           C00003393 |          4        0.64       34.77
           C00003406 |          4        0.64       35.41
H105040039-373-G12-2 |          4        0.64       36.04
    H114720434-145-1 |          4        0.64       36.68
           C00001086 |          3        0.48       37.16
           C00001446 |          3        0.48       37.64
           C00002656 |          3        0.48       38.12
           C00003140 |          3        0.48       38.60
           C00003229 |          3        0.48       39.07
           C00003301 |          3        0.48       39.55
           C00003318 |          3        0.48       40.03
           C00003321 |          3        0.48       40.51
           C00003337 |          3        0.48       40.99
           C00003341 |          3        0.48       41.47
           C00003347 |          3        0.48       41.95
           C00003411 |          3        0.48       42.42
           C00007064 |          3        0.48       42.90
           C00008638 |          3        0.48       43.38
           C00013217 |          3        0.48       43.86
    H104420250-444-2 |          3        0.48       44.34
    H110820268-195-2 |          3        0.48       44.82
 H120420116-223-A0-2 |          3        0.48       45.30
 H120600058-224-B0-2 |          3        0.48       45.77
    H121320099-507-1 |          3        0.48       46.25
    H121340220-509-1 |          3        0.48       46.73
H122900151-350-H09-2 |          3        0.48       47.21
    H123120336-557-1 |          3        0.48       47.69
H124420844-355-E10-2 |          3        0.48       48.17
    H132540570-419-2 |          3        0.48       48.64
    RH08000028-150-1 |          3        0.48       49.12
RH11000090-289-C02-2 |          3        0.48       49.60
           C00000785 |          2        0.32       49.92
           C00000786 |          2        0.32       50.24
           C00000790 |          2        0.32       50.56
           C00000800 |          2        0.32       50.88
           C00000815 |          2        0.32       51.20
           C00000817 |          2        0.32       51.52
           C00001091 |          2        0.32       51.83
           C00001265 |          2        0.32       52.15
           C00003122 |          2        0.32       52.47
           C00003130 |          2        0.32       52.79
           C00003137 |          2        0.32       53.11
           C00003165 |          2        0.32       53.43
           C00003306 |          2        0.32       53.75
           C00003307 |          2        0.32       54.07
           C00003314 |          2        0.32       54.39
           C00003333 |          2        0.32       54.70
           C00003339 |          2        0.32       55.02
           C00003389 |          2        0.32       55.34
           C00003395 |          2        0.32       55.66
           C00003396 |          2        0.32       55.98
           C00003397 |          2        0.32       56.30
           C00003415 |          2        0.32       56.62
           C00003419 |          2        0.32       56.94
           C00003422 |          2        0.32       57.26
           C00012749 |          2        0.32       57.58
           C00013230 |          2        0.32       57.89
 H101120403-273-C1-2 |          2        0.32       58.21
    H104080090-443-2 |          2        0.32       58.53
    H104600048-190-2 |          2        0.32       58.85
    H105020486-191-2 |          2        0.32       59.17
H105260391-374-H12-2 |          2        0.32       59.49
    H110520238-116-2 |          2        0.32       59.81
    H111640001-197-2 |          2        0.32       60.13
    H113640215-127-2 |          2        0.32       60.45
 H114080202-255-A1-2 |          2        0.32       60.77
    H114120077-144-1 |          2        0.32       61.08
H114680370-339-E08-2 |          2        0.32       61.40
    H120440759-384-2 |          2        0.32       61.72
 H120840083-225-C0-2 |          2        0.32       62.04
    H121000455-532-1 |          2        0.32       62.36
    H121300130-139-1 |          2        0.32       62.68
    H121320082-506-1 |          2        0.32       63.00
H122560310-348-F09-2 |          2        0.32       63.32
    H123100271-555-1 |          2        0.32       63.64
    H123120337-556-1 |          2        0.32       63.96
H123700164-353-C10-2 |          2        0.32       64.27
    H124860349-210-1 |          2        0.32       64.59
    H124940430-401-1 |          2        0.32       64.91
H130240275-357-G10-2 |          2        0.32       65.23
    H132620132-420-2 |          2        0.32       65.55
    H133180046-621-1 |          2        0.32       65.87
    H133180047-622-1 |          2        0.32       66.19
    H133520197-646-1 |          2        0.32       66.51
    H133760113-576-1 |          2        0.32       66.83
    H133920237-578-1 |          2        0.32       67.15
    RH10000448-161-1 |          2        0.32       67.46
 RH11000042-258-D1-2 |          2        0.32       67.78
RH11000044-286-H01-2 |          2        0.32       68.10
RH11000072-288-B02-2 |          2        0.32       68.42
 RH12000505-239-A0-2 |          2        0.32       68.74
    RH12000540-156-1 |          2        0.32       69.06
           C00000784 |          1        0.16       69.22
           C00000787 |          1        0.16       69.38
           C00000788 |          1        0.16       69.54
           C00000789 |          1        0.16       69.70
           C00000799 |          1        0.16       69.86
           C00000806 |          1        0.16       70.02
           C00000808 |          1        0.16       70.18
           C00000809 |          1        0.16       70.33
           C00000816 |          1        0.16       70.49
           C00000818 |          1        0.16       70.65
           C00000820 |          1        0.16       70.81
           C00000828 |          1        0.16       70.97
           C00000829 |          1        0.16       71.13
           C00000831 |          1        0.16       71.29
           C00000857 |          1        0.16       71.45
           C00001079 |          1        0.16       71.61
           C00001080 |          1        0.16       71.77
           C00001100 |          1        0.16       71.93
           C00001102 |          1        0.16       72.09
           C00001226 |          1        0.16       72.25
           C00001240 |          1        0.16       72.41
           C00001387 |          1        0.16       72.57
           C00002620 |          1        0.16       72.73
           C00003084 |          1        0.16       72.89
           C00003092 |          1        0.16       73.05
           C00003093 |          1        0.16       73.21
           C00003111 |          1        0.16       73.37
           C00003115 |          1        0.16       73.52
           C00003121 |          1        0.16       73.68
           C00003125 |          1        0.16       73.84
           C00003144 |          1        0.16       74.00
           C00003155 |          1        0.16       74.16
           C00003158 |          1        0.16       74.32
           C00003164 |          1        0.16       74.48
           C00003176 |          1        0.16       74.64
           C00003195 |          1        0.16       74.80
           C00003221 |          1        0.16       74.96
           C00003223 |          1        0.16       75.12
           C00003224 |          1        0.16       75.28
           C00003240 |          1        0.16       75.44
           C00003242 |          1        0.16       75.60
           C00003249 |          1        0.16       75.76
           C00003250 |          1        0.16       75.92
           C00003252 |          1        0.16       76.08
           C00003253 |          1        0.16       76.24
           C00003254 |          1        0.16       76.40
           C00003259 |          1        0.16       76.56
           C00003260 |          1        0.16       76.71
           C00003270 |          1        0.16       76.87
           C00003277 |          1        0.16       77.03
           C00003278 |          1        0.16       77.19
           C00003290 |          1        0.16       77.35
           C00003292 |          1        0.16       77.51
           C00003302 |          1        0.16       77.67
           C00003303 |          1        0.16       77.83
           C00003319 |          1        0.16       77.99
           C00003332 |          1        0.16       78.15
           C00003348 |          1        0.16       78.31
           C00003351 |          1        0.16       78.47
           C00003352 |          1        0.16       78.63
           C00003354 |          1        0.16       78.79
           C00003355 |          1        0.16       78.95
           C00003362 |          1        0.16       79.11
           C00003379 |          1        0.16       79.27
           C00003381 |          1        0.16       79.43
           C00003410 |          1        0.16       79.59
           C00003414 |          1        0.16       79.74
           C00007083 |          1        0.16       79.90
           C00007096 |          1        0.16       80.06
           C00008625 |          1        0.16       80.22
           C00008949 |          1        0.16       80.38
           C00008960 |          1        0.16       80.54
           C00012738 |          1        0.16       80.70
           C00012775 |          1        0.16       80.86
           C00012776 |          1        0.16       81.02
           C00012780 |          1        0.16       81.18
           C00012784 |          1        0.16       81.34
           C00013162 |          1        0.16       81.50
           C00013165 |          1        0.16       81.66
           C00013195 |          1        0.16       81.82
           C00013213 |          1        0.16       81.98
           C00013221 |          1        0.16       82.14
           C00013224 |          1        0.16       82.30
           C00013231 |          1        0.16       82.46
           C00013235 |          1        0.16       82.62
           C00013241 |          1        0.16       82.78
           C00013248 |          1        0.16       82.93
           C00013318 |          1        0.16       83.09
           C00013326 |          1        0.16       83.25
           C00013335 |          1        0.16       83.41
           C00013362 |          1        0.16       83.57
           C00013364 |          1        0.16       83.73
           C00013367 |          1        0.16       83.89
           C00013393 |          1        0.16       84.05
           C00013401 |          1        0.16       84.21
           C00013406 |          1        0.16       84.37
    H034660053-158-1 |          1        0.16       84.53
H065060092-367-A12-2 |          1        0.16       84.69
 H065120079-263-A1-2 |          1        0.16       84.85
 H074780626-266-D1-2 |          1        0.16       85.01
    H080980484-164-1 |          1        0.16       85.17
 H082600495-244-F0-2 |          1        0.16       85.33
 H091100226-245-G0-2 |          1        0.16       85.49
 H093620523-269-G1-2 |          1        0.16       85.65
    H100140197-167-2 |          1        0.16       85.81
    H100200151-169-2 |          1        0.16       85.96
    H100800158-172-2 |          1        0.16       86.12
    H101020134-173-2 |          1        0.16       86.28
    H101520278-175-2 |          1        0.16       86.44
    H101580214-176-2 |          1        0.16       86.60
 H101740329-274-D1-2 |          1        0.16       86.76
 H101740629-240-B0-2 |          1        0.16       86.92
 H102820334-277-G1-2 |          1        0.16       87.08
 H102840444-246-H0-2 |          1        0.16       87.24
    H103060332-756-2 |          1        0.16       87.40
    H103220288-184-2 |          1        0.16       87.56
 H103360314-241-C0-2 |          1        0.16       87.72
    H103440108-442-2 |          1        0.16       87.88
H103560109-371-E12-2 |          1        0.16       88.04
 H104340410-220-F0-2 |          1        0.16       88.20
    H104420050-188-2 |          1        0.16       88.36
 H105020135-247-A0-2 |          1        0.16       88.52
 H105140339-248-B0-2 |          1        0.16       88.68
    H111600186-455-2 |          1        0.16       88.84
    H111740190-456-2 |          1        0.16       89.00
    H111940137-460-2 |          1        0.16       89.15
H111960080-332-F07-2 |          1        0.16       89.31
    H112060137-461-2 |          1        0.16       89.47
    H112540036-142-1 |          1        0.16       89.63
    H112660153-200-1 |          1        0.16       89.79
    H113020155-466-2 |          1        0.16       89.95
    H113140144-468-2 |          1        0.16       90.11
H113420072-336-B08-2 |          1        0.16       90.27
    H113880160-476-1 |          1        0.16       90.43
    H113920345-478-1 |          1        0.16       90.59
    H114340058-470-2 |          1        0.16       90.75
    H114700366-481-1 |          1        0.16       90.91
    H114720432-482-1 |          1        0.16       91.07
    H120220271-381-2 |          1        0.16       91.23
    H120680309-385-2 |          1        0.16       91.39
H120860096-346-D09-2 |          1        0.16       91.55
    H121060252-533-1 |          1        0.16       91.71
    H121100042-534-1 |          1        0.16       91.87
    H121120051-535-1 |          1        0.16       92.03
    H121800040-510-1 |          1        0.16       92.19
    H122660093-513-1 |          1        0.16       92.34
    H122840129-206-1 |          1        0.16       92.50
    H122960028-515-1 |          1        0.16       92.66
    H122960030-517-1 |          1        0.16       92.82
    H123020176-551-1 |          1        0.16       92.98
    H123020177-552-1 |          1        0.16       93.14
    H123020178-553-1 |          1        0.16       93.30
    H123100270-554-1 |          1        0.16       93.46
    H123120338-558-1 |          1        0.16       93.62
    H123220266-561-1 |          1        0.16       93.78
    H124060094-134-1 |          1        0.16       93.94
 H124420845-227-E0-2 |          1        0.16       94.10
    H124720623-209-1 |          1        0.16       94.26
H125280642-356-F10-2 |          1        0.16       94.42
    H125280642-841-2 |          1        0.16       94.58
    H130660215-405-2 |          1        0.16       94.74
    H131660094-412-2 |          1        0.16       94.90
    H131800554-414-2 |          1        0.16       95.06
    H131800573-415-2 |          1        0.16       95.22
    H132280003-416-2 |          1        0.16       95.37
    H132920375-623-1 |          1        0.16       95.53
    H133060079-613-1 |          1        0.16       95.69
    H133100176-615-1 |          1        0.16       95.85
    H133200270-608-1 |          1        0.16       96.01
    H133240054-609-1 |          1        0.16       96.17
    H133560609-593-1 |          1        0.16       96.33
    H133580086-601-1 |          1        0.16       96.49
    H133580087-582-1 |          1        0.16       96.65
    H133900439-581-1 |          1        0.16       96.81
    H133960268-568-1 |          1        0.16       96.97
    H133960269-569-1 |          1        0.16       97.13
 RH07000425-233-C0-2 |          1        0.16       97.29
 RH10000375-235-E0-2 |          1        0.16       97.45
 RH10000389-236-F0-2 |          1        0.16       97.61
RH11000029-284-F01-2 |          1        0.16       97.77
RH11000133-292-F02-2 |          1        0.16       97.93
RH11000142-293-G02-2 |          1        0.16       98.09
RH11000146-294-H02-2 |          1        0.16       98.25
RH12000046-298-D03-2 |          1        0.16       98.41
RH12000340-301-G03-2 |          1        0.16       98.56
RH12000346-307-E04-2 |          1        0.16       98.72
    RH12000366-426-2 |          1        0.16       98.88
    RH12000370-430-2 |          1        0.16       99.04
    RH12000374-434-2 |          1        0.16       99.20
    RH12000375-435-2 |          1        0.16       99.36
    RH12000376-436-2 |          1        0.16       99.52
    RH12000379-439-2 |          1        0.16       99.68
    RH12000381-441-2 |          1        0.16       99.84
 RH12000503-261-G1-2 |          1        0.16      100.00
---------------------+-----------------------------------
               Total |        627      100.00

. 
. noi di "disagreements: set"
disagreements: set

. 
. noi tab set, sort

        set |      Freq.     Percent        Cum.
------------+-----------------------------------
 Collindale |        349       55.66       55.66
  Oxford501 |        233       37.16       92.82
  Oxford491 |         45        7.18      100.00
------------+-----------------------------------
      Total |        627      100.00

. 
. noi tab site set

               |               set
          site | Collind..  Oxford491  Oxford501 |     Total
---------------+---------------------------------+----------
      aac6aph2 |         3          0          0 |         3 
    aaddaph4ia |         0          0          2 |         2 
    aadeant6ia |        25          1          4 |        30 
        ant9ia |         4          0          3 |         7 
  apha3aph3iii |         0          0          1 |         1 
          arca |         1          0          0 |         1 
          arcb |         3          1          2 |         6 
          arcc |         3          1          2 |         6 
          arcd |         3          1          2 |         6 
          blaz |        19          4          4 |        27 
          ccra |         3          0          2 |         5 
          ccrb |         4          7         22 |        33 
         ccrca |        16          1          1 |        18 
         ccrcb |        39          2          3 |        44 
         ccrcc |        21          0          2 |        23 
           cfr |         1          0          0 |         1 
           chp |         3          4         40 |        47 
          dfra |         4          0          0 |         4 
          dfrb |         0          1          0 |         1 
          dfrc |        37          0          0 |        37 
          dfrg |         1          0          0 |         1 
          erma |         3          0          3 |         6 
          ermb |         0          0          1 |         1 
          ermc |         2          4          6 |        12 
           eta |         1          0          0 |         1 
           etb |         1          1          0 |         2 
           etd |         1          0          1 |         2 
          fusa |         0          0          2 |         2 
          fusb |         1          0          1 |         2 
          fusc |         1          0          2 |         3 
     grla/gyra |         2          0          1 |         3 
          lnua |         6          0          0 |         6 
         lukmf |         6          0          0 |         6 
        lukpvf |         2          0          0 |         2 
        lukpvs |         3          0          1 |         4 
          meca |         3          0          0 |         3 
          mphc |         1          0          0 |         1 
          msra |         0          0          1 |         1 
          mupa |         2          0          0 |         2 
          qaca |         2          0          0 |         2 
          qacb |        38          8          0 |        46 
       qaccsmr |         2          2          6 |        10 
          rpob |         1          0          1 |         2 
           sak |         4          0          4 |         8 
          sasx |        15          0          0 |        15 
          sat4 |         1          0          2 |         3 
           scn |         3          0         15 |        18 
           sea |         2          0          2 |         4 
           seb |         1          1          1 |         3 
           sec |         2          0          3 |         5 
           seg |         2          2         22 |        26 
           seh |         2          0          2 |         4 
           sei |        14          1         27 |        42 
           sep |         0          1          2 |         3 
           seu |        28          2         29 |        59 
          tetk |         5          0          3 |         8 
          tetm |         0          0          2 |         2 
         tsst1 |         2          0          3 |         5 
---------------+---------------------------------+----------
         Total |       349         45        233 |       627 


. 
. 
. 
. 
. 
. **********************************

. 
. * hypothesis: this is due to borderline coverage

. 
. 
. 
. merge 1:1 sample site using coverage_tw, update
(note: variable sample was str20, now str81 to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                       150,487
        from master                       497  (_merge==1)
        from using                    149,990  (_merge==2)

    matched                               130
        not updated                       130  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. tab site _merge

               |              _merge
          site | master on  using onl  matched ( |     Total
---------------+---------------------------------+----------
          IsaB |         0      1,390          0 |     1,390 
      aac6aph2 |         3      1,390          0 |     1,393 
    aadDaph4Ia |         0      1,390          0 |     1,390 
    aadEant6Ia |         0      1,390          0 |     1,390 
    aaddaph4ia |         2          0          0 |         2 
    aadeant6ia |        30          0          0 |        30 
          acrB |         0      1,390          0 |     1,390 
          acrC |         0      1,390          0 |     1,390 
          acrD |         0      1,390          0 |     1,390 
    ant9_Iaspc |         0      1,390          0 |     1,390 
    ant9_Ibspc |         0      1,390          0 |     1,390 
        ant9ia |         7          0          0 |         7 
        aph2Ic |         0      1,390          0 |     1,390 
  aphA3aph3III |         0      1,390          0 |     1,390 
  apha3aph3iii |         1          0          0 |         1 
          arcA |         0      1,390          0 |     1,390 
          arca |         1          0          0 |         1 
          arcb |         6          0          0 |         6 
          arcc |         6          0          0 |         6 
          arcd |         6          0          0 |         6 
          blaZ |         0      1,390          0 |     1,390 
          blaz |        27          0          0 |        27 
           cat |         0      1,390          0 |     1,390 
        ccrA_1 |         0      1,390          0 |     1,390 
        ccrA_2 |         0      1,390          0 |     1,390 
        ccrA_3 |         0      1,390          0 |     1,390 
        ccrA_4 |         0      1,390          0 |     1,390 
        ccrB_1 |         0      1,390          0 |     1,390 
        ccrB_2 |         0      1,390          0 |     1,390 
        ccrB_3 |         0      1,390          0 |     1,390 
        ccrB_4 |         0      1,390          0 |     1,390 
        ccrB_6 |         0      1,390          0 |     1,390 
        ccrC_a |         0      1,390          0 |     1,390 
        ccrC_b |         0      1,390          0 |     1,390 
        ccrC_c |         0      1,390          0 |     1,390 
          ccra |         5          0          0 |         5 
          ccrb |        33          0          0 |        33 
         ccrca |        18          0          0 |        18 
         ccrcb |        44          0          0 |        44 
         ccrcc |        23          0          0 |        23 
           cfr |         1      1,390          0 |     1,391 
           chp |         3      1,346         44 |     1,393 
        dfrB_1 |         0      1,390          0 |     1,390 
        dfrB_2 |         0      1,390          0 |     1,390 
         dfr_A |         0      1,390          0 |     1,390 
         dfr_C |         0      1,390          0 |     1,390 
         dfr_D |         0      1,390          0 |     1,390 
         dfr_G |         0      1,390          0 |     1,390 
         dfr_K |         0      1,390          0 |     1,390 
          dfra |         4          0          0 |         4 
          dfrb |         1          0          0 |         1 
          dfrc |        37          0          0 |        37 
          dfrg |         1          0          0 |         1 
        ermA_1 |         0      1,390          0 |     1,390 
        ermA_2 |         0      1,390          0 |     1,390 
          ermB |         0      1,390          0 |     1,390 
          ermC |         0      1,390          0 |     1,390 
          ermT |         0      1,390          0 |     1,390 
          ermY |         0      1,390          0 |     1,390 
          erma |         6          0          0 |         6 
          ermb |         1          0          0 |         1 
          ermc |        12          0          0 |        12 
           eta |         1      1,390          0 |     1,391 
           etb |         1      1,389          1 |     1,391 
           etd |         1      1,389          1 |     1,391 
        fusA_1 |         0      1,390          0 |     1,390 
        fusA_2 |         0      1,390          0 |     1,390 
        fusA_3 |         0      1,390          0 |     1,390 
         fus_B |         0      1,390          0 |     1,390 
         fus_C |         0      1,390          0 |     1,390 
          fusa |         2          0          0 |         2 
          fusb |         2          0          0 |         2 
          fusc |         3          0          0 |         3 
        grlA_1 |         0      1,390          0 |     1,390 
        grlA_2 |         0      1,390          0 |     1,390 
        grlA_3 |         0      1,390          0 |     1,390 
     grla/gyra |         3          0          0 |         3 
        gyrA_1 |         0      1,390          0 |     1,390 
        gyrA_2 |         0      1,390          0 |     1,390 
        gyrA_3 |         0      1,390          0 |     1,390 
        gyrA_4 |         0      1,390          0 |     1,390 
        ileS_1 |         0      1,390          0 |     1,390 
        ileS_2 |         0      1,390          0 |     1,390 
        ileS_3 |         0      1,390          0 |     1,390 
         lnu_A |         0      1,390          0 |     1,390 
         lnu_B |         0      1,390          0 |     1,390 
          lnua |         6          0          0 |         6 
          lukM |         0      1,390          0 |     1,390 
         lukMF |         0      1,390          0 |     1,390 
        lukPVF |         0      1,390          0 |     1,390 
        lukPVS |         0      1,390          0 |     1,390 
         lukmf |         6          0          0 |         6 
        lukpvf |         2          0          0 |         2 
        lukpvs |         4          0          0 |         4 
          mecA |         0      1,390          0 |     1,390 
          mecC |         0      1,390          0 |     1,390 
          meca |         3          0          0 |         3 
          mphC |         0      1,390          0 |     1,390 
          mphc |         1          0          0 |         1 
          msrA |         0      1,390          0 |     1,390 
          msra |         1          0          0 |         1 
          mupA |         0      1,390          0 |     1,390 
          mupB |         0      1,390          0 |     1,390 
          mupa |         2          0          0 |         2 
         qac_A |         0      1,390          0 |     1,390 
         qac_B |         0      1,390          0 |     1,390 
      qac_Csmr |         0      1,390          0 |     1,390 
          qaca |         2          0          0 |         2 
          qacb |        46          0          0 |        46 
       qaccsmr |        10          0          0 |        10 
        rpoB_1 |         0      1,390          0 |     1,390 
        rpoB_2 |         0      1,390          0 |     1,390 
          rpob |         2          0          0 |         2 
           sak |         4      1,386          4 |     1,394 
          sasX |         0      1,390          0 |     1,390 
          sasx |        15          0          0 |        15 
          sat4 |         1      1,388          2 |     1,391 
           scn |         3      1,375         15 |     1,393 
           sea |         4          0          0 |         4 
         sea_1 |         0      1,390          0 |     1,390 
         sea_2 |         0      1,390          0 |     1,390 
           seb |         1      1,388          2 |     1,391 
           sec |         2      1,387          3 |     1,392 
           sed |         0      1,390          0 |     1,390 
           see |         0      1,390          0 |     1,390 
           seg |         2      1,366         24 |     1,392 
           seh |         4          0          0 |         4 
         seh_1 |         0      1,390          0 |     1,390 
         seh_2 |         0      1,390          0 |     1,390 
           sei |        14      1,362         28 |     1,404 
           sej |         0      1,390          0 |     1,390 
          selR |         0      1,390          0 |     1,390 
           sep |         0      1,387          3 |     1,390 
           seu |        59          0          0 |        59 
         seu_1 |         0      1,390          0 |     1,390 
         seu_2 |         0      1,390          0 |     1,390 
           str |         0      1,390          0 |     1,390 
          tetK |         0      1,390          0 |     1,390 
          tetL |         0      1,390          0 |     1,390 
          tetM |         0      1,390          0 |     1,390 
          tetO |         0      1,390          0 |     1,390 
          tetk |         8          0          0 |         8 
          tetm |         2          0          0 |         2 
         tsst1 |         2      1,387          3 |     1,392 
 twentythree_s |         0      1,390          0 |     1,390 
         van_A |         0      1,390          0 |     1,390 
         van_B |         0      1,390          0 |     1,390 
         van_C |         0      1,390          0 |     1,390 
          vgaA |         0      1,390          0 |     1,390 
          vgaB |         0      1,390          0 |     1,390 
          vgbA |         0      1,390          0 |     1,390 
---------------+---------------------------------+----------
         Total |       497    149,990        130 |   150,617 


. 
. use coverage_tw, clear

. 
. * need to clean site name values 

. 
. **** match up things I think are the same but with slightly different names

. 
. replace site = "ant9ib" if site=="ant9_ibspc"
(0 real changes made)

. 
. replace site = "ant9ia" if site=="ant9_iaspc"
(0 real changes made)

. 
. replace site= "aac6aph2" if strpos(site, "aac")
(0 real changes made)

. 
. 
. 
. replace site = subinstr(site, "acr", "arc",.) if strpos(site, "acr")
(4,170 real changes made)

. 
. replace site = "mlst" if site=="st"
(0 real changes made)

. 
. replace site = "ccrca"  if site == "ccrc_a"
(0 real changes made)

. 
. replace site = "ccrcb"  if site == "ccrc_b"
(0 real changes made)

. 
. replace site = "ccrcc"  if site == "ccrc_c"
(0 real changes made)

. 
. replace site =  subinstr(site, "_", "",.) if strpos(site, "dfr")
(9,730 real changes made)

. 
. replace site =  subinstr(site, "_", "",.) if strpos(site, "fus")
(6,950 real changes made)

. 
. replace site =  subinstr(site, "_", "",.) if strpos(site, "ile")
(4,170 real changes made)

. 
. replace site =  subinstr(site, "_", "",.) if strpos(site, "lnu")
(2,780 real changes made)

. 
. replace site =  subinstr(site, "_", "",.) if strpos(site, "qac")
(4,170 real changes made)

. 
. replace site =  subinstr(site, "_", "",.) if strpos(site, "van")
(4,170 real changes made)

. tab site

         site |      Freq.     Percent        Cum.
--------------+-----------------------------------
         IsaB |      1,390        0.93        0.93
     aac6aph2 |      1,390        0.93        1.85
   aadDaph4Ia |      1,390        0.93        2.78
   aadEant6Ia |      1,390        0.93        3.70
   ant9_Iaspc |      1,390        0.93        4.63
   ant9_Ibspc |      1,390        0.93        5.56
       aph2Ic |      1,390        0.93        6.48
 aphA3aph3III |      1,390        0.93        7.41
         arcA |      1,390        0.93        8.33
         arcB |      1,390        0.93        9.26
         arcC |      1,390        0.93       10.19
         arcD |      1,390        0.93       11.11
         blaZ |      1,390        0.93       12.04
          cat |      1,390        0.93       12.96
       ccrA_1 |      1,390        0.93       13.89
       ccrA_2 |      1,390        0.93       14.81
       ccrA_3 |      1,390        0.93       15.74
       ccrA_4 |      1,390        0.93       16.67
       ccrB_1 |      1,390        0.93       17.59
       ccrB_2 |      1,390        0.93       18.52
       ccrB_3 |      1,390        0.93       19.44
       ccrB_4 |      1,390        0.93       20.37
       ccrB_6 |      1,390        0.93       21.30
       ccrC_a |      1,390        0.93       22.22
       ccrC_b |      1,390        0.93       23.15
       ccrC_c |      1,390        0.93       24.07
          cfr |      1,390        0.93       25.00
          chp |      1,390        0.93       25.93
         dfrA |      1,390        0.93       26.85
        dfrB1 |      1,390        0.93       27.78
        dfrB2 |      1,390        0.93       28.70
         dfrC |      1,390        0.93       29.63
         dfrD |      1,390        0.93       30.56
         dfrG |      1,390        0.93       31.48
         dfrK |      1,390        0.93       32.41
       ermA_1 |      1,390        0.93       33.33
       ermA_2 |      1,390        0.93       34.26
         ermB |      1,390        0.93       35.19
         ermC |      1,390        0.93       36.11
         ermT |      1,390        0.93       37.04
         ermY |      1,390        0.93       37.96
          eta |      1,390        0.93       38.89
          etb |      1,390        0.93       39.81
          etd |      1,390        0.93       40.74
        fusA1 |      1,390        0.93       41.67
        fusA2 |      1,390        0.93       42.59
        fusA3 |      1,390        0.93       43.52
         fusB |      1,390        0.93       44.44
         fusC |      1,390        0.93       45.37
       grlA_1 |      1,390        0.93       46.30
       grlA_2 |      1,390        0.93       47.22
       grlA_3 |      1,390        0.93       48.15
       gyrA_1 |      1,390        0.93       49.07
       gyrA_2 |      1,390        0.93       50.00
       gyrA_3 |      1,390        0.93       50.93
       gyrA_4 |      1,390        0.93       51.85
        ileS1 |      1,390        0.93       52.78
        ileS2 |      1,390        0.93       53.70
        ileS3 |      1,390        0.93       54.63
         lnuA |      1,390        0.93       55.56
         lnuB |      1,390        0.93       56.48
         lukM |      1,390        0.93       57.41
        lukMF |      1,390        0.93       58.33
       lukPVF |      1,390        0.93       59.26
       lukPVS |      1,390        0.93       60.19
         mecA |      1,390        0.93       61.11
         mecC |      1,390        0.93       62.04
         mphC |      1,390        0.93       62.96
         msrA |      1,390        0.93       63.89
         mupA |      1,390        0.93       64.81
         mupB |      1,390        0.93       65.74
         qacA |      1,390        0.93       66.67
         qacB |      1,390        0.93       67.59
      qacCsmr |      1,390        0.93       68.52
       rpoB_1 |      1,390        0.93       69.44
       rpoB_2 |      1,390        0.93       70.37
          sak |      1,390        0.93       71.30
         sasX |      1,390        0.93       72.22
         sat4 |      1,390        0.93       73.15
          scn |      1,390        0.93       74.07
        sea_1 |      1,390        0.93       75.00
        sea_2 |      1,390        0.93       75.93
          seb |      1,390        0.93       76.85
          sec |      1,390        0.93       77.78
          sed |      1,390        0.93       78.70
          see |      1,390        0.93       79.63
          seg |      1,390        0.93       80.56
        seh_1 |      1,390        0.93       81.48
        seh_2 |      1,390        0.93       82.41
          sei |      1,390        0.93       83.33
          sej |      1,390        0.93       84.26
         selR |      1,390        0.93       85.19
          sep |      1,390        0.93       86.11
        seu_1 |      1,390        0.93       87.04
        seu_2 |      1,390        0.93       87.96
          str |      1,390        0.93       88.89
         tetK |      1,390        0.93       89.81
         tetL |      1,390        0.93       90.74
         tetM |      1,390        0.93       91.67
         tetO |      1,390        0.93       92.59
        tsst1 |      1,390        0.93       93.52
twentythree_s |      1,390        0.93       94.44
         vanA |      1,390        0.93       95.37
         vanB |      1,390        0.93       96.30
         vanC |      1,390        0.93       97.22
         vgaA |      1,390        0.93       98.15
         vgaB |      1,390        0.93       99.07
         vgbA |      1,390        0.93      100.00
--------------+-----------------------------------
        Total |    150,120      100.00

. 
. use coverage_tw, clear

. 
. * need to clean site name values 

. 
. **** match up things I think are the same but with slightly different names

. 
. replace site = "ant9ib" if site=="ant9_ibspc"
(0 real changes made)

. 
. replace site = "ant9ia" if site=="ant9_iaspc"
(0 real changes made)

. 
. replace site= "aac6aph2" if strpos(site, "aac")
(0 real changes made)

. 
. 
. 
. replace site = subinstr(site, "acr", "arc",.) if strpos(site, "acr")
(4,170 real changes made)

. 
. replace site = "mlst" if site=="st"
(0 real changes made)

. 
. replace site = "ccrca"  if site == "ccrc_a"
(0 real changes made)

. 
. replace site = "ccrcb"  if site == "ccrc_b"
(0 real changes made)

. 
. replace site = "ccrcc"  if site == "ccrc_c"
(0 real changes made)

. 
. 
. 
. 
. 
. **********************************************

. 
. * deal with site with multiple variants

. 
. save temp, replace
file temp.dta saved

. 
. 
. 
. noi di "combining numbered variants into single sites"
combining numbered variants into single sites

. 
. 
. 
. use temp, clear

. tab site

         site |      Freq.     Percent        Cum.
--------------+-----------------------------------
         IsaB |      1,390        0.93        0.93
     aac6aph2 |      1,390        0.93        1.85
   aadDaph4Ia |      1,390        0.93        2.78
   aadEant6Ia |      1,390        0.93        3.70
   ant9_Iaspc |      1,390        0.93        4.63
   ant9_Ibspc |      1,390        0.93        5.56
       aph2Ic |      1,390        0.93        6.48
 aphA3aph3III |      1,390        0.93        7.41
         arcA |      1,390        0.93        8.33
         arcB |      1,390        0.93        9.26
         arcC |      1,390        0.93       10.19
         arcD |      1,390        0.93       11.11
         blaZ |      1,390        0.93       12.04
          cat |      1,390        0.93       12.96
       ccrA_1 |      1,390        0.93       13.89
       ccrA_2 |      1,390        0.93       14.81
       ccrA_3 |      1,390        0.93       15.74
       ccrA_4 |      1,390        0.93       16.67
       ccrB_1 |      1,390        0.93       17.59
       ccrB_2 |      1,390        0.93       18.52
       ccrB_3 |      1,390        0.93       19.44
       ccrB_4 |      1,390        0.93       20.37
       ccrB_6 |      1,390        0.93       21.30
       ccrC_a |      1,390        0.93       22.22
       ccrC_b |      1,390        0.93       23.15
       ccrC_c |      1,390        0.93       24.07
          cfr |      1,390        0.93       25.00
          chp |      1,390        0.93       25.93
       dfrB_1 |      1,390        0.93       26.85
       dfrB_2 |      1,390        0.93       27.78
        dfr_A |      1,390        0.93       28.70
        dfr_C |      1,390        0.93       29.63
        dfr_D |      1,390        0.93       30.56
        dfr_G |      1,390        0.93       31.48
        dfr_K |      1,390        0.93       32.41
       ermA_1 |      1,390        0.93       33.33
       ermA_2 |      1,390        0.93       34.26
         ermB |      1,390        0.93       35.19
         ermC |      1,390        0.93       36.11
         ermT |      1,390        0.93       37.04
         ermY |      1,390        0.93       37.96
          eta |      1,390        0.93       38.89
          etb |      1,390        0.93       39.81
          etd |      1,390        0.93       40.74
       fusA_1 |      1,390        0.93       41.67
       fusA_2 |      1,390        0.93       42.59
       fusA_3 |      1,390        0.93       43.52
        fus_B |      1,390        0.93       44.44
        fus_C |      1,390        0.93       45.37
       grlA_1 |      1,390        0.93       46.30
       grlA_2 |      1,390        0.93       47.22
       grlA_3 |      1,390        0.93       48.15
       gyrA_1 |      1,390        0.93       49.07
       gyrA_2 |      1,390        0.93       50.00
       gyrA_3 |      1,390        0.93       50.93
       gyrA_4 |      1,390        0.93       51.85
       ileS_1 |      1,390        0.93       52.78
       ileS_2 |      1,390        0.93       53.70
       ileS_3 |      1,390        0.93       54.63
        lnu_A |      1,390        0.93       55.56
        lnu_B |      1,390        0.93       56.48
         lukM |      1,390        0.93       57.41
        lukMF |      1,390        0.93       58.33
       lukPVF |      1,390        0.93       59.26
       lukPVS |      1,390        0.93       60.19
         mecA |      1,390        0.93       61.11
         mecC |      1,390        0.93       62.04
         mphC |      1,390        0.93       62.96
         msrA |      1,390        0.93       63.89
         mupA |      1,390        0.93       64.81
         mupB |      1,390        0.93       65.74
        qac_A |      1,390        0.93       66.67
        qac_B |      1,390        0.93       67.59
     qac_Csmr |      1,390        0.93       68.52
       rpoB_1 |      1,390        0.93       69.44
       rpoB_2 |      1,390        0.93       70.37
          sak |      1,390        0.93       71.30
         sasX |      1,390        0.93       72.22
         sat4 |      1,390        0.93       73.15
          scn |      1,390        0.93       74.07
        sea_1 |      1,390        0.93       75.00
        sea_2 |      1,390        0.93       75.93
          seb |      1,390        0.93       76.85
          sec |      1,390        0.93       77.78
          sed |      1,390        0.93       78.70
          see |      1,390        0.93       79.63
          seg |      1,390        0.93       80.56
        seh_1 |      1,390        0.93       81.48
        seh_2 |      1,390        0.93       82.41
          sei |      1,390        0.93       83.33
          sej |      1,390        0.93       84.26
         selR |      1,390        0.93       85.19
          sep |      1,390        0.93       86.11
        seu_1 |      1,390        0.93       87.04
        seu_2 |      1,390        0.93       87.96
          str |      1,390        0.93       88.89
         tetK |      1,390        0.93       89.81
         tetL |      1,390        0.93       90.74
         tetM |      1,390        0.93       91.67
         tetO |      1,390        0.93       92.59
        tsst1 |      1,390        0.93       93.52
twentythree_s |      1,390        0.93       94.44
        van_A |      1,390        0.93       95.37
        van_B |      1,390        0.93       96.30
        van_C |      1,390        0.93       97.22
         vgaA |      1,390        0.93       98.15
         vgaB |      1,390        0.93       99.07
         vgbA |      1,390        0.93      100.00
--------------+-----------------------------------
        Total |    150,120      100.00

. keep if strpos(site, "1") | strpos(site, "2") | strpos(site, "3") | strpos(site, "4") | strpos(site, "6")
(93,130 observations deleted)

. rename site site_org

. 
. gen site = site_org

. 
. split site, parse(_)
variables created as string: 
site1  site2

. reshape wide value, i(sample method site1) j(site2)
variable site2 is string; specify string option
r(109);

. destring site2, replace
site2: all characters numeric; replaced as byte
(9730 missing values generated)

. rename site2 sitenum

. reshape wide value, i(sample method site1) j(sitenum)
variable sitenum contains missing values
r(498);

. 
. use temp, clear

. 
. keep if strpos(site, "1") | strpos(site, "2") | strpos(site, "3") | strpos(site, "4") | strpos(site, "6") 
(93,130 observations deleted)

. 
. drop if site=="tsst1"
(1,390 observations deleted)

. 
. split site, parse(_)
variables created as string: 
site1  site2

. 
. reshape wide value, i(sample method site1) j(site2)
variable site2 is string; specify string option
r(109);

. use temp, clear

. 
. keep if strpos(site, "1") | strpos(site, "2") | strpos(site, "3") | strpos(site, "4") | strpos(site, "6") 
(93,130 observations deleted)

. 
. drop if site=="tsst1"
(1,390 observations deleted)

. 
. split site, parse(_)
variables created as string: 
site1  site2

. 
. destring site2, replace
site2: all characters numeric; replaced as byte
(8340 missing values generated)

. 
. rename site2 sitenum

. 
. rename site1 site
variable site already defined
r(110);

. 
. reshape wide value, i(sample method site) j(sitenum)
variable sitenum contains missing values
r(498);

. use temp, clear

. 
. keep if strpos(site, "1") | strpos(site, "2") | strpos(site, "3") | strpos(site, "4") | strpos(site, "6") 
(93,130 observations deleted)

. 
. drop if site=="tsst1"
(1,390 observations deleted)

. 
. split site, parse(_)
variables created as string: 
site1  site2

. 
. drop site

. 
. destring site2, replace
site2: all characters numeric; replaced as byte
(8340 missing values generated)

. 
. rename site2 sitenum

. 
. rename site1 site

. 
. reshape wide value, i(sample method site) j(sitenum)
variable sitenum contains missing values
r(498);

. tab site if sitenum==.

        site |      Freq.     Percent        Cum.
-------------+-----------------------------------
    aac6aph2 |      1,390       16.67       16.67
  aadDaph4Ia |      1,390       16.67       33.33
  aadEant6Ia |      1,390       16.67       50.00
      aph2Ic |      1,390       16.67       66.67
aphA3aph3III |      1,390       16.67       83.33
        sat4 |      1,390       16.67      100.00
-------------+-----------------------------------
       Total |      8,340      100.00

. 
. use temp, clear

. 
. keep if strpos(site, "1") | strpos(site, "2") | strpos(site, "3") | strpos(site, "4") | strpos(site, "6") 
(93,130 observations deleted)

. 
. drop if site=="tsst1"
(1,390 observations deleted)

. 
. drop if !strpos(site, "_")
(8,340 observations deleted)

. 
. split site, parse(_)
variables created as string: 
site1  site2

. 
. drop site

. 
. destring site2, replace
site2: all characters numeric; replaced as byte

. 
. rename site2 sitenum

. 
. rename site1 site

. 
. reshape wide value, i(sample method site) j(sitenum)
(note: j = 1 2 3 4 6)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                    47260   ->   16680
Number of variables                   5   ->       8
j variable (5 values)           sitenum   ->   (dropped)
xij variables:
                                  value   ->   value1 value2 ... value6
-----------------------------------------------------------------------------

. merge 1:1 sample site using discrepancies, update
file discrepancies.dta not found
r(601);

. cd E:\users\amy.mason\Pipeline_27_07_2016\Datasets
E:\users\amy.mason\Pipeline_27_07_2016\Datasets

. 
. 
. 
. use pipeline_clean_all_values_wide, clear

. 
. 
. 
. **************************

. 
. noi di  "Recall order is  Mykrobe Mykrobe Genefinder"
Recall order is  Mykrobe Mykrobe Genefinder

. 
. 
. 
. gen agree  = (ValueA=="AAA"| ValueA=="PPP" )

. 
. drop if agree==1
(115,209 observations deleted)

. 
. noi di "disagreements: sites"
disagreements: sites

. 
. noi tab site, sort

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
           seu |         59        9.41        9.41
           chp |         47        7.50       16.91
          qacb |         46        7.34       24.24
         ccrcb |         44        7.02       31.26
           sei |         42        6.70       37.96
          dfrc |         37        5.90       43.86
          ccrb |         33        5.26       49.12
    aadeant6ia |         30        4.78       53.91
          blaz |         27        4.31       58.21
           seg |         26        4.15       62.36
         ccrcc |         23        3.67       66.03
         ccrca |         18        2.87       68.90
           scn |         18        2.87       71.77
          sasx |         15        2.39       74.16
          ermc |         12        1.91       76.08
       qaccsmr |         10        1.59       77.67
           sak |          8        1.28       78.95
          tetk |          8        1.28       80.22
        ant9ia |          7        1.12       81.34
          arcb |          6        0.96       82.30
          arcc |          6        0.96       83.25
          arcd |          6        0.96       84.21
          erma |          6        0.96       85.17
          lnua |          6        0.96       86.12
         lukmf |          6        0.96       87.08
          ccra |          5        0.80       87.88
           sec |          5        0.80       88.68
         tsst1 |          5        0.80       89.47
          dfra |          4        0.64       90.11
        lukpvs |          4        0.64       90.75
           sea |          4        0.64       91.39
           seh |          4        0.64       92.03
      aac6aph2 |          3        0.48       92.50
          fusc |          3        0.48       92.98
     grla/gyra |          3        0.48       93.46
          meca |          3        0.48       93.94
          sat4 |          3        0.48       94.42
           seb |          3        0.48       94.90
           sep |          3        0.48       95.37
    aaddaph4ia |          2        0.32       95.69
           etb |          2        0.32       96.01
           etd |          2        0.32       96.33
          fusa |          2        0.32       96.65
          fusb |          2        0.32       96.97
        lukpvf |          2        0.32       97.29
          mupa |          2        0.32       97.61
          qaca |          2        0.32       97.93
          rpob |          2        0.32       98.25
          tetm |          2        0.32       98.56
  apha3aph3iii |          1        0.16       98.72
          arca |          1        0.16       98.88
           cfr |          1        0.16       99.04
          dfrb |          1        0.16       99.20
          dfrg |          1        0.16       99.36
          ermb |          1        0.16       99.52
           eta |          1        0.16       99.68
          mphc |          1        0.16       99.84
          msra |          1        0.16      100.00
---------------+-----------------------------------
         Total |        627      100.00

. 
. noi di "disagreements: samples"
disagreements: samples

. 
. noi tab sample, sort

           Sample_id |      Freq.     Percent        Cum.
---------------------+-----------------------------------
    RH11000301-155-1 |         21        3.35        3.35
 H094920323-271-A1-2 |         10        1.59        4.94
    H113640238-143-1 |          9        1.44        6.38
           C00003385 |          8        1.28        7.66
           C00003320 |          7        1.12        8.77
           C00003248 |          6        0.96        9.73
           C00003272 |          6        0.96       10.69
           C00003315 |          6        0.96       11.64
    H122880144-207-1 |          6        0.96       12.60
    H133580080-596-1 |          6        0.96       13.56
           C00003152 |          5        0.80       14.35
           C00003421 |          5        0.80       15.15
           C00003423 |          5        0.80       15.95
           C00003425 |          5        0.80       16.75
    H092520302-216-1 |          5        0.80       17.54
    H110740135-193-2 |          5        0.80       18.34
    H113560219-469-2 |          5        0.80       19.14
H114140657-280-B01-2 |          5        0.80       19.94
    H114160352-129-1 |          5        0.80       20.73
    H121120058-504-1 |          5        0.80       21.53
    H121320081-505-1 |          5        0.80       22.33
 H125000105-229-G0-2 |          5        0.80       23.13
    H125000105-833-2 |          5        0.80       23.92
    H133000236-626-1 |          5        0.80       24.72
    H133020301-629-1 |          5        0.80       25.52
    H133120386-618-1 |          5        0.80       26.32
    H133300151-657-1 |          5        0.80       27.11
    H133720214-574-1 |          5        0.80       27.91
    H133720215-575-1 |          5        0.80       28.71
    H133860126-577-1 |          5        0.80       29.51
    H133960276-571-1 |          5        0.80       30.30
           C00003134 |          4        0.64       30.94
           C00003207 |          4        0.64       31.58
           C00003317 |          4        0.64       32.22
           C00003340 |          4        0.64       32.85
           C00003377 |          4        0.64       33.49
           C00003382 |          4        0.64       34.13
           C00003393 |          4        0.64       34.77
           C00003406 |          4        0.64       35.41
H105040039-373-G12-2 |          4        0.64       36.04
    H114720434-145-1 |          4        0.64       36.68
           C00001086 |          3        0.48       37.16
           C00001446 |          3        0.48       37.64
           C00002656 |          3        0.48       38.12
           C00003140 |          3        0.48       38.60
           C00003229 |          3        0.48       39.07
           C00003301 |          3        0.48       39.55
           C00003318 |          3        0.48       40.03
           C00003321 |          3        0.48       40.51
           C00003337 |          3        0.48       40.99
           C00003341 |          3        0.48       41.47
           C00003347 |          3        0.48       41.95
           C00003411 |          3        0.48       42.42
           C00007064 |          3        0.48       42.90
           C00008638 |          3        0.48       43.38
           C00013217 |          3        0.48       43.86
    H104420250-444-2 |          3        0.48       44.34
    H110820268-195-2 |          3        0.48       44.82
 H120420116-223-A0-2 |          3        0.48       45.30
 H120600058-224-B0-2 |          3        0.48       45.77
    H121320099-507-1 |          3        0.48       46.25
    H121340220-509-1 |          3        0.48       46.73
H122900151-350-H09-2 |          3        0.48       47.21
    H123120336-557-1 |          3        0.48       47.69
H124420844-355-E10-2 |          3        0.48       48.17
    H132540570-419-2 |          3        0.48       48.64
    RH08000028-150-1 |          3        0.48       49.12
RH11000090-289-C02-2 |          3        0.48       49.60
           C00000785 |          2        0.32       49.92
           C00000786 |          2        0.32       50.24
           C00000790 |          2        0.32       50.56
           C00000800 |          2        0.32       50.88
           C00000815 |          2        0.32       51.20
           C00000817 |          2        0.32       51.52
           C00001091 |          2        0.32       51.83
           C00001265 |          2        0.32       52.15
           C00003122 |          2        0.32       52.47
           C00003130 |          2        0.32       52.79
           C00003137 |          2        0.32       53.11
           C00003165 |          2        0.32       53.43
           C00003306 |          2        0.32       53.75
           C00003307 |          2        0.32       54.07
           C00003314 |          2        0.32       54.39
           C00003333 |          2        0.32       54.70
           C00003339 |          2        0.32       55.02
           C00003389 |          2        0.32       55.34
           C00003395 |          2        0.32       55.66
           C00003396 |          2        0.32       55.98
           C00003397 |          2        0.32       56.30
           C00003415 |          2        0.32       56.62
           C00003419 |          2        0.32       56.94
           C00003422 |          2        0.32       57.26
           C00012749 |          2        0.32       57.58
           C00013230 |          2        0.32       57.89
 H101120403-273-C1-2 |          2        0.32       58.21
    H104080090-443-2 |          2        0.32       58.53
    H104600048-190-2 |          2        0.32       58.85
    H105020486-191-2 |          2        0.32       59.17
H105260391-374-H12-2 |          2        0.32       59.49
    H110520238-116-2 |          2        0.32       59.81
    H111640001-197-2 |          2        0.32       60.13
    H113640215-127-2 |          2        0.32       60.45
 H114080202-255-A1-2 |          2        0.32       60.77
    H114120077-144-1 |          2        0.32       61.08
H114680370-339-E08-2 |          2        0.32       61.40
    H120440759-384-2 |          2        0.32       61.72
 H120840083-225-C0-2 |          2        0.32       62.04
    H121000455-532-1 |          2        0.32       62.36
    H121300130-139-1 |          2        0.32       62.68
    H121320082-506-1 |          2        0.32       63.00
H122560310-348-F09-2 |          2        0.32       63.32
    H123100271-555-1 |          2        0.32       63.64
    H123120337-556-1 |          2        0.32       63.96
H123700164-353-C10-2 |          2        0.32       64.27
    H124860349-210-1 |          2        0.32       64.59
    H124940430-401-1 |          2        0.32       64.91
H130240275-357-G10-2 |          2        0.32       65.23
    H132620132-420-2 |          2        0.32       65.55
    H133180046-621-1 |          2        0.32       65.87
    H133180047-622-1 |          2        0.32       66.19
    H133520197-646-1 |          2        0.32       66.51
    H133760113-576-1 |          2        0.32       66.83
    H133920237-578-1 |          2        0.32       67.15
    RH10000448-161-1 |          2        0.32       67.46
 RH11000042-258-D1-2 |          2        0.32       67.78
RH11000044-286-H01-2 |          2        0.32       68.10
RH11000072-288-B02-2 |          2        0.32       68.42
 RH12000505-239-A0-2 |          2        0.32       68.74
    RH12000540-156-1 |          2        0.32       69.06
           C00000784 |          1        0.16       69.22
           C00000787 |          1        0.16       69.38
           C00000788 |          1        0.16       69.54
           C00000789 |          1        0.16       69.70
           C00000799 |          1        0.16       69.86
           C00000806 |          1        0.16       70.02
           C00000808 |          1        0.16       70.18
           C00000809 |          1        0.16       70.33
           C00000816 |          1        0.16       70.49
           C00000818 |          1        0.16       70.65
           C00000820 |          1        0.16       70.81
           C00000828 |          1        0.16       70.97
           C00000829 |          1        0.16       71.13
           C00000831 |          1        0.16       71.29
           C00000857 |          1        0.16       71.45
           C00001079 |          1        0.16       71.61
           C00001080 |          1        0.16       71.77
           C00001100 |          1        0.16       71.93
           C00001102 |          1        0.16       72.09
           C00001226 |          1        0.16       72.25
           C00001240 |          1        0.16       72.41
           C00001387 |          1        0.16       72.57
           C00002620 |          1        0.16       72.73
           C00003084 |          1        0.16       72.89
           C00003092 |          1        0.16       73.05
           C00003093 |          1        0.16       73.21
           C00003111 |          1        0.16       73.37
           C00003115 |          1        0.16       73.52
           C00003121 |          1        0.16       73.68
           C00003125 |          1        0.16       73.84
           C00003144 |          1        0.16       74.00
           C00003155 |          1        0.16       74.16
           C00003158 |          1        0.16       74.32
           C00003164 |          1        0.16       74.48
           C00003176 |          1        0.16       74.64
           C00003195 |          1        0.16       74.80
           C00003221 |          1        0.16       74.96
           C00003223 |          1        0.16       75.12
           C00003224 |          1        0.16       75.28
           C00003240 |          1        0.16       75.44
           C00003242 |          1        0.16       75.60
           C00003249 |          1        0.16       75.76
           C00003250 |          1        0.16       75.92
           C00003252 |          1        0.16       76.08
           C00003253 |          1        0.16       76.24
           C00003254 |          1        0.16       76.40
           C00003259 |          1        0.16       76.56
           C00003260 |          1        0.16       76.71
           C00003270 |          1        0.16       76.87
           C00003277 |          1        0.16       77.03
           C00003278 |          1        0.16       77.19
           C00003290 |          1        0.16       77.35
           C00003292 |          1        0.16       77.51
           C00003302 |          1        0.16       77.67
           C00003303 |          1        0.16       77.83
           C00003319 |          1        0.16       77.99
           C00003332 |          1        0.16       78.15
           C00003348 |          1        0.16       78.31
           C00003351 |          1        0.16       78.47
           C00003352 |          1        0.16       78.63
           C00003354 |          1        0.16       78.79
           C00003355 |          1        0.16       78.95
           C00003362 |          1        0.16       79.11
           C00003379 |          1        0.16       79.27
           C00003381 |          1        0.16       79.43
           C00003410 |          1        0.16       79.59
           C00003414 |          1        0.16       79.74
           C00007083 |          1        0.16       79.90
           C00007096 |          1        0.16       80.06
           C00008625 |          1        0.16       80.22
           C00008949 |          1        0.16       80.38
           C00008960 |          1        0.16       80.54
           C00012738 |          1        0.16       80.70
           C00012775 |          1        0.16       80.86
           C00012776 |          1        0.16       81.02
           C00012780 |          1        0.16       81.18
           C00012784 |          1        0.16       81.34
           C00013162 |          1        0.16       81.50
           C00013165 |          1        0.16       81.66
           C00013195 |          1        0.16       81.82
           C00013213 |          1        0.16       81.98
           C00013221 |          1        0.16       82.14
           C00013224 |          1        0.16       82.30
           C00013231 |          1        0.16       82.46
           C00013235 |          1        0.16       82.62
           C00013241 |          1        0.16       82.78
           C00013248 |          1        0.16       82.93
           C00013318 |          1        0.16       83.09
           C00013326 |          1        0.16       83.25
           C00013335 |          1        0.16       83.41
           C00013362 |          1        0.16       83.57
           C00013364 |          1        0.16       83.73
           C00013367 |          1        0.16       83.89
           C00013393 |          1        0.16       84.05
           C00013401 |          1        0.16       84.21
           C00013406 |          1        0.16       84.37
    H034660053-158-1 |          1        0.16       84.53
H065060092-367-A12-2 |          1        0.16       84.69
 H065120079-263-A1-2 |          1        0.16       84.85
 H074780626-266-D1-2 |          1        0.16       85.01
    H080980484-164-1 |          1        0.16       85.17
 H082600495-244-F0-2 |          1        0.16       85.33
 H091100226-245-G0-2 |          1        0.16       85.49
 H093620523-269-G1-2 |          1        0.16       85.65
    H100140197-167-2 |          1        0.16       85.81
    H100200151-169-2 |          1        0.16       85.96
    H100800158-172-2 |          1        0.16       86.12
    H101020134-173-2 |          1        0.16       86.28
    H101520278-175-2 |          1        0.16       86.44
    H101580214-176-2 |          1        0.16       86.60
 H101740329-274-D1-2 |          1        0.16       86.76
 H101740629-240-B0-2 |          1        0.16       86.92
 H102820334-277-G1-2 |          1        0.16       87.08
 H102840444-246-H0-2 |          1        0.16       87.24
    H103060332-756-2 |          1        0.16       87.40
    H103220288-184-2 |          1        0.16       87.56
 H103360314-241-C0-2 |          1        0.16       87.72
    H103440108-442-2 |          1        0.16       87.88
H103560109-371-E12-2 |          1        0.16       88.04
 H104340410-220-F0-2 |          1        0.16       88.20
    H104420050-188-2 |          1        0.16       88.36
 H105020135-247-A0-2 |          1        0.16       88.52
 H105140339-248-B0-2 |          1        0.16       88.68
    H111600186-455-2 |          1        0.16       88.84
    H111740190-456-2 |          1        0.16       89.00
    H111940137-460-2 |          1        0.16       89.15
H111960080-332-F07-2 |          1        0.16       89.31
    H112060137-461-2 |          1        0.16       89.47
    H112540036-142-1 |          1        0.16       89.63
    H112660153-200-1 |          1        0.16       89.79
    H113020155-466-2 |          1        0.16       89.95
    H113140144-468-2 |          1        0.16       90.11
H113420072-336-B08-2 |          1        0.16       90.27
    H113880160-476-1 |          1        0.16       90.43
    H113920345-478-1 |          1        0.16       90.59
    H114340058-470-2 |          1        0.16       90.75
    H114700366-481-1 |          1        0.16       90.91
    H114720432-482-1 |          1        0.16       91.07
    H120220271-381-2 |          1        0.16       91.23
    H120680309-385-2 |          1        0.16       91.39
H120860096-346-D09-2 |          1        0.16       91.55
    H121060252-533-1 |          1        0.16       91.71
    H121100042-534-1 |          1        0.16       91.87
    H121120051-535-1 |          1        0.16       92.03
    H121800040-510-1 |          1        0.16       92.19
    H122660093-513-1 |          1        0.16       92.34
    H122840129-206-1 |          1        0.16       92.50
    H122960028-515-1 |          1        0.16       92.66
    H122960030-517-1 |          1        0.16       92.82
    H123020176-551-1 |          1        0.16       92.98
    H123020177-552-1 |          1        0.16       93.14
    H123020178-553-1 |          1        0.16       93.30
    H123100270-554-1 |          1        0.16       93.46
    H123120338-558-1 |          1        0.16       93.62
    H123220266-561-1 |          1        0.16       93.78
    H124060094-134-1 |          1        0.16       93.94
 H124420845-227-E0-2 |          1        0.16       94.10
    H124720623-209-1 |          1        0.16       94.26
H125280642-356-F10-2 |          1        0.16       94.42
    H125280642-841-2 |          1        0.16       94.58
    H130660215-405-2 |          1        0.16       94.74
    H131660094-412-2 |          1        0.16       94.90
    H131800554-414-2 |          1        0.16       95.06
    H131800573-415-2 |          1        0.16       95.22
    H132280003-416-2 |          1        0.16       95.37
    H132920375-623-1 |          1        0.16       95.53
    H133060079-613-1 |          1        0.16       95.69
    H133100176-615-1 |          1        0.16       95.85
    H133200270-608-1 |          1        0.16       96.01
    H133240054-609-1 |          1        0.16       96.17
    H133560609-593-1 |          1        0.16       96.33
    H133580086-601-1 |          1        0.16       96.49
    H133580087-582-1 |          1        0.16       96.65
    H133900439-581-1 |          1        0.16       96.81
    H133960268-568-1 |          1        0.16       96.97
    H133960269-569-1 |          1        0.16       97.13
 RH07000425-233-C0-2 |          1        0.16       97.29
 RH10000375-235-E0-2 |          1        0.16       97.45
 RH10000389-236-F0-2 |          1        0.16       97.61
RH11000029-284-F01-2 |          1        0.16       97.77
RH11000133-292-F02-2 |          1        0.16       97.93
RH11000142-293-G02-2 |          1        0.16       98.09
RH11000146-294-H02-2 |          1        0.16       98.25
RH12000046-298-D03-2 |          1        0.16       98.41
RH12000340-301-G03-2 |          1        0.16       98.56
RH12000346-307-E04-2 |          1        0.16       98.72
    RH12000366-426-2 |          1        0.16       98.88
    RH12000370-430-2 |          1        0.16       99.04
    RH12000374-434-2 |          1        0.16       99.20
    RH12000375-435-2 |          1        0.16       99.36
    RH12000376-436-2 |          1        0.16       99.52
    RH12000379-439-2 |          1        0.16       99.68
    RH12000381-441-2 |          1        0.16       99.84
 RH12000503-261-G1-2 |          1        0.16      100.00
---------------------+-----------------------------------
               Total |        627      100.00

. 
. noi di "disagreements: set"
disagreements: set

. 
. noi tab set, sort

        set |      Freq.     Percent        Cum.
------------+-----------------------------------
 Collindale |        349       55.66       55.66
  Oxford501 |        233       37.16       92.82
  Oxford491 |         45        7.18      100.00
------------+-----------------------------------
      Total |        627      100.00

. 
. noi tab site set

               |               set
          site | Collind..  Oxford491  Oxford501 |     Total
---------------+---------------------------------+----------
      aac6aph2 |         3          0          0 |         3 
    aaddaph4ia |         0          0          2 |         2 
    aadeant6ia |        25          1          4 |        30 
        ant9ia |         4          0          3 |         7 
  apha3aph3iii |         0          0          1 |         1 
          arca |         1          0          0 |         1 
          arcb |         3          1          2 |         6 
          arcc |         3          1          2 |         6 
          arcd |         3          1          2 |         6 
          blaz |        19          4          4 |        27 
          ccra |         3          0          2 |         5 
          ccrb |         4          7         22 |        33 
         ccrca |        16          1          1 |        18 
         ccrcb |        39          2          3 |        44 
         ccrcc |        21          0          2 |        23 
           cfr |         1          0          0 |         1 
           chp |         3          4         40 |        47 
          dfra |         4          0          0 |         4 
          dfrb |         0          1          0 |         1 
          dfrc |        37          0          0 |        37 
          dfrg |         1          0          0 |         1 
          erma |         3          0          3 |         6 
          ermb |         0          0          1 |         1 
          ermc |         2          4          6 |        12 
           eta |         1          0          0 |         1 
           etb |         1          1          0 |         2 
           etd |         1          0          1 |         2 
          fusa |         0          0          2 |         2 
          fusb |         1          0          1 |         2 
          fusc |         1          0          2 |         3 
     grla/gyra |         2          0          1 |         3 
          lnua |         6          0          0 |         6 
         lukmf |         6          0          0 |         6 
        lukpvf |         2          0          0 |         2 
        lukpvs |         3          0          1 |         4 
          meca |         3          0          0 |         3 
          mphc |         1          0          0 |         1 
          msra |         0          0          1 |         1 
          mupa |         2          0          0 |         2 
          qaca |         2          0          0 |         2 
          qacb |        38          8          0 |        46 
       qaccsmr |         2          2          6 |        10 
          rpob |         1          0          1 |         2 
           sak |         4          0          4 |         8 
          sasx |        15          0          0 |        15 
          sat4 |         1          0          2 |         3 
           scn |         3          0         15 |        18 
           sea |         2          0          2 |         4 
           seb |         1          1          1 |         3 
           sec |         2          0          3 |         5 
           seg |         2          2         22 |        26 
           seh |         2          0          2 |         4 
           sei |        14          1         27 |        42 
           sep |         0          1          2 |         3 
           seu |        28          2         29 |        59 
          tetk |         5          0          3 |         8 
          tetm |         0          0          2 |         2 
         tsst1 |         2          0          3 |         5 
---------------+---------------------------------+----------
         Total |       349         45        233 |       627 


. 
. 
. 
. save discrepancies, replace
(note: file discrepancies.dta not found)
file discrepancies.dta saved

. 
. 
. 
. 
. 
. **********************************

. 
. * hypothesis: this is due to borderline coverage

. 
. 
. 
. use coverage_tw, clear

. 
. * need to clean site name values 

. 
. **** match up things I think are the same but with slightly different names

. 
. replace site = "ant9ib" if site=="ant9_ibspc"
(0 real changes made)

. 
. replace site = "ant9ia" if site=="ant9_iaspc"
(0 real changes made)

. 
. replace site= "aac6aph2" if strpos(site, "aac")
(0 real changes made)

. 
. 
. 
. replace site = subinstr(site, "acr", "arc",.) if strpos(site, "acr")
(4,170 real changes made)

. 
. replace site = "mlst" if site=="st"
(0 real changes made)

. 
. replace site = "ccrca"  if site == "ccrc_a"
(0 real changes made)

. 
. replace site = "ccrcb"  if site == "ccrc_b"
(0 real changes made)

. 
. replace site = "ccrcc"  if site == "ccrc_c"
(0 real changes made)

. 
. 
. 
. 
. 
. **********************************************

. 
. * deal with sites with multiple variants

. 
. save temp, replace
file temp.dta saved

. 
. 
. 
. noi di "where reported as multiple variants"
where reported as multiple variants

. 
. 
. 
. use temp, clear

. 
. keep if strpos(site, "1") | strpos(site, "2") | strpos(site, "3") | strpos(site, "4") | strpos(site, "6") 
(93,130 observations deleted)

. 
. drop if site=="tsst1"
(1,390 observations deleted)

. 
. drop if !strpos(site, "_")
(8,340 observations deleted)

. 
. split site, parse(_)
variables created as string: 
site1  site2

. 
. drop site

. 
. destring site2, replace
site2: all characters numeric; replaced as byte

. 
. rename site2 sitenum

. 
. rename site1 site

. 
. reshape wide value, i(sample method site) j(sitenum)
(note: j = 1 2 3 4 6)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                    47260   ->   16680
Number of variables                   5   ->       8
j variable (5 values)           sitenum   ->   (dropped)
xij variables:
                                  value   ->   value1 value2 ... value6
-----------------------------------------------------------------------------

. 
. rename value
syntax error
    Syntax is
        rename  oldname    newname   [, renumber[(#)] addnumber[(#)] sort ...]
        rename (oldnames) (newnames) [, renumber[(#)] addnumber[(#)] sort ...]
        rename  oldnames              , {upper|lower|proper}
r(198);

. 
. 
. 
. merge 1:1 sample site using discrepancies, update
(note: variable site was str4, now str14 to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                        17,237
        from master                    16,645  (_merge==1)
        from using                        592  (_merge==2)

    matched                                35
        not updated                        35  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. tab site _merge

               |              _merge
          site | master on  using onl  matched ( |     Total
---------------+---------------------------------+----------
      aac6aph2 |         0          3          0 |         3 
    aaddaph4ia |         0          2          0 |         2 
    aadeant6ia |         0         30          0 |        30 
        ant9ia |         0          7          0 |         7 
  apha3aph3iii |         0          1          0 |         1 
          arca |         0          1          0 |         1 
          arcb |         0          6          0 |         6 
          arcc |         0          6          0 |         6 
          arcd |         0          6          0 |         6 
          blaz |         0         27          0 |        27 
          ccrA |     1,390          0          0 |     1,390 
          ccrB |     1,390          0          0 |     1,390 
          ccra |         0          5          0 |         5 
          ccrb |         0         33          0 |        33 
         ccrca |         0         18          0 |        18 
         ccrcb |         0         44          0 |        44 
         ccrcc |         0         23          0 |        23 
           cfr |         0          1          0 |         1 
           chp |         0         47          0 |        47 
          dfrB |     1,390          0          0 |     1,390 
          dfra |         0          4          0 |         4 
          dfrb |         0          1          0 |         1 
          dfrc |         0         37          0 |        37 
          dfrg |         0          1          0 |         1 
          ermA |     1,390          0          0 |     1,390 
          erma |         0          6          0 |         6 
          ermb |         0          1          0 |         1 
          ermc |         0         12          0 |        12 
           eta |         0          1          0 |         1 
           etb |         0          2          0 |         2 
           etd |         0          2          0 |         2 
          fusA |     1,390          0          0 |     1,390 
          fusa |         0          2          0 |         2 
          fusb |         0          2          0 |         2 
          fusc |         0          3          0 |         3 
          grlA |     1,390          0          0 |     1,390 
     grla/gyra |         0          3          0 |         3 
          gyrA |     1,390          0          0 |     1,390 
          ileS |     1,390          0          0 |     1,390 
          lnua |         0          6          0 |         6 
         lukmf |         0          6          0 |         6 
        lukpvf |         0          2          0 |         2 
        lukpvs |         0          4          0 |         4 
          meca |         0          3          0 |         3 
          mphc |         0          1          0 |         1 
          msra |         0          1          0 |         1 
          mupa |         0          2          0 |         2 
          qaca |         0          2          0 |         2 
          qacb |         0         46          0 |        46 
       qaccsmr |         0         10          0 |        10 
          rpoB |     1,390          0          0 |     1,390 
          rpob |         0          2          0 |         2 
           sak |         0          8          0 |         8 
          sasx |         0         15          0 |        15 
          sat4 |         0          3          0 |         3 
           scn |         0         18          0 |        18 
           sea |     1,388          2          2 |     1,392 
           seb |         0          3          0 |         3 
           sec |         0          5          0 |         5 
           seg |         0         26          0 |        26 
           seh |     1,388          2          2 |     1,392 
           sei |         0         42          0 |        42 
           sep |         0          3          0 |         3 
           seu |     1,359         28         31 |     1,418 
          tetk |         0          8          0 |         8 
          tetm |         0          2          0 |         2 
         tsst1 |         0          5          0 |         5 
---------------+---------------------------------+----------
         Total |    16,645        592         35 |    17,272 


. drop if _merge==1
(16,645 observations deleted)

. tab site _merge

               |        _merge
          site | using onl  matched ( |     Total
---------------+----------------------+----------
      aac6aph2 |         3          0 |         3 
    aaddaph4ia |         2          0 |         2 
    aadeant6ia |        30          0 |        30 
        ant9ia |         7          0 |         7 
  apha3aph3iii |         1          0 |         1 
          arca |         1          0 |         1 
          arcb |         6          0 |         6 
          arcc |         6          0 |         6 
          arcd |         6          0 |         6 
          blaz |        27          0 |        27 
          ccra |         5          0 |         5 
          ccrb |        33          0 |        33 
         ccrca |        18          0 |        18 
         ccrcb |        44          0 |        44 
         ccrcc |        23          0 |        23 
           cfr |         1          0 |         1 
           chp |        47          0 |        47 
          dfra |         4          0 |         4 
          dfrb |         1          0 |         1 
          dfrc |        37          0 |        37 
          dfrg |         1          0 |         1 
          erma |         6          0 |         6 
          ermb |         1          0 |         1 
          ermc |        12          0 |        12 
           eta |         1          0 |         1 
           etb |         2          0 |         2 
           etd |         2          0 |         2 
          fusa |         2          0 |         2 
          fusb |         2          0 |         2 
          fusc |         3          0 |         3 
     grla/gyra |         3          0 |         3 
          lnua |         6          0 |         6 
         lukmf |         6          0 |         6 
        lukpvf |         2          0 |         2 
        lukpvs |         4          0 |         4 
          meca |         3          0 |         3 
          mphc |         1          0 |         1 
          msra |         1          0 |         1 
          mupa |         2          0 |         2 
          qaca |         2          0 |         2 
          qacb |        46          0 |        46 
       qaccsmr |        10          0 |        10 
          rpob |         2          0 |         2 
           sak |         8          0 |         8 
          sasx |        15          0 |        15 
          sat4 |         3          0 |         3 
           scn |        18          0 |        18 
           sea |         2          2 |         4 
           seb |         3          0 |         3 
           sec |         5          0 |         5 
           seg |        26          0 |        26 
           seh |         2          2 |         4 
           sei |        42          0 |        42 
           sep |         3          0 |         3 
           seu |        28         31 |        59 
          tetk |         8          0 |         8 
          tetm |         2          0 |         2 
         tsst1 |         5          0 |         5 
---------------+----------------------+----------
         Total |       592         35 |       627 


. sort site

. use coverage_tw, clear

. keep sample

. duplicates drop

Duplicates in terms of all variables

(148,730 observations deleted)

. 
. * typewriter sets

. 
. noi di "typewriter coverage"
typewriter coverage

. 
. 
. 
. import excel "E:\users\amy.mason\Pipeline_27_07_2016\Inputs\Typewriter_thresholds_10Feb15.xlsx", sheet("target list 1") firstrow
>  clear

. 
. rename s twentythree_s

. 
. gen method="typewriter coverage"

. 
. rename BLASTDB sample

. 
. drop if sample ==""
(0 observations deleted)

. 
. *reshape to one line per site/sample

. 
. renpfix "" value

. 
. rename valuesample sample

. 
. rename valuemethod method

. 
. reshape long value, i(sample method) j(site) string
(note: j = IsaB aac6aph2 aadDaph4Ia aadEant6Ia ant9_Iaspc ant9_Ibspc aph2Ic aphA3aph3III blaZ cat cfr dfrB_1 dfrB_2 dfr_A dfr_C df
> r_D dfr_G dfr_K ermA_1 ermA_2 ermB ermC ermT ermY fusA_1 fusA_2 fusA_3 fus_B fus_C grlA_1 grlA_2 grlA_3 gyrA_1 gyrA_2 gyrA_3 gyr
> A_4 ileS_1 ileS_2 ileS_3 lnu_A lnu_B mecA mecC mphC msrA mupA mupB rpoB_1 rpoB_2 sat4 str tetK tetL tetM tetO twentythree_s van_
> A van_B van_C vgaA vgaB vgbA)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                     1390   ->   86180
Number of variables                  64   ->       4
j variable (62 values)                    ->   site
xij variables:
  valueIsaB valueaac6aph2 ... valuevgbA   ->   value
-----------------------------------------------------------------------------

. 
. save coverage_tw1, replace
file coverage_tw1.dta saved

. 
. 
. 
. import excel "E:\users\amy.mason\Pipeline_27_07_2016\Inputs\Typewriter_thresholds_10Feb15.xlsx", sheet("target list 2") firstrow
>  clear

. 
. 
. 
. gen method="typewriter coverage"

. 
. rename BLASTDB sample

. 
. drop if sample ==""
(0 observations deleted)

. 
. *reshape to one line per site/sample

. 
. renpfix "" value

. 
. rename valuesample sample

. 
. rename valuemethod method

. 
. reshape long value, i(sample method) j(site) string
(note: j = acrB acrC acrD arcA ccrA_1 ccrA_2 ccrA_3 ccrA_4 ccrB_1 ccrB_2 ccrB_3 ccrB_4 ccrB_6 ccrC_a ccrC_b ccrC_c chp eta etb etd
>  lukM lukMF lukPVF lukPVS qac_A qac_B qac_Csmr sak sasX scn sea_1 sea_2 seb sec sed see seg seh_1 seh_2 sei sej selR sep seu_1 s
> eu_2 tsst1)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                     1390   ->   63940
Number of variables                  48   ->       4
j variable (46 values)                    ->   site
xij variables:
     valueacrB valueacrC ... valuetsst1   ->   value
-----------------------------------------------------------------------------

. 
. 
. 
. append using coverage_tw1.dta, force
(note: variable site was str8, now str13 to accommodate using data's values)

. 
. *clean sample names

. gen break = strpos(sample, "_PHE")

. order break

. drop if strpos==0
strpos not found
r(111);

. drop if break==0
(107,244 observations deleted)

. gen shortsample = substr(sample, 1, break)

. order short

. drop short

. gen shortsample = substr(sample, 1, break-1)

. noi di "typewriter coverage"
typewriter coverage

. 
. 
. 
. import excel "E:\users\amy.mason\Pipeline_27_07_2016\Inputs\Typewriter_thresholds_10Feb15.xlsx", sheet("target list 1") firstrow
>  clear

. 
. rename s twentythree_s

. 
. gen method="typewriter coverage"

. 
. rename BLASTDB sample

. 
. drop if sample ==""
(0 observations deleted)

. 
. *reshape to one line per site/sample

. 
. renpfix "" value

. 
. rename valuesample sample

. 
. rename valuemethod method

. 
. reshape long value, i(sample method) j(site) string
(note: j = IsaB aac6aph2 aadDaph4Ia aadEant6Ia ant9_Iaspc ant9_Ibspc aph2Ic aphA3aph3III blaZ cat cfr dfrB_1 dfrB_2 dfr_A dfr_C df
> r_D dfr_G dfr_K ermA_1 ermA_2 ermB ermC ermT ermY fusA_1 fusA_2 fusA_3 fus_B fus_C grlA_1 grlA_2 grlA_3 gyrA_1 gyrA_2 gyrA_3 gyr
> A_4 ileS_1 ileS_2 ileS_3 lnu_A lnu_B mecA mecC mphC msrA mupA mupB rpoB_1 rpoB_2 sat4 str tetK tetL tetM tetO twentythree_s van_
> A van_B van_C vgaA vgaB vgbA)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                     1390   ->   86180
Number of variables                  64   ->       4
j variable (62 values)                    ->   site
xij variables:
  valueIsaB valueaac6aph2 ... valuevgbA   ->   value
-----------------------------------------------------------------------------

. 
. save coverage_tw1, replace
file coverage_tw1.dta saved

. 
. 
. 
. import excel "E:\users\amy.mason\Pipeline_27_07_2016\Inputs\Typewriter_thresholds_10Feb15.xlsx", sheet("target list 2") firstrow
>  clear

. 
. 
. 
. gen method="typewriter coverage"

. 
. rename BLASTDB sample

. 
. drop if sample ==""
(0 observations deleted)

. 
. *reshape to one line per site/sample

. 
. renpfix "" value

. 
. rename valuesample sample

. 
. rename valuemethod method

. 
. reshape long value, i(sample method) j(site) string
(note: j = acrB acrC acrD arcA ccrA_1 ccrA_2 ccrA_3 ccrA_4 ccrB_1 ccrB_2 ccrB_3 ccrB_4 ccrB_6 ccrC_a ccrC_b ccrC_c chp eta etb etd
>  lukM lukMF lukPVF lukPVS qac_A qac_B qac_Csmr sak sasX scn sea_1 sea_2 seb sec sed see seg seh_1 seh_2 sei sej selR sep seu_1 s
> eu_2 tsst1)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                     1390   ->   63940
Number of variables                  48   ->       4
j variable (46 values)                    ->   site
xij variables:
     valueacrB valueacrC ... valuetsst1   ->   value
-----------------------------------------------------------------------------

. 
. 
. 
. append using coverage_tw1.dta, force
(note: variable site was str8, now str13 to accommodate using data's values)

. 
. *clean sample names

. 
. gen break = strpos(sample, "_PHE")

. 
. gen shortsample = substr(sample, 1, break-1) if break!=0
(107,244 missing values generated)

. 
. replace shortsample=sample if break==0
(107,244 real changes made)

. 
. drop sample

. 
. rename shortsample sample

. 
. save coverage_tw, replace
file coverage_tw.dta saved

. 
. use coverage_tw, clear

. 
. 
. 
. 
. 
. * need to clean site name values 

. 
. **** match up things I think are the same but with slightly different names

. 
. replace site = "ant9ib" if site=="ant9_ibspc"
(0 real changes made)

. 
. replace site = "ant9ia" if site=="ant9_iaspc"
(0 real changes made)

. 
. replace site= "aac6aph2" if strpos(site, "aac")
(0 real changes made)

. 
. 
. 
. replace site = subinstr(site, "acr", "arc",.) if strpos(site, "acr")
(4,170 real changes made)

. 
. replace site = "mlst" if site=="st"
(0 real changes made)

. 
. replace site = "ccrca"  if site == "ccrc_a"
(0 real changes made)

. 
. replace site = "ccrcb"  if site == "ccrc_b"
(0 real changes made)

. 
. replace site = "ccrcc"  if site == "ccrc_c"
(0 real changes made)

. 
. 
. 
. 
. 
. **********************************************

. 
. * deal with sites with multiple variants

. 
. save temp, replace
file temp.dta saved

. 
. 
. 
. noi di "where reported as multiple variants"
where reported as multiple variants

. 
. 
. 
. use temp, clear

. 
. keep if strpos(site, "1") | strpos(site, "2") | strpos(site, "3") | strpos(site, "4") | strpos(site, "6") 
(93,130 observations deleted)

. 
. drop if site=="tsst1"
(1,390 observations deleted)

. 
. drop if !strpos(site, "_")
(8,340 observations deleted)

. 
. split site, parse(_)
variables created as string: 
site1  site2

. 
. drop site

. 
. destring site2, replace
site2: all characters numeric; replaced as byte

. 
. rename site2 sitenum

. 
. rename site1 site

. 
. reshape wide value, i(sample method site) j(sitenum)
(note: j = 1 2 3 4 6)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                    47260   ->   16680
Number of variables                   6   ->       9
j variable (5 values)           sitenum   ->   (dropped)
xij variables:
                                  value   ->   value1 value2 ... value6
-----------------------------------------------------------------------------

. 
. 
. 
. 
. 
. merge 1:1 sample site using discrepancies, update
(note: variable site was str4, now str14 to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                        17,173
        from master                    16,613  (_merge==1)
        from using                        560  (_merge==2)

    matched                                67
        not updated                        67  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. drop if _merge==1
(16,613 observations deleted)

. tab site _merge

               |        _merge
          site | using onl  matched ( |     Total
---------------+----------------------+----------
      aac6aph2 |         3          0 |         3 
    aaddaph4ia |         2          0 |         2 
    aadeant6ia |        30          0 |        30 
        ant9ia |         7          0 |         7 
  apha3aph3iii |         1          0 |         1 
          arca |         1          0 |         1 
          arcb |         6          0 |         6 
          arcc |         6          0 |         6 
          arcd |         6          0 |         6 
          blaz |        27          0 |        27 
          ccra |         5          0 |         5 
          ccrb |        33          0 |        33 
         ccrca |        18          0 |        18 
         ccrcb |        44          0 |        44 
         ccrcc |        23          0 |        23 
           cfr |         1          0 |         1 
           chp |        47          0 |        47 
          dfra |         4          0 |         4 
          dfrb |         1          0 |         1 
          dfrc |        37          0 |        37 
          dfrg |         1          0 |         1 
          erma |         6          0 |         6 
          ermb |         1          0 |         1 
          ermc |        12          0 |        12 
           eta |         1          0 |         1 
           etb |         2          0 |         2 
           etd |         2          0 |         2 
          fusa |         2          0 |         2 
          fusb |         2          0 |         2 
          fusc |         3          0 |         3 
     grla/gyra |         3          0 |         3 
          lnua |         6          0 |         6 
         lukmf |         6          0 |         6 
        lukpvf |         2          0 |         2 
        lukpvs |         4          0 |         4 
          meca |         3          0 |         3 
          mphc |         1          0 |         1 
          msra |         1          0 |         1 
          mupa |         2          0 |         2 
          qaca |         2          0 |         2 
          qacb |        46          0 |        46 
       qaccsmr |        10          0 |        10 
          rpob |         2          0 |         2 
           sak |         8          0 |         8 
          sasx |        15          0 |        15 
          sat4 |         3          0 |         3 
           scn |        18          0 |        18 
           sea |         0          4 |         4 
           seb |         3          0 |         3 
           sec |         5          0 |         5 
           seg |        26          0 |        26 
           seh |         0          4 |         4 
           sei |        42          0 |        42 
           sep |         3          0 |         3 
           seu |         0         59 |        59 
          tetk |         8          0 |         8 
          tetm |         2          0 |         2 
         tsst1 |         5          0 |         5 
---------------+----------------------+----------
         Total |       560         67 |       627 


. 
. use coverage_tw, clear

. 
. 
. 
. 
. 
. * need to clean site name values 

. 
. **** match up things I think are the same but with slightly different names

. 
. replace site = "ant9ib" if site=="ant9_ibspc"
(0 real changes made)

. 
. replace site = "ant9ia" if site=="ant9_iaspc"
(0 real changes made)

. 
. replace site= "aac6aph2" if strpos(site, "aac")
(0 real changes made)

. 
. 
. 
. replace site = subinstr(site, "acr", "arc",.) if strpos(site, "acr")
(4,170 real changes made)

. 
. replace site = "mlst" if site=="st"
(0 real changes made)

. 
. replace site = "ccrca"  if site == "ccrc_a"
(0 real changes made)

. 
. replace site = "ccrcb"  if site == "ccrc_b"
(0 real changes made)

. 
. replace site = "ccrcc"  if site == "ccrc_c"
(0 real changes made)

. 
. 
. 
. 
. 
. **********************************************

. 
. * deal with sites with multiple variants

. 
. save temp, replace
file temp.dta saved

. 
. 
. 
. noi di "where reported as multiple variants"
where reported as multiple variants

. 
. 
. 
. use temp, clear

. 
. keep if strpos(site, "1") | strpos(site, "2") | strpos(site, "3") | strpos(site, "4") | strpos(site, "6") 
(93,130 observations deleted)

. 
. drop if site=="tsst1"
(1,390 observations deleted)

. 
. drop if !strpos(site, "_")
(8,340 observations deleted)

. 
. split site, parse(_)
variables created as string: 
site1  site2

. 
. drop site

. 
. destring site2, replace
site2: all characters numeric; replaced as byte

. 
. rename site2 sitenum

. 
. rename site1 site

. 
. reshape wide value, i(sample method site) j(sitenum)
(note: j = 1 2 3 4 6)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                    47260   ->   16680
Number of variables                   6   ->       9
j variable (5 values)           sitenum   ->   (dropped)
xij variables:
                                  value   ->   value1 value2 ... value6
-----------------------------------------------------------------------------

. 
. noi tab site

       site |      Freq.     Percent        Cum.
------------+-----------------------------------
       ccrA |      1,390        8.33        8.33
       ccrB |      1,390        8.33       16.67
       dfrB |      1,390        8.33       25.00
       ermA |      1,390        8.33       33.33
       fusA |      1,390        8.33       41.67
       grlA |      1,390        8.33       50.00
       gyrA |      1,390        8.33       58.33
       ileS |      1,390        8.33       66.67
       rpoB |      1,390        8.33       75.00
        sea |      1,390        8.33       83.33
        seh |      1,390        8.33       91.67
        seu |      1,390        8.33      100.00
------------+-----------------------------------
      Total |     16,680      100.00

. use coverage_tw, clear

. 
. 
. 
. 
. 
. * need to clean site name values 

. 
. **** match up things I think are the same but with slightly different names

. 
. replace site = "ant9ib" if site=="ant9_ibspc"
(0 real changes made)

. 
. replace site = "ant9ia" if site=="ant9_iaspc"
(0 real changes made)

. 
. replace site= "aac6aph2" if strpos(site, "aac")
(0 real changes made)

. 
. 
. 
. replace site = subinstr(site, "acr", "arc",.) if strpos(site, "acr")
(4,170 real changes made)

. 
. replace site = "mlst" if site=="st"
(0 real changes made)

. 
. replace site = "ccrca"  if site == "ccrc_a"
(0 real changes made)

. 
. replace site = "ccrcb"  if site == "ccrc_b"
(0 real changes made)

. 
. replace site = "ccrcc"  if site == "ccrc_c"
(0 real changes made)

. 
. replace site = lower(site)
(112,590 real changes made)

. 
. 
. 
. save temp, replace
file temp.dta saved

. 
. 
. 
. **********************************************

. 
. * deal with sites with multiple variants

. 
. noi di "where reported as multiple variants"
where reported as multiple variants

. 
. 
. 
. use temp, clear

. 
. keep if strpos(site, "1") | strpos(site, "2") | strpos(site, "3") | strpos(site, "4") | strpos(site, "6") 
(93,130 observations deleted)

. 
. drop if site=="tsst1"
(1,390 observations deleted)

. 
. drop if !strpos(site, "_")
(8,340 observations deleted)

. 
. split site, parse(_)
variables created as string: 
site1  site2

. 
. drop site

. 
. destring site2, replace
site2: all characters numeric; replaced as byte

. 
. rename site2 sitenum

. 
. rename site1 site

. 
. reshape wide value, i(sample method site) j(sitenum)
(note: j = 1 2 3 4 6)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                    47260   ->   16680
Number of variables                   6   ->       9
j variable (5 values)           sitenum   ->   (dropped)
xij variables:
                                  value   ->   value1 value2 ... value6
-----------------------------------------------------------------------------

. 
. noi tab site

       site |      Freq.     Percent        Cum.
------------+-----------------------------------
       ccra |      1,390        8.33        8.33
       ccrb |      1,390        8.33       16.67
       dfrb |      1,390        8.33       25.00
       erma |      1,390        8.33       33.33
       fusa |      1,390        8.33       41.67
       grla |      1,390        8.33       50.00
       gyra |      1,390        8.33       58.33
       iles |      1,390        8.33       66.67
       rpob |      1,390        8.33       75.00
        sea |      1,390        8.33       83.33
        seh |      1,390        8.33       91.67
        seu |      1,390        8.33      100.00
------------+-----------------------------------
      Total |     16,680      100.00

. 
. 
. 
. 
. 
. merge 1:1 sample site using discrepancies, update
(note: variable site was str4, now str14 to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                        17,075
        from master                    16,564  (_merge==1)
        from using                        511  (_merge==2)

    matched                               116
        not updated                       116  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. drop if _merge==1
(16,564 observations deleted)

. tab site _merge

               |        _merge
          site | using onl  matched ( |     Total
---------------+----------------------+----------
      aac6aph2 |         3          0 |         3 
    aaddaph4ia |         2          0 |         2 
    aadeant6ia |        30          0 |        30 
        ant9ia |         7          0 |         7 
  apha3aph3iii |         1          0 |         1 
          arca |         1          0 |         1 
          arcb |         6          0 |         6 
          arcc |         6          0 |         6 
          arcd |         6          0 |         6 
          blaz |        27          0 |        27 
          ccra |         0          5 |         5 
          ccrb |         0         33 |        33 
         ccrca |        18          0 |        18 
         ccrcb |        44          0 |        44 
         ccrcc |        23          0 |        23 
           cfr |         1          0 |         1 
           chp |        47          0 |        47 
          dfra |         4          0 |         4 
          dfrb |         0          1 |         1 
          dfrc |        37          0 |        37 
          dfrg |         1          0 |         1 
          erma |         0          6 |         6 
          ermb |         1          0 |         1 
          ermc |        12          0 |        12 
           eta |         1          0 |         1 
           etb |         2          0 |         2 
           etd |         2          0 |         2 
          fusa |         0          2 |         2 
          fusb |         2          0 |         2 
          fusc |         3          0 |         3 
     grla/gyra |         3          0 |         3 
          lnua |         6          0 |         6 
         lukmf |         6          0 |         6 
        lukpvf |         2          0 |         2 
        lukpvs |         4          0 |         4 
          meca |         3          0 |         3 
          mphc |         1          0 |         1 
          msra |         1          0 |         1 
          mupa |         2          0 |         2 
          qaca |         2          0 |         2 
          qacb |        46          0 |        46 
       qaccsmr |        10          0 |        10 
          rpob |         0          2 |         2 
           sak |         8          0 |         8 
          sasx |        15          0 |        15 
          sat4 |         3          0 |         3 
           scn |        18          0 |        18 
           sea |         0          4 |         4 
           seb |         3          0 |         3 
           sec |         5          0 |         5 
           seg |        26          0 |        26 
           seh |         0          4 |         4 
           sei |        42          0 |        42 
           sep |         3          0 |         3 
           seu |         0         59 |        59 
          tetk |         8          0 |         8 
          tetm |         2          0 |         2 
         tsst1 |         5          0 |         5 
---------------+----------------------+----------
         Total |       511        116 |       627 


. 
. use temp, clear

. 
. keep if strpos(site, "1") | strpos(site, "2") | strpos(site, "3") | strpos(site, "4") | strpos(site, "6") 
(93,130 observations deleted)

. 
. drop if site=="tsst1"
(1,390 observations deleted)

. 
. drop if !strpos(site, "_")
(8,340 observations deleted)

. 
. split site, parse(_)
variables created as string: 
site1  site2

. 
. drop site

. 
. destring site2, replace
site2: all characters numeric; replaced as byte

. 
. rename site2 sitenum

. 
. rename site1 site

. 
. reshape wide value, i(sample method site) j(sitenum)
(note: j = 1 2 3 4 6)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                    47260   ->   16680
Number of variables                   6   ->       9
j variable (5 values)           sitenum   ->   (dropped)
xij variables:
                                  value   ->   value1 value2 ... value6
-----------------------------------------------------------------------------

. 
. noi tab site

       site |      Freq.     Percent        Cum.
------------+-----------------------------------
       ccra |      1,390        8.33        8.33
       ccrb |      1,390        8.33       16.67
       dfrb |      1,390        8.33       25.00
       erma |      1,390        8.33       33.33
       fusa |      1,390        8.33       41.67
       grla |      1,390        8.33       50.00
       gyra |      1,390        8.33       58.33
       iles |      1,390        8.33       66.67
       rpob |      1,390        8.33       75.00
        sea |      1,390        8.33       83.33
        seh |      1,390        8.33       91.67
        seu |      1,390        8.33      100.00
------------+-----------------------------------
      Total |     16,680      100.00

. 
. 
. 
. 
. 
. merge 1:1 sample site using discrepancies, update
(note: variable site was str4, now str14 to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                        17,075
        from master                    16,564  (_merge==1)
        from using                        511  (_merge==2)

    matched                               116
        not updated                       116  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. 
. drop if _merge==1
(16,564 observations deleted)

. 
. 
. 
. preserve 
already preserved
r(621);

. 
. keep if _merge==3
(511 observations deleted)

. 
. save dis1, replace
(note: file dis1.dta not found)
file dis1.dta saved

. 
. restore

. 
. use temp, clear

. 
. keep if strpos(site, "1") | strpos(site, "2") | strpos(site, "3") | strpos(site, "4") | strpos(site, "6") 
(93,130 observations deleted)

. 
. drop if site=="tsst1"
(1,390 observations deleted)

. 
. drop if !strpos(site, "_")
(8,340 observations deleted)

. 
. split site, parse(_)
variables created as string: 
site1  site2

. 
. drop site

. 
. destring site2, replace
site2: all characters numeric; replaced as byte

. 
. rename site2 sitenum

. 
. rename site1 site

. 
. reshape wide value, i(sample method site) j(sitenum)
(note: j = 1 2 3 4 6)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                    47260   ->   16680
Number of variables                   6   ->       9
j variable (5 values)           sitenum   ->   (dropped)
xij variables:
                                  value   ->   value1 value2 ... value6
-----------------------------------------------------------------------------

. 
. noi tab site

       site |      Freq.     Percent        Cum.
------------+-----------------------------------
       ccra |      1,390        8.33        8.33
       ccrb |      1,390        8.33       16.67
       dfrb |      1,390        8.33       25.00
       erma |      1,390        8.33       33.33
       fusa |      1,390        8.33       41.67
       grla |      1,390        8.33       50.00
       gyra |      1,390        8.33       58.33
       iles |      1,390        8.33       66.67
       rpob |      1,390        8.33       75.00
        sea |      1,390        8.33       83.33
        seh |      1,390        8.33       91.67
        seu |      1,390        8.33      100.00
------------+-----------------------------------
      Total |     16,680      100.00

. 
. 
. 
. 
. 
. merge 1:1 sample site using discrepancies, update
(note: variable site was str4, now str14 to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                        17,075
        from master                    16,564  (_merge==1)
        from using                        511  (_merge==2)

    matched                               116
        not updated                       116  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. 
. drop if _merge==1
(16,564 observations deleted)

. 
. 
. 
. preserve 

. 
. keep if _merge==3
(511 observations deleted)

. 
. save dis1, replace
file dis1.dta saved

. 
. restore

. use temp, clear

. drop if strpos(site, "_1") | strpos(site, "_2") | strpos(site, "_3") | strpos(site, "_4") | strpos(site, "_6")
(47,260 observations deleted)

. [Window Title]
[ is not a valid command name
r(199);

. 
. WMI Provider Host
command WMI is unrecognized
r(199);

. 
. 
. 
. [Main Instruction]
[ is not a valid command name
r(199);

. 
. WMI Provider Host has stopped working
command WMI is unrecognized
r(199);

. 
. 
. 
. [Content]
[ is not a valid command name
r(199);

. 
. Windows is checking for a solution to the problem...
command Windows is unrecognized
r(199);

. 
. 
. 
. [Cancel]
[ is not a valid command name
r(199);

. * deal with rest

. 
. noi di "single variants"
single variants

. 
. use temp, clear

. 
. drop if strpos(site, "_1") | strpos(site, "_2") | strpos(site, "_3") | strpos(site, "_4") | strpos(site, "_6") 
(47,260 observations deleted)

. 
. merge 1:1 sample site using dis_remain, update
file dis_remain.dta not found
r(601);

. 
. use temp, clear

. 
. keep if strpos(site, "_1") | strpos(site, "_2") | strpos(site, "_3") | strpos(site, "_4") | strpos(site, "_6") 
(102,860 observations deleted)

. 
. split site, parse(_)
variables created as string: 
site1  site2

. 
. drop site

. 
. destring site2, replace
site2: all characters numeric; replaced as byte

. 
. rename site2 sitenum

. 
. rename site1 site

. 
. reshape wide value, i(sample method site) j(sitenum)
(note: j = 1 2 3 4 6)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                    47260   ->   16680
Number of variables                   6   ->       9
j variable (5 values)           sitenum   ->   (dropped)
xij variables:
                                  value   ->   value1 value2 ... value6
-----------------------------------------------------------------------------

. 
. noi tab site

       site |      Freq.     Percent        Cum.
------------+-----------------------------------
       ccra |      1,390        8.33        8.33
       ccrb |      1,390        8.33       16.67
       dfrb |      1,390        8.33       25.00
       erma |      1,390        8.33       33.33
       fusa |      1,390        8.33       41.67
       grla |      1,390        8.33       50.00
       gyra |      1,390        8.33       58.33
       iles |      1,390        8.33       66.67
       rpob |      1,390        8.33       75.00
        sea |      1,390        8.33       83.33
        seh |      1,390        8.33       91.67
        seu |      1,390        8.33      100.00
------------+-----------------------------------
      Total |     16,680      100.00

. 
. 
. 
. 
. 
. merge 1:1 sample site using discrepancies, update
(note: variable site was str4, now str14 to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                        17,075
        from master                    16,564  (_merge==1)
        from using                        511  (_merge==2)

    matched                               116
        not updated                       116  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. 
. drop if _merge==1
(16,564 observations deleted)

. 
. 
. 
. preserve 

. 
. keep if _merge==3
(511 observations deleted)

. 
. save dis1, replace
file dis1.dta saved

. 
. restore

. 
. 
. 
. drop if _merge==3
(116 observations deleted)

. 
. keep sample site  valuegenefinder valuetypewriter valuezam set type ValueAll agree

. 
. save dis_remain, replace
(note: file dis_remain.dta not found)
file dis_remain.dta saved

. 
. 
. 
. ***************************************************

. 
. * deal with rest

. 
. noi di "single variants"
single variants

. 
. use temp, clear

. 
. drop if strpos(site, "_1") | strpos(site, "_2") | strpos(site, "_3") | strpos(site, "_4") | strpos(site, "_6") 
(47,260 observations deleted)

. 
. merge 1:1 sample site using dis_remain, update
(note: variable site was str13, now str14 to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                       102,761
        from master                   102,555  (_merge==1)
        from using                        206  (_merge==2)

    matched                               305
        not updated                       305  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. drop if _merge==1
(102,555 observations deleted)

. tab site

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
      aac6aph2 |          3        0.59        0.59
    aaddaph4ia |          2        0.39        0.98
    aadeant6ia |         30        5.87        6.85
        ant9ia |          7        1.37        8.22
  apha3aph3iii |          1        0.20        8.41
          arca |          1        0.20        8.61
          arcb |          6        1.17        9.78
          arcc |          6        1.17       10.96
          arcd |          6        1.17       12.13
          blaz |         27        5.28       17.42
         ccrca |         18        3.52       20.94
         ccrcb |         44        8.61       29.55
         ccrcc |         23        4.50       34.05
           cfr |          1        0.20       34.25
           chp |         47        9.20       43.44
          dfra |          4        0.78       44.23
          dfrc |         37        7.24       51.47
          dfrg |          1        0.20       51.66
          ermb |          1        0.20       51.86
          ermc |         12        2.35       54.21
           eta |          1        0.20       54.40
           etb |          2        0.39       54.79
           etd |          2        0.39       55.19
          fusb |          2        0.39       55.58
          fusc |          3        0.59       56.16
     grla/gyra |          3        0.59       56.75
          lnua |          6        1.17       57.93
         lukmf |          6        1.17       59.10
        lukpvf |          2        0.39       59.49
        lukpvs |          4        0.78       60.27
          meca |          3        0.59       60.86
          mphc |          1        0.20       61.06
          msra |          1        0.20       61.25
          mupa |          2        0.39       61.64
          qaca |          2        0.39       62.04
          qacb |         46        9.00       71.04
       qaccsmr |         10        1.96       72.99
           sak |          8        1.57       74.56
          sasx |         15        2.94       77.50
          sat4 |          3        0.59       78.08
           scn |         18        3.52       81.60
           seb |          3        0.59       82.19
           sec |          5        0.98       83.17
           seg |         26        5.09       88.26
           sei |         42        8.22       96.48
           sep |          3        0.59       97.06
          tetk |          8        1.57       98.63
          tetm |          2        0.39       99.02
         tsst1 |          5        0.98      100.00
---------------+-----------------------------------
         Total |        511      100.00

. tab site _merge

               |        _merge
          site | using onl  matched ( |     Total
---------------+----------------------+----------
      aac6aph2 |         0          3 |         3 
    aaddaph4ia |         0          2 |         2 
    aadeant6ia |         0         30 |        30 
        ant9ia |         7          0 |         7 
  apha3aph3iii |         0          1 |         1 
          arca |         0          1 |         1 
          arcb |         0          6 |         6 
          arcc |         0          6 |         6 
          arcd |         0          6 |         6 
          blaz |         0         27 |        27 
         ccrca |        18          0 |        18 
         ccrcb |        44          0 |        44 
         ccrcc |        23          0 |        23 
           cfr |         0          1 |         1 
           chp |         0         47 |        47 
          dfra |         4          0 |         4 
          dfrc |        37          0 |        37 
          dfrg |         1          0 |         1 
          ermb |         0          1 |         1 
          ermc |         0         12 |        12 
           eta |         0          1 |         1 
           etb |         0          2 |         2 
           etd |         0          2 |         2 
          fusb |         2          0 |         2 
          fusc |         3          0 |         3 
     grla/gyra |         3          0 |         3 
          lnua |         6          0 |         6 
         lukmf |         0          6 |         6 
        lukpvf |         0          2 |         2 
        lukpvs |         0          4 |         4 
          meca |         0          3 |         3 
          mphc |         0          1 |         1 
          msra |         0          1 |         1 
          mupa |         0          2 |         2 
          qaca |         2          0 |         2 
          qacb |        46          0 |        46 
       qaccsmr |        10          0 |        10 
           sak |         0          8 |         8 
          sasx |         0         15 |        15 
          sat4 |         0          3 |         3 
           scn |         0         18 |        18 
           seb |         0          3 |         3 
           sec |         0          5 |         5 
           seg |         0         26 |        26 
           sei |         0         42 |        42 
           sep |         0          3 |         3 
          tetk |         0          8 |         8 
          tetm |         0          2 |         2 
         tsst1 |         0          5 |         5 
---------------+----------------------+----------
         Total |       206        305 |       511 


. drop if _merge==3
(305 observations deleted)

. 
. drop if _merge==1
(0 observations deleted)

. 
. 
. 
. tab site

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
        ant9ia |          7        3.40        3.40
         ccrca |         18        8.74       12.14
         ccrcb |         44       21.36       33.50
         ccrcc |         23       11.17       44.66
          dfra |          4        1.94       46.60
          dfrc |         37       17.96       64.56
          dfrg |          1        0.49       65.05
          fusb |          2        0.97       66.02
          fusc |          3        1.46       67.48
     grla/gyra |          3        1.46       68.93
          lnua |          6        2.91       71.84
          qaca |          2        0.97       72.82
          qacb |         46       22.33       95.15
       qaccsmr |         10        4.85      100.00
---------------+-----------------------------------
         Total |        206      100.00

. 
. use temp, clear

. 
. keep if strpos(site, "_1") | strpos(site, "_2") | strpos(site, "_3") | strpos(site, "_4") | strpos(site, "_6") 
(102,860 observations deleted)

. 
. split site, parse(_)
variables created as string: 
site1  site2

. 
. drop site

. 
. destring site2, replace
site2: all characters numeric; replaced as byte

. 
. replace site2 = 10 + site2 if site1=="grla"
(4,170 real changes made)

. 
. rename site1 = "grla/gyra" if inlist(site1, "grla", "gyra")
syntax error
    Syntax is
        rename  oldname    newname   [, renumber[(#)] addnumber[(#)] sort ...]
        rename (oldnames) (newnames) [, renumber[(#)] addnumber[(#)] sort ...]
        rename  oldnames              , {upper|lower|proper}
r(198);

. 
. rename site2 sitenum

. 
. rename site1 site

. 
. reshape wide value, i(sample method site) j(sitenum)
(note: j = 1 2 3 4 6 11 12 13)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                    47260   ->   16680
Number of variables                   6   ->      12
j variable (8 values)           sitenum   ->   (dropped)
xij variables:
                                  value   ->   value1 value2 ... value13
-----------------------------------------------------------------------------

. 
. noi tab site

       site |      Freq.     Percent        Cum.
------------+-----------------------------------
       ccra |      1,390        8.33        8.33
       ccrb |      1,390        8.33       16.67
       dfrb |      1,390        8.33       25.00
       erma |      1,390        8.33       33.33
       fusa |      1,390        8.33       41.67
       grla |      1,390        8.33       50.00
       gyra |      1,390        8.33       58.33
       iles |      1,390        8.33       66.67
       rpob |      1,390        8.33       75.00
        sea |      1,390        8.33       83.33
        seh |      1,390        8.33       91.67
        seu |      1,390        8.33      100.00
------------+-----------------------------------
      Total |     16,680      100.00

. 
. use temp, clear

. 
. keep if strpos(site, "_1") | strpos(site, "_2") | strpos(site, "_3") | strpos(site, "_4") | strpos(site, "_6") 
(102,860 observations deleted)

. 
. split site, parse(_)
variables created as string: 
site1  site2

. 
. drop site

. 
. destring site2, replace
site2: all characters numeric; replaced as byte

. 
. replace site2 = 10 + site2 if site1=="grla"
(4,170 real changes made)

. 
. replace site1 = "grla/gyra" if inlist(site1, "grla", "gyra")
variable site1 was str4 now str9
(9,730 real changes made)

. 
. rename site2 sitenum

. 
. rename site1 site

. 
. reshape wide value, i(sample method site) j(sitenum)
(note: j = 1 2 3 4 6 11 12 13)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                    47260   ->   15290
Number of variables                   6   ->      12
j variable (8 values)           sitenum   ->   (dropped)
xij variables:
                                  value   ->   value1 value2 ... value13
-----------------------------------------------------------------------------

. 
. noi tab site

       site |      Freq.     Percent        Cum.
------------+-----------------------------------
       ccra |      1,390        9.09        9.09
       ccrb |      1,390        9.09       18.18
       dfrb |      1,390        9.09       27.27
       erma |      1,390        9.09       36.36
       fusa |      1,390        9.09       45.45
  grla/gyra |      1,390        9.09       54.55
       iles |      1,390        9.09       63.64
       rpob |      1,390        9.09       72.73
        sea |      1,390        9.09       81.82
        seh |      1,390        9.09       90.91
        seu |      1,390        9.09      100.00
------------+-----------------------------------
      Total |     15,290      100.00

. 
. use temp, clear

. 
. keep if strpos(site, "_1") | strpos(site, "_2") | strpos(site, "_3") | strpos(site, "_4") | strpos(site, "_6") 
(102,860 observations deleted)

. 
. split site, parse(_)
variables created as string: 
site1  site2

. 
. drop site

. 
. destring site2, replace
site2: all characters numeric; replaced as byte

. 
. replace site2 = 10 + site2 if site1=="grla"
(4,170 real changes made)

. 
. replace site1 = "grla/gyra" if inlist(site1, "grla", "gyra")
variable site1 was str4 now str9
(9,730 real changes made)

. 
. rename site2 sitenum

. 
. rename site1 site

. 
. reshape wide value, i(sample method site) j(sitenum)
(note: j = 1 2 3 4 6 11 12 13)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                    47260   ->   15290
Number of variables                   6   ->      12
j variable (8 values)           sitenum   ->   (dropped)
xij variables:
                                  value   ->   value1 value2 ... value13
-----------------------------------------------------------------------------

. 
. noi tab site

       site |      Freq.     Percent        Cum.
------------+-----------------------------------
       ccra |      1,390        9.09        9.09
       ccrb |      1,390        9.09       18.18
       dfrb |      1,390        9.09       27.27
       erma |      1,390        9.09       36.36
       fusa |      1,390        9.09       45.45
  grla/gyra |      1,390        9.09       54.55
       iles |      1,390        9.09       63.64
       rpob |      1,390        9.09       72.73
        sea |      1,390        9.09       81.82
        seh |      1,390        9.09       90.91
        seu |      1,390        9.09      100.00
------------+-----------------------------------
      Total |     15,290      100.00

. 
. 
. 
. 
. 
. merge 1:1 sample site using discrepancies, update
(note: variable site was str9, now str14 to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                        15,679
        from master                    15,171  (_merge==1)
        from using                        508  (_merge==2)

    matched                               119
        not updated                       119  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. 
. drop if _merge==1
(15,171 observations deleted)

. 
. 
. 
. preserve 

. 
. keep if _merge==3
(508 observations deleted)

. 
. save dis1, replace
file dis1.dta saved

. 
. restore

. 
. 
. 
. drop if _merge==3
(119 observations deleted)

. 
. keep sample site  valuegenefinder valuetypewriter valuezam set type ValueAll agree

. 
. save dis_remain, replace
file dis_remain.dta saved

. 
. 
. 
. ***************************************************

. 
. * deal with rest

. 
. noi di "single variants"
single variants

. 
. use temp, clear

. 
. drop if strpos(site, "_1") | strpos(site, "_2") | strpos(site, "_3") | strpos(site, "_4") | strpos(site, "_6") 
(47,260 observations deleted)

. 
. merge 1:1 sample site using dis_remain, update
(note: variable site was str13, now str14 to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                       102,758
        from master                   102,555  (_merge==1)
        from using                        203  (_merge==2)

    matched                               305
        not updated                       305  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. 
. preserve 

. 
. keep if _merge==3
(102,758 observations deleted)

. 
. save dis2, replace
(note: file dis2.dta not found)
file dis2.dta saved

. 
. restore

. 
. 
. 
. drop if _merge==3
(305 observations deleted)

. 
. drop if _merge==1
(102,555 observations deleted)

. 
. 
. 
. tab site

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
        ant9ia |          7        3.45        3.45
         ccrca |         18        8.87       12.32
         ccrcb |         44       21.67       33.99
         ccrcc |         23       11.33       45.32
          dfra |          4        1.97       47.29
          dfrc |         37       18.23       65.52
          dfrg |          1        0.49       66.01
          fusb |          2        0.99       67.00
          fusc |          3        1.48       68.47
          lnua |          6        2.96       71.43
          qaca |          2        0.99       72.41
          qacb |         46       22.66       95.07
       qaccsmr |         10        4.93      100.00
---------------+-----------------------------------
         Total |        203      100.00

. 
. use coverage_tw, clear

. 
. 
. 
. 
. 
. * need to clean site name values 

. 
. **** match up things I think are the same but with slightly different names

. 
. replace site = "ant9ib" if site=="ant9_ibspc"
(0 real changes made)

. 
. replace site = "ant9ia" if site=="ant9_iaspc"
(0 real changes made)

. tab site if strpos(site, "ant")

         site |      Freq.     Percent        Cum.
--------------+-----------------------------------
   aadEant6Ia |      1,390       33.33       33.33
   ant9_Iaspc |      1,390       33.33       66.67
   ant9_Ibspc |      1,390       33.33      100.00
--------------+-----------------------------------
        Total |      4,170      100.00

. 
. use coverage_tw, clear

. 
. 
. 
. 
. 
. * need to clean site name values 

. 
. **** match up things I think are the same but with slightly different names

. 
. replace site = lower(site)
(112,590 real changes made)

. 
. replace site = "ant9ib" if site=="ant9_ibspc"
(1,390 real changes made)

. 
. replace site = "ant9ia" if site=="ant9_iaspc"
(1,390 real changes made)

. 
. replace site= "aac6aph2" if strpos(site, "aac")
(0 real changes made)

. 
. 
. 
. replace site = subinstr(site, "acr", "arc",.) if strpos(site, "acr")
(4,170 real changes made)

. 
. replace site = "mlst" if site=="st"
(0 real changes made)

. 
. replace site = "ccrca"  if site == "ccrc_a"
(1,390 real changes made)

. 
. replace site = "ccrcb"  if site == "ccrc_b"
(1,390 real changes made)

. 
. replace site = "ccrcc"  if site == "ccrc_c"
(1,390 real changes made)

. 
. 
. 
. save temp, replace
file temp.dta saved

. 
. 
. 
. **********************************************

. 
. * deal with sites with multiple variants

. 
. noi di "where reported as multiple variants"
where reported as multiple variants

. 
. 
. 
. use temp, clear

. 
. keep if strpos(site, "_1") | strpos(site, "_2") | strpos(site, "_3") | strpos(site, "_4") | strpos(site, "_6") 
(102,860 observations deleted)

. 
. split site, parse(_)
variables created as string: 
site1  site2

. 
. drop site

. 
. destring site2, replace
site2: all characters numeric; replaced as byte

. 
. replace site2 = 10 + site2 if site1=="grla"
(4,170 real changes made)

. 
. replace site1 = "grla/gyra" if inlist(site1, "grla", "gyra")
variable site1 was str4 now str9
(9,730 real changes made)

. 
. rename site2 sitenum

. 
. rename site1 site

. 
. reshape wide value, i(sample method site) j(sitenum)
(note: j = 1 2 3 4 6 11 12 13)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                    47260   ->   15290
Number of variables                   6   ->      12
j variable (8 values)           sitenum   ->   (dropped)
xij variables:
                                  value   ->   value1 value2 ... value13
-----------------------------------------------------------------------------

. 
. noi tab site

       site |      Freq.     Percent        Cum.
------------+-----------------------------------
       ccra |      1,390        9.09        9.09
       ccrb |      1,390        9.09       18.18
       dfrb |      1,390        9.09       27.27
       erma |      1,390        9.09       36.36
       fusa |      1,390        9.09       45.45
  grla/gyra |      1,390        9.09       54.55
       iles |      1,390        9.09       63.64
       rpob |      1,390        9.09       72.73
        sea |      1,390        9.09       81.82
        seh |      1,390        9.09       90.91
        seu |      1,390        9.09      100.00
------------+-----------------------------------
      Total |     15,290      100.00

. 
. merge 1:1 sample site using discrepancies, update
(note: variable site was str9, now str14 to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                        15,679
        from master                    15,171  (_merge==1)
        from using                        508  (_merge==2)

    matched                               119
        not updated                       119  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. 
. drop if _merge==1
(15,171 observations deleted)

. 
. 
. 
. preserve 

. 
. keep if _merge==3
(508 observations deleted)

. 
. save dis1, replace
file dis1.dta saved

. 
. restore

. 
. 
. 
. drop if _merge==3
(119 observations deleted)

. 
. keep sample site  valuegenefinder valuetypewriter valuezam set type ValueAll agree

. 
. save dis_remain, replace
file dis_remain.dta saved

. 
. 
. 
. ***************************************************

. 
. * deal with rest

. 
. noi di "single variants"
single variants

. 
. use temp, clear

. 
. drop if strpos(site, "_1") | strpos(site, "_2") | strpos(site, "_3") | strpos(site, "_4") | strpos(site, "_6") 
(47,260 observations deleted)

. 
. merge 1:1 sample site using dis_remain, update
(note: variable site was str13, now str14 to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                       102,574
        from master                   102,463  (_merge==1)
        from using                        111  (_merge==2)

    matched                               397
        not updated                       397  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. 
. 
. 
. preserve 

. 
. keep if _merge==3
(102,574 observations deleted)

. 
. save dis2, replace
file dis2.dta saved

. 
. restore

. 
. 
. 
. drop if _merge==3
(397 observations deleted)

. 
. drop if _merge==1
(102,463 observations deleted)

. 
. 
. 
. tab site

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
          dfra |          4        3.60        3.60
          dfrc |         37       33.33       36.94
          dfrg |          1        0.90       37.84
          fusb |          2        1.80       39.64
          fusc |          3        2.70       42.34
          lnua |          6        5.41       47.75
          qaca |          2        1.80       49.55
          qacb |         46       41.44       90.99
       qaccsmr |         10        9.01      100.00
---------------+-----------------------------------
         Total |        111      100.00

. use coverage_tw, clear

. tab site if strpos(site, "dfr")

         site |      Freq.     Percent        Cum.
--------------+-----------------------------------
       dfrB_1 |      1,390       14.29       14.29
       dfrB_2 |      1,390       14.29       28.57
        dfr_A |      1,390       14.29       42.86
        dfr_C |      1,390       14.29       57.14
        dfr_D |      1,390       14.29       71.43
        dfr_G |      1,390       14.29       85.71
        dfr_K |      1,390       14.29      100.00
--------------+-----------------------------------
        Total |      9,730      100.00

. tab site if strpos(site, "fus")

         site |      Freq.     Percent        Cum.
--------------+-----------------------------------
       fusA_1 |      1,390       20.00       20.00
       fusA_2 |      1,390       20.00       40.00
       fusA_3 |      1,390       20.00       60.00
        fus_B |      1,390       20.00       80.00
        fus_C |      1,390       20.00      100.00
--------------+-----------------------------------
        Total |      6,950      100.00

. tab site if strpos(site, "qac")

         site |      Freq.     Percent        Cum.
--------------+-----------------------------------
        qac_A |      1,390       33.33       33.33
        qac_B |      1,390       33.33       66.67
     qac_Csmr |      1,390       33.33      100.00
--------------+-----------------------------------
        Total |      4,170      100.00

. 
. use coverage_tw, clear

. 
. 
. 
. 
. 
. * need to clean site name values 

. 
. **** match up things I think are the same but with slightly different names

. 
. replace site = lower(site)
(112,590 real changes made)

. 
. replace site = "ant9ib" if site=="ant9_ibspc"
(1,390 real changes made)

. 
. replace site = "ant9ia" if site=="ant9_iaspc"
(1,390 real changes made)

. 
. replace site= "aac6aph2" if strpos(site, "aac")
(0 real changes made)

. 
. 
. 
. replace site = subinstr(site, "acr", "arc",.) if strpos(site, "acr")
(4,170 real changes made)

. 
. replace site = "mlst" if site=="st"
(0 real changes made)

. 
. replace site = "ccrca"  if site == "ccrc_a"
(1,390 real changes made)

. 
. replace site = "ccrcb"  if site == "ccrc_b"
(1,390 real changes made)

. 
. replace site = "ccrcc"  if site == "ccrc_c"
(1,390 real changes made)

. 
. replace site =  subinstr(site, "_", "",.)  if inlist(site, "dfr_a", "dfr_c", "dfr_d", "dfr_g", "dfr_k")
(6,950 real changes made)

. 
. replace site =  subinstr(site, "_", "",.)  if inlist(site, "fus_b", "fus_c")
(2,780 real changes made)

. 
. replace site =  subinstr(site, "_", "",.)  if strpos(site, "qac")
(4,170 real changes made)

. 
. 
. 
. save temp, replace
file temp.dta saved

. 
. 
. 
. **********************************************

. 
. * deal with sites with multiple variants

. 
. noi di "where reported as multiple variants"
where reported as multiple variants

. 
. 
. 
. use temp, clear

. 
. keep if strpos(site, "_1") | strpos(site, "_2") | strpos(site, "_3") | strpos(site, "_4") | strpos(site, "_6") 
(102,860 observations deleted)

. 
. split site, parse(_)
variables created as string: 
site1  site2

. 
. drop site

. 
. destring site2, replace
site2: all characters numeric; replaced as byte

. 
. replace site2 = 10 + site2 if site1=="grla"
(4,170 real changes made)

. 
. replace site1 = "grla/gyra" if inlist(site1, "grla", "gyra")
variable site1 was str4 now str9
(9,730 real changes made)

. 
. rename site2 sitenum

. 
. rename site1 site

. 
. reshape wide value, i(sample method site) j(sitenum)
(note: j = 1 2 3 4 6 11 12 13)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                    47260   ->   15290
Number of variables                   6   ->      12
j variable (8 values)           sitenum   ->   (dropped)
xij variables:
                                  value   ->   value1 value2 ... value13
-----------------------------------------------------------------------------

. 
. noi tab site

       site |      Freq.     Percent        Cum.
------------+-----------------------------------
       ccra |      1,390        9.09        9.09
       ccrb |      1,390        9.09       18.18
       dfrb |      1,390        9.09       27.27
       erma |      1,390        9.09       36.36
       fusa |      1,390        9.09       45.45
  grla/gyra |      1,390        9.09       54.55
       iles |      1,390        9.09       63.64
       rpob |      1,390        9.09       72.73
        sea |      1,390        9.09       81.82
        seh |      1,390        9.09       90.91
        seu |      1,390        9.09      100.00
------------+-----------------------------------
      Total |     15,290      100.00

. 
. 
. 
. 
. 
. merge 1:1 sample site using discrepancies, update
(note: variable site was str9, now str14 to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                        15,679
        from master                    15,171  (_merge==1)
        from using                        508  (_merge==2)

    matched                               119
        not updated                       119  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. 
. drop if _merge==1
(15,171 observations deleted)

. 
. 
. 
. preserve 

. 
. keep if _merge==3
(508 observations deleted)

. 
. save dis1, replace
file dis1.dta saved

. 
. restore

. 
. 
. 
. drop if _merge==3
(119 observations deleted)

. 
. keep sample site  valuegenefinder valuetypewriter valuezam set type ValueAll agree

. 
. save dis_remain, replace
file dis_remain.dta saved

. 
. 
. 
. ***************************************************

. 
. * deal with rest

. 
. noi di "single variants"
single variants

. 
. use temp, clear

. 
. drop if strpos(site, "_1") | strpos(site, "_2") | strpos(site, "_3") | strpos(site, "_4") | strpos(site, "_6") 
(47,260 observations deleted)

. 
. merge 1:1 sample site using dis_remain, update
(note: variable site was str13, now str14 to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                       102,364
        from master                   102,358  (_merge==1)
        from using                          6  (_merge==2)

    matched                               502
        not updated                       502  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. 
. 
. 
. preserve 

. 
. keep if _merge==3
(102,364 observations deleted)

. 
. save dis2, replace
file dis2.dta saved

. 
. restore

. 
. 
. 
. drop if _merge==3
(502 observations deleted)

. 
. drop if _merge==1
(102,358 observations deleted)

. 
. 
. 
. tab site

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
          lnua |          6      100.00      100.00
---------------+-----------------------------------
         Total |          6      100.00

. use coverage_tw, clear

. tab site if strpos(site, "lnu")

         site |      Freq.     Percent        Cum.
--------------+-----------------------------------
        lnu_A |      1,390       50.00       50.00
        lnu_B |      1,390       50.00      100.00
--------------+-----------------------------------
        Total |      2,780      100.00

. 
. use pipeline_clean_all_values_wide, clear

. 
. 
. 
. **************************

. 
. noi di  "Recall order is  Mykrobe Mykrobe Genefinder"
Recall order is  Mykrobe Mykrobe Genefinder

. 
. 
. 
. gen agree  = (ValueA=="AAA"| ValueA=="PPP" )

. 
. drop if agree==1
(115,209 observations deleted)

. 
. noi di "disagreements: sites"
disagreements: sites

. 
. noi tab site, sort

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
           seu |         59        9.41        9.41
           chp |         47        7.50       16.91
          qacb |         46        7.34       24.24
         ccrcb |         44        7.02       31.26
           sei |         42        6.70       37.96
          dfrc |         37        5.90       43.86
          ccrb |         33        5.26       49.12
    aadeant6ia |         30        4.78       53.91
          blaz |         27        4.31       58.21
           seg |         26        4.15       62.36
         ccrcc |         23        3.67       66.03
         ccrca |         18        2.87       68.90
           scn |         18        2.87       71.77
          sasx |         15        2.39       74.16
          ermc |         12        1.91       76.08
       qaccsmr |         10        1.59       77.67
           sak |          8        1.28       78.95
          tetk |          8        1.28       80.22
        ant9ia |          7        1.12       81.34
          arcb |          6        0.96       82.30
          arcc |          6        0.96       83.25
          arcd |          6        0.96       84.21
          erma |          6        0.96       85.17
          lnua |          6        0.96       86.12
         lukmf |          6        0.96       87.08
          ccra |          5        0.80       87.88
           sec |          5        0.80       88.68
         tsst1 |          5        0.80       89.47
          dfra |          4        0.64       90.11
        lukpvs |          4        0.64       90.75
           sea |          4        0.64       91.39
           seh |          4        0.64       92.03
      aac6aph2 |          3        0.48       92.50
          fusc |          3        0.48       92.98
     grla/gyra |          3        0.48       93.46
          meca |          3        0.48       93.94
          sat4 |          3        0.48       94.42
           seb |          3        0.48       94.90
           sep |          3        0.48       95.37
    aaddaph4ia |          2        0.32       95.69
           etb |          2        0.32       96.01
           etd |          2        0.32       96.33
          fusa |          2        0.32       96.65
          fusb |          2        0.32       96.97
        lukpvf |          2        0.32       97.29
          mupa |          2        0.32       97.61
          qaca |          2        0.32       97.93
          rpob |          2        0.32       98.25
          tetm |          2        0.32       98.56
  apha3aph3iii |          1        0.16       98.72
          arca |          1        0.16       98.88
           cfr |          1        0.16       99.04
          dfrb |          1        0.16       99.20
          dfrg |          1        0.16       99.36
          ermb |          1        0.16       99.52
           eta |          1        0.16       99.68
          mphc |          1        0.16       99.84
          msra |          1        0.16      100.00
---------------+-----------------------------------
         Total |        627      100.00

. 
. noi di "disagreements: samples"
disagreements: samples

. 
. noi tab sample, sort

           Sample_id |      Freq.     Percent        Cum.
---------------------+-----------------------------------
    RH11000301-155-1 |         21        3.35        3.35
 H094920323-271-A1-2 |         10        1.59        4.94
    H113640238-143-1 |          9        1.44        6.38
           C00003385 |          8        1.28        7.66
           C00003320 |          7        1.12        8.77
           C00003248 |          6        0.96        9.73
           C00003272 |          6        0.96       10.69
           C00003315 |          6        0.96       11.64
    H122880144-207-1 |          6        0.96       12.60
    H133580080-596-1 |          6        0.96       13.56
           C00003152 |          5        0.80       14.35
           C00003421 |          5        0.80       15.15
           C00003423 |          5        0.80       15.95
           C00003425 |          5        0.80       16.75
    H092520302-216-1 |          5        0.80       17.54
    H110740135-193-2 |          5        0.80       18.34
    H113560219-469-2 |          5        0.80       19.14
H114140657-280-B01-2 |          5        0.80       19.94
    H114160352-129-1 |          5        0.80       20.73
    H121120058-504-1 |          5        0.80       21.53
    H121320081-505-1 |          5        0.80       22.33
 H125000105-229-G0-2 |          5        0.80       23.13
    H125000105-833-2 |          5        0.80       23.92
    H133000236-626-1 |          5        0.80       24.72
    H133020301-629-1 |          5        0.80       25.52
    H133120386-618-1 |          5        0.80       26.32
    H133300151-657-1 |          5        0.80       27.11
    H133720214-574-1 |          5        0.80       27.91
    H133720215-575-1 |          5        0.80       28.71
    H133860126-577-1 |          5        0.80       29.51
    H133960276-571-1 |          5        0.80       30.30
           C00003134 |          4        0.64       30.94
           C00003207 |          4        0.64       31.58
           C00003317 |          4        0.64       32.22
           C00003340 |          4        0.64       32.85
           C00003377 |          4        0.64       33.49
           C00003382 |          4        0.64       34.13
           C00003393 |          4        0.64       34.77
           C00003406 |          4        0.64       35.41
H105040039-373-G12-2 |          4        0.64       36.04
    H114720434-145-1 |          4        0.64       36.68
           C00001086 |          3        0.48       37.16
           C00001446 |          3        0.48       37.64
           C00002656 |          3        0.48       38.12
           C00003140 |          3        0.48       38.60
           C00003229 |          3        0.48       39.07
           C00003301 |          3        0.48       39.55
           C00003318 |          3        0.48       40.03
           C00003321 |          3        0.48       40.51
           C00003337 |          3        0.48       40.99
           C00003341 |          3        0.48       41.47
           C00003347 |          3        0.48       41.95
           C00003411 |          3        0.48       42.42
           C00007064 |          3        0.48       42.90
           C00008638 |          3        0.48       43.38
           C00013217 |          3        0.48       43.86
    H104420250-444-2 |          3        0.48       44.34
    H110820268-195-2 |          3        0.48       44.82
 H120420116-223-A0-2 |          3        0.48       45.30
 H120600058-224-B0-2 |          3        0.48       45.77
    H121320099-507-1 |          3        0.48       46.25
    H121340220-509-1 |          3        0.48       46.73
H122900151-350-H09-2 |          3        0.48       47.21
    H123120336-557-1 |          3        0.48       47.69
H124420844-355-E10-2 |          3        0.48       48.17
    H132540570-419-2 |          3        0.48       48.64
    RH08000028-150-1 |          3        0.48       49.12
RH11000090-289-C02-2 |          3        0.48       49.60
           C00000785 |          2        0.32       49.92
           C00000786 |          2        0.32       50.24
           C00000790 |          2        0.32       50.56
           C00000800 |          2        0.32       50.88
           C00000815 |          2        0.32       51.20
           C00000817 |          2        0.32       51.52
           C00001091 |          2        0.32       51.83
           C00001265 |          2        0.32       52.15
           C00003122 |          2        0.32       52.47
           C00003130 |          2        0.32       52.79
           C00003137 |          2        0.32       53.11
           C00003165 |          2        0.32       53.43
           C00003306 |          2        0.32       53.75
           C00003307 |          2        0.32       54.07
           C00003314 |          2        0.32       54.39
           C00003333 |          2        0.32       54.70
           C00003339 |          2        0.32       55.02
           C00003389 |          2        0.32       55.34
           C00003395 |          2        0.32       55.66
           C00003396 |          2        0.32       55.98
           C00003397 |          2        0.32       56.30
           C00003415 |          2        0.32       56.62
           C00003419 |          2        0.32       56.94
           C00003422 |          2        0.32       57.26
           C00012749 |          2        0.32       57.58
           C00013230 |          2        0.32       57.89
 H101120403-273-C1-2 |          2        0.32       58.21
    H104080090-443-2 |          2        0.32       58.53
    H104600048-190-2 |          2        0.32       58.85
    H105020486-191-2 |          2        0.32       59.17
H105260391-374-H12-2 |          2        0.32       59.49
    H110520238-116-2 |          2        0.32       59.81
    H111640001-197-2 |          2        0.32       60.13
    H113640215-127-2 |          2        0.32       60.45
 H114080202-255-A1-2 |          2        0.32       60.77
    H114120077-144-1 |          2        0.32       61.08
H114680370-339-E08-2 |          2        0.32       61.40
    H120440759-384-2 |          2        0.32       61.72
 H120840083-225-C0-2 |          2        0.32       62.04
    H121000455-532-1 |          2        0.32       62.36
    H121300130-139-1 |          2        0.32       62.68
    H121320082-506-1 |          2        0.32       63.00
H122560310-348-F09-2 |          2        0.32       63.32
    H123100271-555-1 |          2        0.32       63.64
    H123120337-556-1 |          2        0.32       63.96
H123700164-353-C10-2 |          2        0.32       64.27
    H124860349-210-1 |          2        0.32       64.59
    H124940430-401-1 |          2        0.32       64.91
H130240275-357-G10-2 |          2        0.32       65.23
    H132620132-420-2 |          2        0.32       65.55
    H133180046-621-1 |          2        0.32       65.87
    H133180047-622-1 |          2        0.32       66.19
    H133520197-646-1 |          2        0.32       66.51
    H133760113-576-1 |          2        0.32       66.83
    H133920237-578-1 |          2        0.32       67.15
    RH10000448-161-1 |          2        0.32       67.46
 RH11000042-258-D1-2 |          2        0.32       67.78
RH11000044-286-H01-2 |          2        0.32       68.10
RH11000072-288-B02-2 |          2        0.32       68.42
 RH12000505-239-A0-2 |          2        0.32       68.74
    RH12000540-156-1 |          2        0.32       69.06
           C00000784 |          1        0.16       69.22
           C00000787 |          1        0.16       69.38
           C00000788 |          1        0.16       69.54
           C00000789 |          1        0.16       69.70
           C00000799 |          1        0.16       69.86
           C00000806 |          1        0.16       70.02
           C00000808 |          1        0.16       70.18
           C00000809 |          1        0.16       70.33
           C00000816 |          1        0.16       70.49
           C00000818 |          1        0.16       70.65
           C00000820 |          1        0.16       70.81
           C00000828 |          1        0.16       70.97
           C00000829 |          1        0.16       71.13
           C00000831 |          1        0.16       71.29
           C00000857 |          1        0.16       71.45
           C00001079 |          1        0.16       71.61
           C00001080 |          1        0.16       71.77
           C00001100 |          1        0.16       71.93
           C00001102 |          1        0.16       72.09
           C00001226 |          1        0.16       72.25
           C00001240 |          1        0.16       72.41
           C00001387 |          1        0.16       72.57
           C00002620 |          1        0.16       72.73
           C00003084 |          1        0.16       72.89
           C00003092 |          1        0.16       73.05
           C00003093 |          1        0.16       73.21
           C00003111 |          1        0.16       73.37
           C00003115 |          1        0.16       73.52
           C00003121 |          1        0.16       73.68
           C00003125 |          1        0.16       73.84
           C00003144 |          1        0.16       74.00
           C00003155 |          1        0.16       74.16
           C00003158 |          1        0.16       74.32
           C00003164 |          1        0.16       74.48
           C00003176 |          1        0.16       74.64
           C00003195 |          1        0.16       74.80
           C00003221 |          1        0.16       74.96
           C00003223 |          1        0.16       75.12
           C00003224 |          1        0.16       75.28
           C00003240 |          1        0.16       75.44
           C00003242 |          1        0.16       75.60
           C00003249 |          1        0.16       75.76
           C00003250 |          1        0.16       75.92
           C00003252 |          1        0.16       76.08
           C00003253 |          1        0.16       76.24
           C00003254 |          1        0.16       76.40
           C00003259 |          1        0.16       76.56
           C00003260 |          1        0.16       76.71
           C00003270 |          1        0.16       76.87
           C00003277 |          1        0.16       77.03
           C00003278 |          1        0.16       77.19
           C00003290 |          1        0.16       77.35
           C00003292 |          1        0.16       77.51
           C00003302 |          1        0.16       77.67
           C00003303 |          1        0.16       77.83
           C00003319 |          1        0.16       77.99
           C00003332 |          1        0.16       78.15
           C00003348 |          1        0.16       78.31
           C00003351 |          1        0.16       78.47
           C00003352 |          1        0.16       78.63
           C00003354 |          1        0.16       78.79
           C00003355 |          1        0.16       78.95
           C00003362 |          1        0.16       79.11
           C00003379 |          1        0.16       79.27
           C00003381 |          1        0.16       79.43
           C00003410 |          1        0.16       79.59
           C00003414 |          1        0.16       79.74
           C00007083 |          1        0.16       79.90
           C00007096 |          1        0.16       80.06
           C00008625 |          1        0.16       80.22
           C00008949 |          1        0.16       80.38
           C00008960 |          1        0.16       80.54
           C00012738 |          1        0.16       80.70
           C00012775 |          1        0.16       80.86
           C00012776 |          1        0.16       81.02
           C00012780 |          1        0.16       81.18
           C00012784 |          1        0.16       81.34
           C00013162 |          1        0.16       81.50
           C00013165 |          1        0.16       81.66
           C00013195 |          1        0.16       81.82
           C00013213 |          1        0.16       81.98
           C00013221 |          1        0.16       82.14
           C00013224 |          1        0.16       82.30
           C00013231 |          1        0.16       82.46
           C00013235 |          1        0.16       82.62
           C00013241 |          1        0.16       82.78
           C00013248 |          1        0.16       82.93
           C00013318 |          1        0.16       83.09
           C00013326 |          1        0.16       83.25
           C00013335 |          1        0.16       83.41
           C00013362 |          1        0.16       83.57
           C00013364 |          1        0.16       83.73
           C00013367 |          1        0.16       83.89
           C00013393 |          1        0.16       84.05
           C00013401 |          1        0.16       84.21
           C00013406 |          1        0.16       84.37
    H034660053-158-1 |          1        0.16       84.53
H065060092-367-A12-2 |          1        0.16       84.69
 H065120079-263-A1-2 |          1        0.16       84.85
 H074780626-266-D1-2 |          1        0.16       85.01
    H080980484-164-1 |          1        0.16       85.17
 H082600495-244-F0-2 |          1        0.16       85.33
 H091100226-245-G0-2 |          1        0.16       85.49
 H093620523-269-G1-2 |          1        0.16       85.65
    H100140197-167-2 |          1        0.16       85.81
    H100200151-169-2 |          1        0.16       85.96
    H100800158-172-2 |          1        0.16       86.12
    H101020134-173-2 |          1        0.16       86.28
    H101520278-175-2 |          1        0.16       86.44
    H101580214-176-2 |          1        0.16       86.60
 H101740329-274-D1-2 |          1        0.16       86.76
 H101740629-240-B0-2 |          1        0.16       86.92
 H102820334-277-G1-2 |          1        0.16       87.08
 H102840444-246-H0-2 |          1        0.16       87.24
    H103060332-756-2 |          1        0.16       87.40
    H103220288-184-2 |          1        0.16       87.56
 H103360314-241-C0-2 |          1        0.16       87.72
    H103440108-442-2 |          1        0.16       87.88
H103560109-371-E12-2 |          1        0.16       88.04
 H104340410-220-F0-2 |          1        0.16       88.20
    H104420050-188-2 |          1        0.16       88.36
 H105020135-247-A0-2 |          1        0.16       88.52
 H105140339-248-B0-2 |          1        0.16       88.68
    H111600186-455-2 |          1        0.16       88.84
    H111740190-456-2 |          1        0.16       89.00
    H111940137-460-2 |          1        0.16       89.15
H111960080-332-F07-2 |          1        0.16       89.31
    H112060137-461-2 |          1        0.16       89.47
    H112540036-142-1 |          1        0.16       89.63
    H112660153-200-1 |          1        0.16       89.79
    H113020155-466-2 |          1        0.16       89.95
    H113140144-468-2 |          1        0.16       90.11
H113420072-336-B08-2 |          1        0.16       90.27
    H113880160-476-1 |          1        0.16       90.43
    H113920345-478-1 |          1        0.16       90.59
    H114340058-470-2 |          1        0.16       90.75
    H114700366-481-1 |          1        0.16       90.91
    H114720432-482-1 |          1        0.16       91.07
    H120220271-381-2 |          1        0.16       91.23
    H120680309-385-2 |          1        0.16       91.39
H120860096-346-D09-2 |          1        0.16       91.55
    H121060252-533-1 |          1        0.16       91.71
    H121100042-534-1 |          1        0.16       91.87
    H121120051-535-1 |          1        0.16       92.03
    H121800040-510-1 |          1        0.16       92.19
    H122660093-513-1 |          1        0.16       92.34
    H122840129-206-1 |          1        0.16       92.50
    H122960028-515-1 |          1        0.16       92.66
    H122960030-517-1 |          1        0.16       92.82
    H123020176-551-1 |          1        0.16       92.98
    H123020177-552-1 |          1        0.16       93.14
    H123020178-553-1 |          1        0.16       93.30
    H123100270-554-1 |          1        0.16       93.46
    H123120338-558-1 |          1        0.16       93.62
    H123220266-561-1 |          1        0.16       93.78
    H124060094-134-1 |          1        0.16       93.94
 H124420845-227-E0-2 |          1        0.16       94.10
    H124720623-209-1 |          1        0.16       94.26
H125280642-356-F10-2 |          1        0.16       94.42
    H125280642-841-2 |          1        0.16       94.58
    H130660215-405-2 |          1        0.16       94.74
    H131660094-412-2 |          1        0.16       94.90
    H131800554-414-2 |          1        0.16       95.06
    H131800573-415-2 |          1        0.16       95.22
    H132280003-416-2 |          1        0.16       95.37
    H132920375-623-1 |          1        0.16       95.53
    H133060079-613-1 |          1        0.16       95.69
    H133100176-615-1 |          1        0.16       95.85
    H133200270-608-1 |          1        0.16       96.01
    H133240054-609-1 |          1        0.16       96.17
    H133560609-593-1 |          1        0.16       96.33
    H133580086-601-1 |          1        0.16       96.49
    H133580087-582-1 |          1        0.16       96.65
    H133900439-581-1 |          1        0.16       96.81
    H133960268-568-1 |          1        0.16       96.97
    H133960269-569-1 |          1        0.16       97.13
 RH07000425-233-C0-2 |          1        0.16       97.29
 RH10000375-235-E0-2 |          1        0.16       97.45
 RH10000389-236-F0-2 |          1        0.16       97.61
RH11000029-284-F01-2 |          1        0.16       97.77
RH11000133-292-F02-2 |          1        0.16       97.93
RH11000142-293-G02-2 |          1        0.16       98.09
RH11000146-294-H02-2 |          1        0.16       98.25
RH12000046-298-D03-2 |          1        0.16       98.41
RH12000340-301-G03-2 |          1        0.16       98.56
RH12000346-307-E04-2 |          1        0.16       98.72
    RH12000366-426-2 |          1        0.16       98.88
    RH12000370-430-2 |          1        0.16       99.04
    RH12000374-434-2 |          1        0.16       99.20
    RH12000375-435-2 |          1        0.16       99.36
    RH12000376-436-2 |          1        0.16       99.52
    RH12000379-439-2 |          1        0.16       99.68
    RH12000381-441-2 |          1        0.16       99.84
 RH12000503-261-G1-2 |          1        0.16      100.00
---------------------+-----------------------------------
               Total |        627      100.00

. 
. noi di "disagreements: set"
disagreements: set

. 
. noi tab set, sort

        set |      Freq.     Percent        Cum.
------------+-----------------------------------
 Collindale |        349       55.66       55.66
  Oxford501 |        233       37.16       92.82
  Oxford491 |         45        7.18      100.00
------------+-----------------------------------
      Total |        627      100.00

. 
. noi tab site set

               |               set
          site | Collind..  Oxford491  Oxford501 |     Total
---------------+---------------------------------+----------
      aac6aph2 |         3          0          0 |         3 
    aaddaph4ia |         0          0          2 |         2 
    aadeant6ia |        25          1          4 |        30 
        ant9ia |         4          0          3 |         7 
  apha3aph3iii |         0          0          1 |         1 
          arca |         1          0          0 |         1 
          arcb |         3          1          2 |         6 
          arcc |         3          1          2 |         6 
          arcd |         3          1          2 |         6 
          blaz |        19          4          4 |        27 
          ccra |         3          0          2 |         5 
          ccrb |         4          7         22 |        33 
         ccrca |        16          1          1 |        18 
         ccrcb |        39          2          3 |        44 
         ccrcc |        21          0          2 |        23 
           cfr |         1          0          0 |         1 
           chp |         3          4         40 |        47 
          dfra |         4          0          0 |         4 
          dfrb |         0          1          0 |         1 
          dfrc |        37          0          0 |        37 
          dfrg |         1          0          0 |         1 
          erma |         3          0          3 |         6 
          ermb |         0          0          1 |         1 
          ermc |         2          4          6 |        12 
           eta |         1          0          0 |         1 
           etb |         1          1          0 |         2 
           etd |         1          0          1 |         2 
          fusa |         0          0          2 |         2 
          fusb |         1          0          1 |         2 
          fusc |         1          0          2 |         3 
     grla/gyra |         2          0          1 |         3 
          lnua |         6          0          0 |         6 
         lukmf |         6          0          0 |         6 
        lukpvf |         2          0          0 |         2 
        lukpvs |         3          0          1 |         4 
          meca |         3          0          0 |         3 
          mphc |         1          0          0 |         1 
          msra |         0          0          1 |         1 
          mupa |         2          0          0 |         2 
          qaca |         2          0          0 |         2 
          qacb |        38          8          0 |        46 
       qaccsmr |         2          2          6 |        10 
          rpob |         1          0          1 |         2 
           sak |         4          0          4 |         8 
          sasx |        15          0          0 |        15 
          sat4 |         1          0          2 |         3 
           scn |         3          0         15 |        18 
           sea |         2          0          2 |         4 
           seb |         1          1          1 |         3 
           sec |         2          0          3 |         5 
           seg |         2          2         22 |        26 
           seh |         2          0          2 |         4 
           sei |        14          1         27 |        42 
           sep |         0          1          2 |         3 
           seu |        28          2         29 |        59 
          tetk |         5          0          3 |         8 
          tetm |         0          0          2 |         2 
         tsst1 |         2          0          3 |         5 
---------------+---------------------------------+----------
         Total |       349         45        233 |       627 


. 
. 
. 
. save discrepancies, replace
file discrepancies.dta saved

. 
. local samplesites = _N

. 
. noi di _N
627

. 
. 
. 
. **********************************

. 
. * hypothesis: this is due to borderline coverage

. 
. 
. 
. use coverage_tw, clear

. 
. 
. 
. 
. 
. * need to clean site name values 

. 
. **** match up things I think are the same but with slightly different names

. 
. replace site = lower(site)
(112,590 real changes made)

. 
. replace site = "ant9ib" if site=="ant9_ibspc"
(1,390 real changes made)

. 
. replace site = "ant9ia" if site=="ant9_iaspc"
(1,390 real changes made)

. 
. replace site= "aac6aph2" if strpos(site, "aac")
(0 real changes made)

. 
. 
. 
. replace site = subinstr(site, "acr", "arc",.) if strpos(site, "acr")
(4,170 real changes made)

. 
. replace site = "mlst" if site=="st"
(0 real changes made)

. 
. replace site = "ccrca"  if site == "ccrc_a"
(1,390 real changes made)

. 
. replace site = "ccrcb"  if site == "ccrc_b"
(1,390 real changes made)

. 
. replace site = "ccrcc"  if site == "ccrc_c"
(1,390 real changes made)

. 
. replace site =  subinstr(site, "_", "",.)  if inlist(site, "dfr_a", "dfr_c", "dfr_d", "dfr_g", "dfr_k")
(6,950 real changes made)

. 
. replace site =  subinstr(site, "_", "",.)  if inlist(site, "fus_b", "fus_c")
(2,780 real changes made)

. 
. replace site =  subinstr(site, "_", "",.)  if strpos(site, "qac")
(4,170 real changes made)

. 
. replace site =  subinstr(site, "_", "",.)  if inlist(site, "lnu_a", "lnu_b")
(2,780 real changes made)

. 
. 
. 
. save temp, replace
file temp.dta saved

. 
. 
. 
. **********************************************

. 
. * deal with sites with multiple variants

. 
. noi di "where reported as multiple variants"
where reported as multiple variants

. 
. 
. 
. use temp, clear

. 
. keep if strpos(site, "_1") | strpos(site, "_2") | strpos(site, "_3") | strpos(site, "_4") | strpos(site, "_6") 
(102,860 observations deleted)

. 
. split site, parse(_)
variables created as string: 
site1  site2

. 
. drop site

. 
. destring site2, replace
site2: all characters numeric; replaced as byte

. 
. replace site2 = 10 + site2 if site1=="grla"
(4,170 real changes made)

. 
. replace site1 = "grla/gyra" if inlist(site1, "grla", "gyra")
variable site1 was str4 now str9
(9,730 real changes made)

. 
. rename site2 sitenum

. 
. rename site1 site

. 
. reshape wide value, i(sample method site) j(sitenum)
(note: j = 1 2 3 4 6 11 12 13)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                    47260   ->   15290
Number of variables                   6   ->      12
j variable (8 values)           sitenum   ->   (dropped)
xij variables:
                                  value   ->   value1 value2 ... value13
-----------------------------------------------------------------------------

. 
. noi tab site

       site |      Freq.     Percent        Cum.
------------+-----------------------------------
       ccra |      1,390        9.09        9.09
       ccrb |      1,390        9.09       18.18
       dfrb |      1,390        9.09       27.27
       erma |      1,390        9.09       36.36
       fusa |      1,390        9.09       45.45
  grla/gyra |      1,390        9.09       54.55
       iles |      1,390        9.09       63.64
       rpob |      1,390        9.09       72.73
        sea |      1,390        9.09       81.82
        seh |      1,390        9.09       90.91
        seu |      1,390        9.09      100.00
------------+-----------------------------------
      Total |     15,290      100.00

. 
. 
. 
. 
. 
. merge 1:1 sample site using discrepancies, update
(note: variable site was str9, now str14 to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                        15,679
        from master                    15,171  (_merge==1)
        from using                        508  (_merge==2)

    matched                               119
        not updated                       119  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. 
. drop if _merge==1
(15,171 observations deleted)

. 
. 
. 
. preserve 

. 
. keep if _merge==3
(508 observations deleted)

. 
. save dis1, replace
file dis1.dta saved

. 
. restore

. 
. 
. 
. drop if _merge==3
(119 observations deleted)

. 
. keep sample site  valuegenefinder valuetypewriter valuezam set type ValueAll agree

. 
. save dis_remain, replace
file dis_remain.dta saved

. 
. 
. 
. ***************************************************

. 
. * deal with rest

. 
. noi di "single variants"
single variants

. 
. use temp, clear

. 
. drop if strpos(site, "_1") | strpos(site, "_2") | strpos(site, "_3") | strpos(site, "_4") | strpos(site, "_6") 
(47,260 observations deleted)

. 
. merge 1:1 sample site using dis_remain, update
(note: variable site was str13, now str14 to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                       102,352
        from master                   102,352  (_merge==1)
        from using                          0  (_merge==2)

    matched                               508
        not updated                       508  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. 
. drop if _merge==1
(102,352 observations deleted)

. 
. assert _merge==2
508 contradictions in 508 observations
assertion is false
r(9);

. 
. drop _merge

. 
. 
. 
. append using dis1, force
(label _merge already defined)

. noi di "single variants"
single variants

. 
. use temp, clear

. 
. drop if strpos(site, "_1") | strpos(site, "_2") | strpos(site, "_3") | strpos(site, "_4") | strpos(site, "_6") 
(47,260 observations deleted)

. 
. merge 1:1 sample site using dis_remain, update
(note: variable site was str13, now str14 to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                       102,352
        from master                   102,352  (_merge==1)
        from using                          0  (_merge==2)

    matched                               508
        not updated                       508  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. 
. drop if _merge==1
(102,352 observations deleted)

. 
. assert _merge==3

. 
. drop _merge

. 
. 
. 
. save dis2, replace
file dis2.dta saved

. 
. 
. 
. ***************************************************************************

. 
. * Analysis: start with single sites as easier

. 
. 
. 
. use dis2, replace

. 
. by site: summ value
not sorted
r(5);

. use dis2, replace

. 
. bysort site: summ value

----------------------------------------------------------------------------------------------------------------------------------
-> site = aac6aph2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       value |          3     39.9537    34.70676          0   62.63889

----------------------------------------------------------------------------------------------------------------------------------
-> site = aaddaph4ia

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       value |          2           0           0          0          0

----------------------------------------------------------------------------------------------------------------------------------
-> site = aadeant6ia

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       value |         30     69.1797    13.48555          0   79.76517

----------------------------------------------------------------------------------------------------------------------------------
-> site = ant9ia

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       value |          7    26.12027    44.62898          0   93.74202

----------------------------------------------------------------------------------------------------------------------------------
-> site = apha3aph3iii

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       value |          1    30.06289           .   30.06289   30.06289

----------------------------------------------------------------------------------------------------------------------------------
-> site = arca

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       value |          1    74.77724           .   74.77724   74.77724

----------------------------------------------------------------------------------------------------------------------------------
-> site = arcb

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       value |          6    99.86653    .1033829    99.7998        100

----------------------------------------------------------------------------------------------------------------------------------
-> site = arcc

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       value |          6    99.83871     .131693   99.67742        100

----------------------------------------------------------------------------------------------------------------------------------
-> site = arcd

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       value |          6     99.9414    .0529376   99.85935        100

----------------------------------------------------------------------------------------------------------------------------------
-> site = blaz

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       value |         27    14.32887    31.13959          0   94.56265

----------------------------------------------------------------------------------------------------------------------------------
-> site = ccrca

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       value |         18    94.79244    7.246351   67.82137        100

----------------------------------------------------------------------------------------------------------------------------------
-> site = ccrcb

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       value |         44     92.5872    14.95178          0   98.37994

----------------------------------------------------------------------------------------------------------------------------------
-> site = ccrcc

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       value |         23    81.55817    30.98466          0        100

----------------------------------------------------------------------------------------------------------------------------------
-> site = cfr

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       value |          1     60.7619           .    60.7619    60.7619

----------------------------------------------------------------------------------------------------------------------------------
-> site = chp

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       value |         47    79.89611    21.14609          0   94.98911

----------------------------------------------------------------------------------------------------------------------------------
-> site = dfra

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       value |          4    84.89909    12.65958   74.43537        100

----------------------------------------------------------------------------------------------------------------------------------
-> site = dfrc

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       value |         37    97.47323    5.581475   75.03531   99.09475

----------------------------------------------------------------------------------------------------------------------------------
-> site = dfrg

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       value |          1           0           .          0          0

----------------------------------------------------------------------------------------------------------------------------------
-> site = ermb

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       value |          1           0           .          0          0

----------------------------------------------------------------------------------------------------------------------------------
-> site = ermc

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       value |         12    14.79592    22.91436          0   58.77551

----------------------------------------------------------------------------------------------------------------------------------
-> site = eta

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       value |          1    38.79004           .   38.79004   38.79004

----------------------------------------------------------------------------------------------------------------------------------
-> site = etb

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       value |          2    44.76839    63.31207          0   89.53678

----------------------------------------------------------------------------------------------------------------------------------
-> site = etd

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       value |          2    46.51308    65.77942          0   93.02615

----------------------------------------------------------------------------------------------------------------------------------
-> site = fusb

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       value |          2    33.25434    47.02874          0   66.50869

----------------------------------------------------------------------------------------------------------------------------------
-> site = fusc

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       value |          3    64.82172    12.44745   52.29358   77.18688

----------------------------------------------------------------------------------------------------------------------------------
-> site = lnua

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       value |          6    93.14129    .1680034   92.79835   93.20988

----------------------------------------------------------------------------------------------------------------------------------
-> site = lukmf

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       value |          6     99.8796    .2949162   99.27761        100

----------------------------------------------------------------------------------------------------------------------------------
-> site = lukpvf

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       value |          2    80.01466    1.682746   78.82478   81.20454

----------------------------------------------------------------------------------------------------------------------------------
-> site = lukpvs

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       value |          4    77.26403    10.11696   72.13265   92.43876

----------------------------------------------------------------------------------------------------------------------------------
-> site = meca

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       value |          3    45.28623    27.50389   13.90135   65.18649

----------------------------------------------------------------------------------------------------------------------------------
-> site = mphc

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       value |          1           0           .          0          0

----------------------------------------------------------------------------------------------------------------------------------
-> site = msra

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       value |          1    68.77982           .   68.77982   68.77982

----------------------------------------------------------------------------------------------------------------------------------
-> site = mupa

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       value |          2    66.28536    38.71359   38.91072   93.66001

----------------------------------------------------------------------------------------------------------------------------------
-> site = qaca

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       value |          2    44.26119    62.59478          0   88.52239

----------------------------------------------------------------------------------------------------------------------------------
-> site = qacb

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       value |         46    96.86337    14.70629          0   99.54693

----------------------------------------------------------------------------------------------------------------------------------
-> site = qaccsmr

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       value |         10    37.19136    44.92299          0   99.69136

----------------------------------------------------------------------------------------------------------------------------------
-> site = sak

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       value |          8    48.94557    44.64576          0   93.15589

----------------------------------------------------------------------------------------------------------------------------------
-> site = sasx

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       value |         15    93.03118    25.75889          0        100

----------------------------------------------------------------------------------------------------------------------------------
-> site = sat4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       value |          3    46.96133    43.95227          0   87.10866

----------------------------------------------------------------------------------------------------------------------------------
-> site = scn

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       value |         18    65.06219    37.98375          0   93.73219

----------------------------------------------------------------------------------------------------------------------------------
-> site = seb

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       value |          3    29.62963    51.32002          0   88.88889

----------------------------------------------------------------------------------------------------------------------------------
-> site = sec

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       value |          5    65.82488    37.97013          0   94.20989

----------------------------------------------------------------------------------------------------------------------------------
-> site = seg

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       value |         26    50.91951    36.01014          0   94.79136

----------------------------------------------------------------------------------------------------------------------------------
-> site = sei

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       value |         42    82.11845    21.51992          0   96.57064

----------------------------------------------------------------------------------------------------------------------------------
-> site = sep

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       value |          3    63.23638     54.9822          0   99.74457

----------------------------------------------------------------------------------------------------------------------------------
-> site = tetk

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       value |          8    28.68137    41.47988          0   91.88406

----------------------------------------------------------------------------------------------------------------------------------
-> site = tetm

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       value |          2    59.42554      27.571   39.92989   78.92118

----------------------------------------------------------------------------------------------------------------------------------
-> site = tsst1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       value |          5    63.86051    37.35053          0   93.99199


. tab site

          site |      Freq.     Percent        Cum.
---------------+-----------------------------------
      aac6aph2 |          3        0.59        0.59
    aaddaph4ia |          2        0.39        0.98
    aadeant6ia |         30        5.91        6.89
        ant9ia |          7        1.38        8.27
  apha3aph3iii |          1        0.20        8.46
          arca |          1        0.20        8.66
          arcb |          6        1.18        9.84
          arcc |          6        1.18       11.02
          arcd |          6        1.18       12.20
          blaz |         27        5.31       17.52
         ccrca |         18        3.54       21.06
         ccrcb |         44        8.66       29.72
         ccrcc |         23        4.53       34.25
           cfr |          1        0.20       34.45
           chp |         47        9.25       43.70
          dfra |          4        0.79       44.49
          dfrc |         37        7.28       51.77
          dfrg |          1        0.20       51.97
          ermb |          1        0.20       52.17
          ermc |         12        2.36       54.53
           eta |          1        0.20       54.72
           etb |          2        0.39       55.12
           etd |          2        0.39       55.51
          fusb |          2        0.39       55.91
          fusc |          3        0.59       56.50
          lnua |          6        1.18       57.68
         lukmf |          6        1.18       58.86
        lukpvf |          2        0.39       59.25
        lukpvs |          4        0.79       60.04
          meca |          3        0.59       60.63
          mphc |          1        0.20       60.83
          msra |          1        0.20       61.02
          mupa |          2        0.39       61.42
          qaca |          2        0.39       61.81
          qacb |         46        9.06       70.87
       qaccsmr |         10        1.97       72.83
           sak |          8        1.57       74.41
          sasx |         15        2.95       77.36
          sat4 |          3        0.59       77.95
           scn |         18        3.54       81.50
           seb |          3        0.59       82.09
           sec |          5        0.98       83.07
           seg |         26        5.12       88.19
           sei |         42        8.27       96.46
           sep |          3        0.59       97.05
          tetk |          8        1.57       98.62
          tetm |          2        0.39       99.02
         tsst1 |          5        0.98      100.00
---------------+-----------------------------------
         Total |        508      100.00

. * create borderline value flag: <75 = clear no, 75-85 = borderline, 85+ = clear yes 

. 
. gen borderline = "no" 

. 
. replace borderline = "borderline" if value> 75 | (site=="blaz" & value> 25)
variable borderline was str2 now str10
(337 real changes made)

. 
. replace borderline= "yes" if value >85 | (site=="blaz" & value > 35)
(307 real changes made)

. tab borderline

 borderline |      Freq.     Percent        Cum.
------------+-----------------------------------
 borderline |         30        5.91        5.91
         no |        171       33.66       39.57
        yes |        307       60.43      100.00
------------+-----------------------------------
      Total |        508      100.00

. tab site borderline

               |            borderline
          site | borderl..         no        yes |     Total
---------------+---------------------------------+----------
      aac6aph2 |         0          3          0 |         3 
    aaddaph4ia |         0          2          0 |         2 
    aadeant6ia |         4         26          0 |        30 
        ant9ia |         0          5          2 |         7 
  apha3aph3iii |         0          1          0 |         1 
          arca |         0          1          0 |         1 
          arcb |         0          0          6 |         6 
          arcc |         0          0          6 |         6 
          arcd |         0          0          6 |         6 
          blaz |         1         22          4 |        27 
         ccrca |         0          1         17 |        18 
         ccrcb |         0          2         42 |        44 
         ccrcc |         0          3         20 |        23 
           cfr |         0          1          0 |         1 
           chp |         6         10         31 |        47 
          dfra |         0          2          2 |         4 
          dfrc |         2          0         35 |        37 
          dfrg |         0          1          0 |         1 
          ermb |         0          1          0 |         1 
          ermc |         0         12          0 |        12 
           eta |         0          1          0 |         1 
           etb |         0          1          1 |         2 
           etd |         0          1          1 |         2 
          fusb |         0          2          0 |         2 
          fusc |         1          2          0 |         3 
          lnua |         0          0          6 |         6 
         lukmf |         0          0          6 |         6 
        lukpvf |         2          0          0 |         2 
        lukpvs |         0          3          1 |         4 
          meca |         0          3          0 |         3 
          mphc |         0          1          0 |         1 
          msra |         0          1          0 |         1 
          mupa |         0          1          1 |         2 
          qaca |         0          1          1 |         2 
          qacb |         0          1         45 |        46 
       qaccsmr |         0          7          3 |        10 
           sak |         1          4          3 |         8 
          sasx |         0          1         14 |        15 
          sat4 |         0          2          1 |         3 
           scn |         2          6         10 |        18 
           seb |         0          2          1 |         3 
           sec |         0          3          2 |         5 
           seg |         1         17          8 |        26 
           sei |         9          7         26 |        42 
           sep |         0          1          2 |         3 
          tetk |         0          6          2 |         8 
          tetm |         1          1          0 |         2 
         tsst1 |         0          3          2 |         5 
---------------+---------------------------------+----------
         Total |        30        171        307 |       508 


. noi di r(sum) " out of " r(N) " sites are borderline +/- 5 from threshold"
. out of 508 sites are borderline +/- 5 from threshold

. tab ValueAll

   ValueAll |      Freq.     Percent        Cum.
------------+-----------------------------------
        AAP |          8        1.57        1.57
        APA |        168       33.07       34.65
        APP |        169       33.27       67.91
        PPA |        163       32.09      100.00
------------+-----------------------------------
      Total |        508      100.00

. summ bcount
variable bcount not found
r(111);

. 
. noi di r(sum) " out of " r(N) " sites are borderline +/- 5 from threshold"
. out of 508 sites are borderline +/- 5 from threshold

. gen bcount = 1 if borderline=="borderline"
(478 missing values generated)

. 
. summ bcount

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      bcount |         30           1           0          1          1

. 
. noi di r(sum) " out of " r(N) " sites are borderline +/- 5 from threshold"
30 out of 30 sites are borderline +/- 5 from threshold

. 
. 
. drop bc

. gen bcount = (borderline=="borderline")

. 
. summ bcount

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      bcount |        508    .0590551    .2359602          0          1

. 
. noi di r(sum) " out of " r(N) " sites are borderline +/- 5 from threshold"
30 out of 508 sites are borderline +/- 5 from threshold

. noi di r(sum) " out of " r(N) " sites are borderline +/- 5 from threshold"
30 out of 508 sites are borderline +/- 5 from threshold

. 
. noi di r(sum)/r(N) *100 " percent"
5.9055118 percent

. help for

. foreach x in AAP APA APP PPA {
  2. 
. di `x'
  3. 
. summ bcount if ValueAll==`x'
  4. 
. noi di r(sum) " out of " r(N) " sites are borderline +/- 5 from threshold"
  5. 
. noi di r(sum)/r(N) *100 " percent"
  6. 
. 
. 
. noi tab site borderline
  7. 
. noi tab set borderline
  8. 
. }
AAP not found
r(111);

. 
. foreach x in AAP APA APP PPA {
  2. 
. di `x'
  3. 
. summ bcount if ValueAll=="`x'"
  4. 
. noi di r(sum) " out of " r(N) " sites are borderline +/- 5 from threshold"
  5. 
. noi di r(sum)/r(N) *100 " percent"
  6. 
. 
. 
. noi tab site borderline
  7. 
. noi tab set borderline
  8. 
. }
AAP not found
r(111);

. foreach x in AAP APA APP PPA {
  2. 
. di `x'
  3. 
. summ bcount if ValueAll==""`x'""
  4. 
. noi di r(sum) " out of " r(N) " sites are borderline +/- 5 from threshold"
  5. 
. noi di r(sum)/r(N) *100 " percent"
  6. 
. 
. 
. noi tab site borderline
  7. 
. noi tab set borderline
  8. }
AAP not found
r(111);

. 
. foreach x in "AAP" "APA" "APP" "PPA" {
  2. 
. di `x'
  3. 
. 
. 
. summ bcount if ValueAll==`x'
  4. 
. noi di r(sum) " out of " r(N) " sites are borderline +/- 5 from threshold"
  5. 
. noi di r(sum)/r(N) *100 " percent"
  6. 
. 
. 
. noi tab site borderline
  7. 
. noi tab set borderline
  8. 
. }
AAP not found
r(111);

. foreach x in "AAP" "APA" "APP" "PPA" {
  2. 
. di `x'
  3. 
. }
AAP not found
r(111);

.  foreach name in "Annette Fett" "Ashley Poole" "Marsha Martinez" {
  2. 
.                 display length("`name'") " characters long -- `name'"
  3. 
.         }
12 characters long -- Annette Fett
12 characters long -- Ashley Poole
15 characters long -- Marsha Martinez

. foreach value in "AAP" "APA" "APP" "PPA" {
  2. 
. di `value'
  3. 
. }
AAP not found
r(111);

. foreach value in "AAP" "APA" "APP" "PPA" {
  2. 
. di "`value'"
  3. 
. }
AAP
APA
APP
PPA

. foreach value in "AAP" "APA" "APP" "PPA" {
  2. 
. di "`value'"
  3. 
. 
. 
. summ bcount if ValueAll=="`x'"
  4. 
. noi di r(sum) " out of " r(N) " sites are borderline +/- 5 from threshold"
  5. 
. noi di r(sum)/r(N) *100 " percent"
  6. 
. 
. 
. noi tab site borderline if ValueAll=="`x'"
  7. 
. noi tab set borderline if ValueAll=="`x'"
  8. 
. }
AAP

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      bcount |          0
0 out of 0 sites are borderline +/- 5 from threshold
. percent
no observations
no observations
APA

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      bcount |          0
0 out of 0 sites are borderline +/- 5 from threshold
. percent
no observations
no observations
APP

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      bcount |          0
0 out of 0 sites are borderline +/- 5 from threshold
. percent
no observations
no observations
PPA

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      bcount |          0
0 out of 0 sites are borderline +/- 5 from threshold
. percent
no observations
no observations

. foreach value in "AAP" "APA" "APP" "PPA" {
  2. 
. di "`value'"
  3. 
. 
. 
. summ bcount if ValueAll==`x'
  4. 
. noi di r(sum) " out of " r(N) " sites are borderline +/- 5 from threshold"
  5. 
. noi di r(sum)/r(N) *100 " percent"
  6. 
. 
. 
. }
AAP
invalid syntax
r(198);

. foreach value in "AAP" "APA" "APP" "PPA" {
  2. 
. di "`value'"
  3. 
. 
. 
. summ bcount if ValueAll=="`x'"
  4. 
. noi di r(sum) " out of " r(N) " sites are borderline +/- 5 from threshold"
  5. 
. noi di r(sum)/r(N) *100 " percent"
  6. 
. 
. 
. }
AAP

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      bcount |          0
0 out of 0 sites are borderline +/- 5 from threshold
. percent
APA

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      bcount |          0
0 out of 0 sites are borderline +/- 5 from threshold
. percent
APP

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      bcount |          0
0 out of 0 sites are borderline +/- 5 from threshold
. percent
PPA

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      bcount |          0
0 out of 0 sites are borderline +/- 5 from threshold
. percent

. summ bcount if ValueAll=="APP"

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      bcount |        169    .1420118    .3500996          0          1

. foreach value in "AAP" "APA" "APP" "PPA" {
  2. 
. di "`value'"
  3. 
. 
. 
. summ bcount if ValueAll=="`value'"
  4. 
. noi di r(sum) " out of " r(N) " sites are borderline +/- 5 from threshold"
  5. 
. noi di r(sum)/r(N) *100 " percent"
  6. 
. 
. 
. }
AAP

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      bcount |          8           0           0          0          0
0 out of 8 sites are borderline +/- 5 from threshold
0 percent
APA

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      bcount |        168    .0357143    .1861317          0          1
6 out of 168 sites are borderline +/- 5 from threshold
3.5714286 percent
APP

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      bcount |        169    .1420118    .3500996          0          1
24 out of 169 sites are borderline +/- 5 from threshold
14.201183 percent
PPA

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      bcount |        163           0           0          0          0
0 out of 163 sites are borderline +/- 5 from threshold
0 percent

. foreach value in "AAP" "APA" "APP" "PPA" {
  2. 
. di "`value'"
  3. 
. 
. 
. summ bcount if ValueAll=="`value'"
  4. 
. noi di r(sum) " out of " r(N) " sites are borderline +/- 5 from threshold"
  5. 
. noi di r(sum)/r(N) *100 " percent"
  6. 
. 
. 
. noi tab site borderline if ValueAll=="`x'"
  7. 
. noi tab set borderline if ValueAll=="`x'"
  8. 
. }
AAP

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      bcount |          8           0           0          0          0
0 out of 8 sites are borderline +/- 5 from threshold
0 percent
no observations
no observations
APA

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      bcount |        168    .0357143    .1861317          0          1
6 out of 168 sites are borderline +/- 5 from threshold
3.5714286 percent
no observations
no observations
APP

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      bcount |        169    .1420118    .3500996          0          1
24 out of 169 sites are borderline +/- 5 from threshold
14.201183 percent
no observations
no observations
PPA

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      bcount |        163           0           0          0          0
0 out of 163 sites are borderline +/- 5 from threshold
0 percent
no observations
no observations

. foreach value in "AAP" "APA" "APP" "PPA" {
  2. 
. di "`value'"
  3. 
. 
. 
. summ bcount if ValueAll=="`value'"
  4. 
. noi di r(sum) " out of " r(N) " sites are borderline +/- 5 from threshold"
  5. 
. noi di r(sum)/r(N) *100 " percent"
  6. 
. 
. 
. noi tab site borderline if ValueAll=="`value'"
  7. 
. noi tab set borderline if ValueAll=="`value'"
  8. 
. }
AAP

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      bcount |          8           0           0          0          0
0 out of 8 sites are borderline +/- 5 from threshold
0 percent

               |      borderline
          site |        no        yes |     Total
---------------+----------------------+----------
          lnua |         0          6 |         6 
          mupa |         1          1 |         2 
---------------+----------------------+----------
         Total |         1          7 |         8 


           |      borderline
       set |        no        yes |     Total
-----------+----------------------+----------
Collindale |         1          7 |         8 
-----------+----------------------+----------
     Total |         1          7 |         8 

APA

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      bcount |        168    .0357143    .1861317          0          1
6 out of 168 sites are borderline +/- 5 from threshold
3.5714286 percent

               |            borderline
          site | borderl..         no        yes |     Total
---------------+---------------------------------+----------
      aac6aph2 |         0          2          0 |         2 
    aaddaph4ia |         0          2          0 |         2 
    aadeant6ia |         4         24          0 |        28 
        ant9ia |         0          2          2 |         4 
          arca |         0          1          0 |         1 
          blaz |         0         19          0 |        19 
         ccrca |         0          0          8 |         8 
         ccrcb |         0          2         20 |        22 
         ccrcc |         0          3         13 |        16 
           chp |         0          1          0 |         1 
          dfra |         0          2          1 |         3 
          dfrg |         0          1          0 |         1 
          ermb |         0          1          0 |         1 
          ermc |         0         10          0 |        10 
           eta |         0          1          0 |         1 
           etb |         0          1          0 |         1 
           etd |         0          1          0 |         1 
          fusb |         0          2          0 |         2 
          fusc |         0          1          0 |         1 
        lukpvf |         2          0          0 |         2 
        lukpvs |         0          3          0 |         3 
          meca |         0          1          0 |         1 
          mphc |         0          1          0 |         1 
          msra |         0          1          0 |         1 
          qaca |         0          1          0 |         1 
          qacb |         0          1          1 |         2 
       qaccsmr |         0          6          1 |         7 
           sak |         0          3          0 |         3 
          sasx |         0          1          0 |         1 
          sat4 |         0          1          1 |         2 
           scn |         0          3          0 |         3 
           seb |         0          1          0 |         1 
           sec |         0          1          0 |         1 
           seg |         0          5          1 |         6 
           sei |         0          1          2 |         3 
          tetk |         0          4          0 |         4 
          tetm |         0          1          0 |         1 
         tsst1 |         0          1          0 |         1 
---------------+---------------------------------+----------
         Total |         6        112         50 |       168 


           |            borderline
       set | borderl..         no        yes |     Total
-----------+---------------------------------+----------
Collindale |         6         71         46 |       123 
 Oxford491 |         0          7          1 |         8 
 Oxford501 |         0         34          3 |        37 
-----------+---------------------------------+----------
     Total |         6        112         50 |       168 

APP

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      bcount |        169    .1420118    .3500996          0          1
24 out of 169 sites are borderline +/- 5 from threshold
14.201183 percent

               |            borderline
          site | borderl..         no        yes |     Total
---------------+---------------------------------+----------
      aac6aph2 |         0          1          0 |         1 
    aadeant6ia |         0          2          0 |         2 
        ant9ia |         0          3          0 |         3 
  apha3aph3iii |         0          1          0 |         1 
          blaz |         1          3          3 |         7 
         ccrca |         0          1          0 |         1 
         ccrcc |         0          0          1 |         1 
           cfr |         0          1          0 |         1 
           chp |         6          9         31 |        46 
          dfrc |         2          0          1 |         3 
          ermc |         0          2          0 |         2 
           etb |         0          0          1 |         1 
           etd |         0          0          1 |         1 
          fusc |         1          1          0 |         2 
        lukpvs |         0          0          1 |         1 
          meca |         0          2          0 |         2 
          qaca |         0          0          1 |         1 
       qaccsmr |         0          1          1 |         2 
           sak |         1          1          3 |         5 
          sat4 |         0          1          0 |         1 
           scn |         2          3         10 |        15 
           seb |         0          1          1 |         2 
           sec |         0          2          2 |         4 
           seg |         1         12          7 |        20 
           sei |         9          6         18 |        33 
           sep |         0          1          1 |         2 
          tetk |         0          2          2 |         4 
          tetm |         1          0          0 |         1 
         tsst1 |         0          2          2 |         4 
---------------+---------------------------------+----------
         Total |        24         58         87 |       169 


           |            borderline
       set | borderl..         no        yes |     Total
-----------+---------------------------------+----------
Collindale |         6         17         19 |        42 
 Oxford491 |         1          4          7 |        12 
 Oxford501 |        17         37         61 |       115 
-----------+---------------------------------+----------
     Total |        24         58         87 |       169 

PPA

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      bcount |        163           0           0          0          0
0 out of 163 sites are borderline +/- 5 from threshold
0 percent

               | borderline
          site |       yes |     Total
---------------+-----------+----------
          arcb |         6 |         6 
          arcc |         6 |         6 
          arcd |         6 |         6 
          blaz |         1 |         1 
         ccrca |         9 |         9 
         ccrcb |        22 |        22 
         ccrcc |         6 |         6 
          dfra |         1 |         1 
          dfrc |        34 |        34 
         lukmf |         6 |         6 
          qacb |        44 |        44 
       qaccsmr |         1 |         1 
          sasx |        14 |        14 
           sei |         6 |         6 
           sep |         1 |         1 
---------------+-----------+----------
         Total |       163 |       163 


           | borderline
       set |       yes |     Total
-----------+-----------+----------
Collindale |       131 |       131 
 Oxford491 |        15 |        15 
 Oxford501 |        17 |        17 
-----------+-----------+----------
     Total |       163 |       163 


. 
. use dis2, replace

. 
. 
. 
. * create borderline value flag: <75 = clear no, 75-85 = borderline, 85+ = clear yes 

. 
. gen borderline = "no" 

. 
. replace borderline = "borderline" if value> 75 | (site=="blaz" & value> 25)
variable borderline was str2 now str10
(337 real changes made)

. 
. replace borderline= "yes" if value >85 | (site=="blaz" & value > 35)
(307 real changes made)

. 
. 
. 
. gen bcount = (borderline=="borderline")

. 
. gen ycount = (borderline=="yes")

. 
. gen ncount = (borderline=="no")

. 
. summ bcount

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      bcount |        508    .0590551    .2359602          0          1

. 
. noi di r(sum) " out of " r(N) " sites are borderline +/- 5 from threshold"
30 out of 508 sites are borderline +/- 5 from threshold

. 
. noi di r(sum)/r(N) *100 " percent"
5.9055118 percent

. 
. 
. 
. foreach value in "AAP" "APA" "APP" "PPA" {
  2. 
. di "`value'"
  3. 
. 
. 
. summ bcount if ValueAll=="`value'"
  4. 
. noi di r(sum) " out of " r(N) " sites are borderline +/- 5 from threshold"
  5. 
. noi di r(sum)/r(N) *100 " percent"
  6. 
. 
. 
. summ ycount if ValueAll=="`value'"
  7. 
. noi di r(sum) " out of " r(N) " sites are 5 or more above threshold"
  8. 
. noi di r(sum)/r(N) *100 " percent"
  9. 
. 
. 
. summ ncount if ValueAll=="`value'"
 10. 
. noi di r(sum) " out of " r(N) " sites are 5 or more below threshold"
 11. 
. noi di r(sum)/r(N) *100 " percent"
 12. 
. 
. 
. noi tab site borderline if ValueAll=="`value'"
 13. 
. noi tab set borderline if ValueAll=="`value'"
 14. 
. }
AAP

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      bcount |          8           0           0          0          0
0 out of 8 sites are borderline +/- 5 from threshold
0 percent

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      ycount |          8        .875    .3535534          0          1
7 out of 8 sites are 5 or more above threshold
87.5 percent

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      ncount |          8        .125    .3535534          0          1
1 out of 8 sites are 5 or more below threshold
12.5 percent

               |      borderline
          site |        no        yes |     Total
---------------+----------------------+----------
          lnua |         0          6 |         6 
          mupa |         1          1 |         2 
---------------+----------------------+----------
         Total |         1          7 |         8 


           |      borderline
       set |        no        yes |     Total
-----------+----------------------+----------
Collindale |         1          7 |         8 
-----------+----------------------+----------
     Total |         1          7 |         8 

APA

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      bcount |        168    .0357143    .1861317          0          1
6 out of 168 sites are borderline +/- 5 from threshold
3.5714286 percent

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      ycount |        168     .297619    .4585779          0          1
50 out of 168 sites are 5 or more above threshold
29.761905 percent

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      ncount |        168    .6666667    .4728138          0          1
112 out of 168 sites are 5 or more below threshold
66.666667 percent

               |            borderline
          site | borderl..         no        yes |     Total
---------------+---------------------------------+----------
      aac6aph2 |         0          2          0 |         2 
    aaddaph4ia |         0          2          0 |         2 
    aadeant6ia |         4         24          0 |        28 
        ant9ia |         0          2          2 |         4 
          arca |         0          1          0 |         1 
          blaz |         0         19          0 |        19 
         ccrca |         0          0          8 |         8 
         ccrcb |         0          2         20 |        22 
         ccrcc |         0          3         13 |        16 
           chp |         0          1          0 |         1 
          dfra |         0          2          1 |         3 
          dfrg |         0          1          0 |         1 
          ermb |         0          1          0 |         1 
          ermc |         0         10          0 |        10 
           eta |         0          1          0 |         1 
           etb |         0          1          0 |         1 
           etd |         0          1          0 |         1 
          fusb |         0          2          0 |         2 
          fusc |         0          1          0 |         1 
        lukpvf |         2          0          0 |         2 
        lukpvs |         0          3          0 |         3 
          meca |         0          1          0 |         1 
          mphc |         0          1          0 |         1 
          msra |         0          1          0 |         1 
          qaca |         0          1          0 |         1 
          qacb |         0          1          1 |         2 
       qaccsmr |         0          6          1 |         7 
           sak |         0          3          0 |         3 
          sasx |         0          1          0 |         1 
          sat4 |         0          1          1 |         2 
           scn |         0          3          0 |         3 
           seb |         0          1          0 |         1 
           sec |         0          1          0 |         1 
           seg |         0          5          1 |         6 
           sei |         0          1          2 |         3 
          tetk |         0          4          0 |         4 
          tetm |         0          1          0 |         1 
         tsst1 |         0          1          0 |         1 
---------------+---------------------------------+----------
         Total |         6        112         50 |       168 


           |            borderline
       set | borderl..         no        yes |     Total
-----------+---------------------------------+----------
Collindale |         6         71         46 |       123 
 Oxford491 |         0          7          1 |         8 
 Oxford501 |         0         34          3 |        37 
-----------+---------------------------------+----------
     Total |         6        112         50 |       168 

APP

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      bcount |        169    .1420118    .3500996          0          1
24 out of 169 sites are borderline +/- 5 from threshold
14.201183 percent

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      ycount |        169    .5147929    .5012664          0          1
87 out of 169 sites are 5 or more above threshold
51.47929 percent

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      ncount |        169    .3431953     .476187          0          1
58 out of 169 sites are 5 or more below threshold
34.319527 percent

               |            borderline
          site | borderl..         no        yes |     Total
---------------+---------------------------------+----------
      aac6aph2 |         0          1          0 |         1 
    aadeant6ia |         0          2          0 |         2 
        ant9ia |         0          3          0 |         3 
  apha3aph3iii |         0          1          0 |         1 
          blaz |         1          3          3 |         7 
         ccrca |         0          1          0 |         1 
         ccrcc |         0          0          1 |         1 
           cfr |         0          1          0 |         1 
           chp |         6          9         31 |        46 
          dfrc |         2          0          1 |         3 
          ermc |         0          2          0 |         2 
           etb |         0          0          1 |         1 
           etd |         0          0          1 |         1 
          fusc |         1          1          0 |         2 
        lukpvs |         0          0          1 |         1 
          meca |         0          2          0 |         2 
          qaca |         0          0          1 |         1 
       qaccsmr |         0          1          1 |         2 
           sak |         1          1          3 |         5 
          sat4 |         0          1          0 |         1 
           scn |         2          3         10 |        15 
           seb |         0          1          1 |         2 
           sec |         0          2          2 |         4 
           seg |         1         12          7 |        20 
           sei |         9          6         18 |        33 
           sep |         0          1          1 |         2 
          tetk |         0          2          2 |         4 
          tetm |         1          0          0 |         1 
         tsst1 |         0          2          2 |         4 
---------------+---------------------------------+----------
         Total |        24         58         87 |       169 


           |            borderline
       set | borderl..         no        yes |     Total
-----------+---------------------------------+----------
Collindale |         6         17         19 |        42 
 Oxford491 |         1          4          7 |        12 
 Oxford501 |        17         37         61 |       115 
-----------+---------------------------------+----------
     Total |        24         58         87 |       169 

PPA

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      bcount |        163           0           0          0          0
0 out of 163 sites are borderline +/- 5 from threshold
0 percent

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      ycount |        163           1           0          1          1
163 out of 163 sites are 5 or more above threshold
100 percent

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      ncount |        163           0           0          0          0
0 out of 163 sites are 5 or more below threshold
0 percent

               | borderline
          site |       yes |     Total
---------------+-----------+----------
          arcb |         6 |         6 
          arcc |         6 |         6 
          arcd |         6 |         6 
          blaz |         1 |         1 
         ccrca |         9 |         9 
         ccrcb |        22 |        22 
         ccrcc |         6 |         6 
          dfra |         1 |         1 
          dfrc |        34 |        34 
         lukmf |         6 |         6 
          qacb |        44 |        44 
       qaccsmr |         1 |         1 
          sasx |        14 |        14 
           sei |         6 |         6 
           sep |         1 |         1 
---------------+-----------+----------
         Total |       163 |       163 


           | borderline
       set |       yes |     Total
-----------+-----------+----------
Collindale |       131 |       131 
 Oxford491 |        15 |        15 
 Oxford501 |        17 |        17 
-----------+-----------+----------
     Total |       163 |       163 


. 
. 
. run site.do
file site.do not found
r(601);

. cd E:\users\amy.mason\Pipeline_27_07_2016\
E:\users\amy.mason\Pipeline_27_07_2016

. *discrepancies check

. 
. run site.do
