Run by AMM on  5 Sep 2016 21:55:26
split spatypes
number of spatypes in each swab

  n_spatype |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,573       51.10       51.10
          1 |      4,191       46.83       97.93
          2 |        165        1.84       99.78
          3 |         18        0.20       99.98
          5 |          2        0.02      100.00
------------+-----------------------------------
      Total |      8,949      100.00
max number of spatypes

    max_spa |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         87       16.70       16.70
          1 |        343       65.83       82.53
          2 |         77       14.78       97.31
          3 |         12        2.30       99.62
          5 |          2        0.38      100.00
------------+-----------------------------------
      Total |        521      100.00
min number of spatypes

    min_spa |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        386       74.09       74.09
          1 |        135       25.91      100.00
------------+-----------------------------------
      Total |        521      100.00

           |        min_spa
   max_spa |         0          1 |     Total
-----------+----------------------+----------
         0 |        87          0 |        87 
         1 |       250         93 |       343 
         2 |        44         33 |        77 
         3 |         4          8 |        12 
         5 |         1          1 |         2 
-----------+----------------------+----------
     Total |       386        135 |       521 

carriage over whole time; timepoint = last time seen

           |              carry
  lasttime |    always      never     varies |     Total
-----------+---------------------------------+----------
         4 |         6          2          2 |        10 
         6 |         4          5          1 |        10 
         8 |         0          4          6 |        10 
        10 |         2          3          5 |        10 
        12 |         3          2          4 |         9 
        14 |         4          2          2 |         8 
        16 |         2          1          3 |         6 
        18 |         5          0          4 |         9 
        20 |         1          1          4 |         6 
        22 |         5          2          6 |        13 
        24 |        73         12        112 |       197 
        26 |         3          2          4 |         9 
        28 |         1          1          1 |         3 
        30 |         0          2          0 |         2 
        32 |         0          0          1 |         1 
        34 |         0          0          1 |         1 
        36 |         1          2          1 |         4 
        38 |         0          1          0 |         1 
        40 |         1          0          2 |         3 
        42 |         2          0          2 |         4 
        44 |         1          0          4 |         5 
        46 |         0          3          3 |         6 
        48 |        18         21         84 |       123 
        50 |         0          0          5 |         5 
        52 |         0          0          2 |         2 
        60 |         0          2          0 |         2 
        62 |         1          0          1 |         2 
        64 |         0          1          1 |         2 
        66 |         1          0          2 |         3 
        68 |         0          0          1 |         1 
        70 |         1          0          0 |         1 
        72 |         0          0          1 |         1 
        76 |         0          1          0 |         1 
        78 |         0         10         11 |        21 
        80 |         0          7         11 |        18 
        82 |         0          0          1 |         1 
        84 |         0          0          6 |         6 
        86 |         0          0          5 |         5 
-----------+---------------------------------+----------
     Total |       135         87        299 |       521 

carriage to date (unclear = unconfirmed neg at timepoint 0)

           |               carriage_todate
 timepoint |    always      never    unclear     varies |     Total
-----------+--------------------------------------------+----------
         0 |       346        161         14          0 |       521 
         2 |       302        147          0         44 |       493 
         4 |       267        145          0         72 |       484 
         6 |       256        138          0         86 |       480 
         8 |       238        128          0         98 |       464 
        10 |       222        116          0        105 |       443 
        12 |       210        119          0        124 |       453 
        14 |       195        109          0        132 |       436 
        16 |       187        107          0        144 |       438 
        18 |       188        105          0        146 |       439 
        20 |       177         98          0        154 |       429 
        22 |       173         93          0        147 |       413 
        24 |       177         92          0        157 |       426 
        26 |        75         74          0         75 |       224 
        28 |        64         70          0         80 |       214 
        30 |        65         67          0         88 |       220 
        32 |        59         61          0         92 |       212 
        34 |        57         57          0         93 |       207 
        36 |        58         58          0         91 |       207 
        38 |        55         52          0         90 |       197 
        40 |        54         49          0         95 |       198 
        42 |        55         49          0         96 |       200 
        44 |        51         48          0         98 |       197 
        46 |        49         46          0         96 |       191 
        48 |        48         43          0         93 |       184 
        50 |         2          1          0          5 |         8 
        52 |         0          0          0          2 |         2 
        54 |         0          2          0          0 |         2 
        56 |         2         11          0          5 |        18 
        58 |         3         13          0         11 |        27 
        60 |         9         19          0         12 |        40 
        62 |         4         16          0         17 |        37 
        64 |        12         18          0         19 |        49 
        66 |         9         14          0         18 |        41 
        68 |        10         16          0         19 |        45 
        70 |        13         17          0         22 |        52 
        72 |        10         18          0         23 |        51 
        74 |         7         16          0         26 |        49 
        76 |         7         17          0         26 |        50 
        78 |         5         17          0         29 |        51 
        80 |         0          7          0         23 |        30 
        82 |         0          0          0         11 |        11 
        84 |         0          0          0         11 |        11 
        86 |         0          0          0          5 |         5 
-----------+--------------------------------------------+----------
     Total |     3,721      2,434         14      2,780 |     8,949 

Weigh by starting proportion of carriage/ no carriage

           |      FollowUpNeg
 timepoint |         0          1 |     Total
-----------+----------------------+----------
         0 |       332        189 |       521 
         2 |       321        172 |       493 
         4 |       306        178 |       484 
         6 |       308        172 |       480 
         8 |       298        166 |       464 
        10 |       286        157 |       443 
        12 |       289        164 |       453 
        14 |       286        150 |       436 
        16 |       281        157 |       438 
        18 |       282        157 |       439 
        20 |       274        155 |       429 
        22 |       268        145 |       413 
        24 |       275        151 |       426 
        26 |       124        100 |       224 
        28 |       115         99 |       214 
        30 |       117        103 |       220 
        32 |       117         95 |       212 
        34 |       115         92 |       207 
        36 |       111         96 |       207 
        38 |       110         87 |       197 
        40 |       109         89 |       198 
        42 |       111         89 |       200 
        44 |       106         91 |       197 
        46 |       106         85 |       191 
        48 |       103         81 |       184 
        50 |         5          3 |         8 
        52 |         0          2 |         2 
        54 |         0          2 |         2 
        56 |         4         14 |        18 
        58 |         6         21 |        27 
        60 |        13         27 |        40 
        62 |        12         25 |        37 
        64 |        18         31 |        49 
        66 |        17         24 |        41 
        68 |        17         28 |        45 
        70 |        22         30 |        52 
        72 |        21         30 |        51 
        74 |        20         29 |        49 
        76 |        20         30 |        50 
        78 |        21         30 |        51 
        80 |        17         13 |        30 
        82 |        11          0 |        11 
        84 |        11          0 |        11 
        86 |         5          0 |         5 
-----------+----------------------+----------
     Total |     5,390      3,559 |     8,949 

number of spatypes seen in each patid

      count |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        234       53.92       53.92
          2 |        121       27.88       81.80
          3 |         54       12.44       94.24
          4 |         14        3.23       97.47
          5 |          5        1.15       98.62
          6 |          4        0.92       99.54
          7 |          2        0.46      100.00
------------+-----------------------------------
      Total |        434      100.00
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. display _N
8949

. 
. use "E:\users\amy.mason\staph_carriage\Datasets\clean_data4.dta", clear

. 
. assert _N==8949

. 
. gsort patid -newspa_init timepoint

. 
. by patid: gen firstevent = timepoint[1] if newspa_i[1]==1
(4,743 missing values generated)

. 
. by patid: replace firstevent = timepoint[_N] if newspa_i[1]==0
(4743 real changes made)

. 
. assert firstevent!=.

. 
. drop if timepoint > firstevent
(1,825 observations deleted)

. 
. drop if timepoint==0
(521 observations deleted)

. 
. stset timepoint, fail(newspa_init) id(patid)

                id:  patid
     failure event:  newspa_init != 0 & newspa_init < .
obs. time interval:  (timepoint[_n-1], timepoint]
 exit on or before:  failure

------------------------------------------------------------------------------
       6603  total observations
          0  exclusions
------------------------------------------------------------------------------
       6603  observations remaining, representing
        521  subjects
        219  failures in single-failure-per-subject data
      14358  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        84

. 
. * NOTE GAIN MARKER = newspa_init; it is not single failure per person, but stata deals with that

. 
. assert _st==1

. 
. 
. 
. *** 

. 
. noi di "Kaplan-Meier"
Kaplan-Meier

. 
. 
. 
. sts graph, by(Follow) risktable

         failure _d:  newspa_init
   analysis time _t:  timepoint
                 id:  patid

. 
. graph save Graph "E:\users\amy.mason\staph_carriage\Graphs\KM_gain.gph", replace
(file E:\users\amy.mason\staph_carriage\Graphs\KM_gain.gph saved)

. 
. graph export "E:\users\amy.mason\staph_carriage\Graphs\KM_gain.eps", as(eps) preview(off) replace
(file E:\users\amy.mason\staph_carriage\Graphs\KM_gain.eps written in EPS format)

. 
. 
. 
. * log-cumulative graph of survival

. 
. noi di "Log-cumulative graph of survival"
Log-cumulative graph of survival

. 
. 
. 
. stphplot, by(Follow)

         failure _d:  newspa_init
   analysis time _t:  timepoint
                 id:  patid

. 
. graph save Graph "E:\users\amy.mason\staph_carriage\Graphs\log_cum_gain.gph", replace
(file E:\users\amy.mason\staph_carriage\Graphs\log_cum_gain.gph saved)

. 
. graph export "E:\users\amy.mason\staph_carriage\Graphs\log_cum_gain.eps", as(eps) preview(off) replace
(file E:\users\amy.mason\staph_carriage\Graphs\log_cum_gain.eps written in EPS format)

. 
. 
. 
. * linear in log-log graph? less so than shorter estimates (though not parellel)

. 
. 
. 
. *consider a Weibull model

. 
. 
. 
. streg, distribution(weibull)

         failure _d:  newspa_init
   analysis time _t:  timepoint
                 id:  patid

Fitting constant-only model:

Iteration 0:   log likelihood =  -520.5914
Iteration 1:   log likelihood = -513.79667
Iteration 2:   log likelihood = -513.77302
Iteration 3:   log likelihood = -513.77302

Fitting full model:
Iteration 0:   log likelihood = -513.77302  

Weibull regression -- log relative-hazard form 

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(0)       =       -0.00
Log likelihood  =   -513.77302                  Prob > chi2      =           .

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _cons |   .0065073   .0016593   -19.74   0.000     .0039477    .0107263
-------------+----------------------------------------------------------------
       /ln_p |   .2138733    .054945     3.89   0.000      .106183    .3215636
-------------+----------------------------------------------------------------
           p |   1.238466   .0680475                      1.112025    1.379283
         1/p |   .8074507   .0443654                      .7250145    .8992601
------------------------------------------------------------------------------

. 
. 
. 
. **********************************************************************************************************

. 
. * main categorical effects

. 
. 
. 
. foreach var of varlist Sex Ethnic_group residence_group CurrentlyEm HealthcareR SportsActivity LookAfter VascularAccess Catheter
>  inpatient inpatient_summ LiveAlone  household_group districtnurse DistrictNurse_summ skin surgery surgery_summ GP GP_summ {
  2. 
. encode `var', gen(`var'_cat)
  3. 
. drop `var'
  4. 
. rename `var'_cat `var'
  5. 
. }

. 
. 
. 
. foreach var of varlist Sex Ethnic_group residence_group CurrentlyEm HealthcareR SportsActivity LookAfter VascularAccess Catheter
>  inpatient inpatient_summ LiveAlone Follow household_group districtnurse DistrictNurse_summ skininfection skin surgery surgery_s
> umm GP GP_summ LTI {
  2. 
.    noi di _n _dup(80) "=" _n "`var'" _n _dup(80) "=" 
  3. 
.    noi tab `var' newspa_init, row nokey m
  4. 
.    qui streg i.`var',distribution(weibull) 
  5. 
.    assert e(N)==6638
  6. 
.    noi streg
  7. 
. }

================================================================================
Sex
================================================================================

           |      newspa_init
       Sex |         0          1 |     Total
-----------+----------------------+----------
    Female |     3,445        112 |     3,557 
           |     96.85       3.15 |    100.00 
-----------+----------------------+----------
      Male |     2,939        107 |     3,046 
           |     96.49       3.51 |    100.00 
-----------+----------------------+----------
     Total |     6,384        219 |     6,603 
           |     96.68       3.32 |    100.00 

assertion is false
r(9);

. 
. 
. foreach var of varlist Sex Ethnic_group residence_group CurrentlyEm HealthcareR SportsActivity LookAfter VascularAccess Catheter
>  inpatient inpatient_summ LiveAlone Follow household_group districtnurse DistrictNurse_summ skininfection skin surgery surgery_s
> umm GP GP_summ LTI {
  2. 
.    noi di _n _dup(80) "=" _n "`var'" _n _dup(80) "=" 
  3. 
.    noi tab `var' newspa_init, row nokey m
  4. 
.    qui streg i.`var',distribution(weibull) 
  5. 
.    assert e(N)==6603
  6. 
.    noi streg
  7. 
. }

================================================================================
Sex
================================================================================

           |      newspa_init
       Sex |         0          1 |     Total
-----------+----------------------+----------
    Female |     3,445        112 |     3,557 
           |     96.85       3.15 |    100.00 
-----------+----------------------+----------
      Male |     2,939        107 |     3,046 
           |     96.49       3.51 |    100.00 
-----------+----------------------+----------
     Total |     6,384        219 |     6,603 
           |     96.68       3.32 |    100.00 


Weibull regression -- log relative-hazard form 

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(1)       =        0.76
Log likelihood  =   -513.39541                  Prob > chi2      =      0.3848

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         Sex |
       Male  |   1.124755   .1520475     0.87   0.384     .8629594    1.465973
       _cons |   .0061556    .001621   -19.33   0.000     .0036739    .0103138
-------------+----------------------------------------------------------------
       /ln_p |   .2138384   .0549388     3.89   0.000     .1061604    .3215165
-------------+----------------------------------------------------------------
           p |   1.238423   .0680374                         1.112    1.379218
         1/p |   .8074788   .0443619                      .7250487    .8992804
------------------------------------------------------------------------------

================================================================================
Ethnic_group
================================================================================

                    |      newspa_init
       Ethnic_group |         0          1 |     Total
--------------------+----------------------+----------
              Other |        92          5 |        97 
                    |     94.85       5.15 |    100.00 
--------------------+----------------------+----------
        Other White |       262          9 |       271 
                    |     96.68       3.32 |    100.00 
--------------------+----------------------+----------
White British/Irish |     6,030        205 |     6,235 
                    |     96.71       3.29 |    100.00 
--------------------+----------------------+----------
              Total |     6,384        219 |     6,603 
                    |     96.68       3.32 |    100.00 


Weibull regression -- log relative-hazard form 

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(2)       =        0.50
Log likelihood  =   -513.52148                  Prob > chi2      =      0.7776

--------------------------------------------------------------------------------------
                  _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        Ethnic_group |
        Other White  |   .7758744   .4328374    -0.45   0.649     .2599748    2.315536
White British/Irish  |   .7220636   .3269314    -0.72   0.472     .2972856    1.753788
                     |
               _cons |     .00887   .0044862    -9.34   0.000     .0032916    .0239023
---------------------+----------------------------------------------------------------
               /ln_p |   .2153576   .0549805     3.92   0.000     .1075977    .3231175
---------------------+----------------------------------------------------------------
                   p |   1.240305   .0681927                        1.1136    1.381428
                 1/p |   .8062531   .0443282                      .7238888    .8979887
--------------------------------------------------------------------------------------

================================================================================
residence_group
================================================================================

                      |      newspa_init
      residence_group |         0          1 |     Total
----------------------+----------------------+----------
          No response |       833         22 |       855 
                      |     97.43       2.57 |    100.00 
----------------------+----------------------+----------
own home/None of the  |     5,518        193 |     5,711 
                      |     96.62       3.38 |    100.00 
----------------------+----------------------+----------
          shared home |        33          4 |        37 
                      |     89.19      10.81 |    100.00 
----------------------+----------------------+----------
                Total |     6,384        219 |     6,603 
                      |     96.68       3.32 |    100.00 


Weibull regression -- log relative-hazard form 

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(2)       =        5.64
Log likelihood  =   -510.95377                  Prob > chi2      =      0.0597

---------------------------------------------------------------------------------------------
                         _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
            residence_group |
own home/None of the above  |   1.325531   .2983612     1.25   0.211     .8526966    2.060559
               shared home  |    4.27287   2.340584     2.65   0.008     1.460327    12.50228
                            |
                      _cons |   .0047573   .0015779   -16.12   0.000     .0024833    .0091135
----------------------------+----------------------------------------------------------------
                      /ln_p |   .2252727   .0549562     4.10   0.000     .1175606    .3329848
----------------------------+----------------------------------------------------------------
                          p |   1.252664   .0688416                       1.12475    1.395126
                        1/p |   .7982985   .0438714                      .7167811    .8890866
---------------------------------------------------------------------------------------------

================================================================================
CurrentlyEmployed
================================================================================

CurrentlyE |      newspa_init
   mployed |         0          1 |     Total
-----------+----------------------+----------
        No |     3,257        111 |     3,368 
           |     96.70       3.30 |    100.00 
-----------+----------------------+----------
       Yes |     3,127        108 |     3,235 
           |     96.66       3.34 |    100.00 
-----------+----------------------+----------
     Total |     6,384        219 |     6,603 
           |     96.68       3.32 |    100.00 


Weibull regression -- log relative-hazard form 

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(1)       =        0.00
Log likelihood  =   -513.77223                  Prob > chi2      =      0.9682

-----------------------------------------------------------------------------------
               _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
CurrentlyEmployed |
             Yes  |   1.005409   .1359066     0.04   0.968     .7714033    1.310402
            _cons |    .006491   .0017049   -19.18   0.000     .0038792    .0108613
------------------+----------------------------------------------------------------
            /ln_p |   .2138404   .0549522     3.89   0.000      .106136    .3215447
------------------+----------------------------------------------------------------
                p |   1.238425   .0680542                      1.111973    1.379257
              1/p |   .8074773   .0443727                      .7250282    .8993023
-----------------------------------------------------------------------------------

================================================================================
HealthcareRelatedEmployed
================================================================================

HeathcareR |
elatedEmpl |      newspa_init
      oyed |         0          1 |     Total
-----------+----------------------+----------
        No |     4,904        167 |     5,071 
           |     96.71       3.29 |    100.00 
-----------+----------------------+----------
       Yes |     1,480         52 |     1,532 
           |     96.61       3.39 |    100.00 
-----------+----------------------+----------
     Total |     6,384        219 |     6,603 
           |     96.68       3.32 |    100.00 


Weibull regression -- log relative-hazard form 

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(1)       =        0.05
Log likelihood  =   -513.74639                  Prob > chi2      =      0.8175

-------------------------------------------------------------------------------------------
                       _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
HealthcareRelatedEmployed |
                     Yes  |   1.037456   .1647563     0.23   0.817     .7599623    1.416274
                    _cons |    .006449   .0016642   -19.55   0.000      .003889    .0106942
--------------------------+----------------------------------------------------------------
                    /ln_p |   .2139602   .0549507     3.89   0.000     .1062588    .3216615
--------------------------+----------------------------------------------------------------
                        p |   1.238573   .0680605                       1.11211    1.379418
                      1/p |   .8073806   .0443661                      .7249435    .8991919
-------------------------------------------------------------------------------------------

================================================================================
SportsActivity
================================================================================

SportsActi |      newspa_init
      vity |         0          1 |     Total
-----------+----------------------+----------
        No |     4,203        125 |     4,328 
           |     97.11       2.89 |    100.00 
-----------+----------------------+----------
       Yes |     2,181         94 |     2,275 
           |     95.87       4.13 |    100.00 
-----------+----------------------+----------
     Total |     6,384        219 |     6,603 
           |     96.68       3.32 |    100.00 


Weibull regression -- log relative-hazard form 

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(1)       =        7.15
Log likelihood  =   -510.19808                  Prob > chi2      =      0.0075

--------------------------------------------------------------------------------
            _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
SportsActivity |
          Yes  |    1.44735   .1978782     2.70   0.007     1.107132    1.892116
         _cons |   .0054535    .001449   -19.61   0.000     .0032397      .00918
---------------+----------------------------------------------------------------
         /ln_p |   .2215151   .0548834     4.04   0.000     .1139456    .3290846
---------------+----------------------------------------------------------------
             p |   1.247966   .0684926                      1.120691    1.389695
           1/p |   .8013039   .0439783                      .7195822    .8923065
--------------------------------------------------------------------------------

================================================================================
LookAfter
================================================================================

           |      newspa_init
 LookAfter |         0          1 |     Total
-----------+----------------------+----------
        No |     4,846        167 |     5,013 
           |     96.67       3.33 |    100.00 
-----------+----------------------+----------
       Yes |     1,538         52 |     1,590 
           |     96.73       3.27 |    100.00 
-----------+----------------------+----------
     Total |     6,384        219 |     6,603 
           |     96.68       3.32 |    100.00 


Weibull regression -- log relative-hazard form 

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(1)       =        0.00
Log likelihood  =   -513.77054                  Prob > chi2      =      0.9438

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   LookAfter |
        Yes  |   1.011269   .1606012     0.07   0.944     .7407741    1.380534
       _cons |    .006489    .001675   -19.52   0.000     .0039125    .0107622
-------------+----------------------------------------------------------------
       /ln_p |   .2139105   .0549484     3.89   0.000     .1062136    .3216074
-------------+----------------------------------------------------------------
           p |   1.238512   .0680543                      1.112059    1.379343
         1/p |   .8074206   .0443665                      .7249827    .8992326
------------------------------------------------------------------------------

================================================================================
VascularAccess
================================================================================

VascularAc |      newspa_init
      cess |         0          1 |     Total
-----------+----------------------+----------
        No |     1,835         81 |     1,916 
           |     95.77       4.23 |    100.00 
-----------+----------------------+----------
   Unknown |       224          6 |       230 
           |     97.39       2.61 |    100.00 
-----------+----------------------+----------
       Yes |     4,325        132 |     4,457 
           |     97.04       2.96 |    100.00 
-----------+----------------------+----------
     Total |     6,384        219 |     6,603 
           |     96.68       3.32 |    100.00 


Weibull regression -- log relative-hazard form 

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(2)       =        7.68
Log likelihood  =   -509.93419                  Prob > chi2      =      0.0215

--------------------------------------------------------------------------------
            _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------+----------------------------------------------------------------
VascularAccess |
      Unknown  |   .6058285   .2563613    -1.18   0.236     .2643363    1.388489
          Yes  |   .6774185   .0958575    -2.75   0.006     .5133441    .8939344
               |
         _cons |   .0081108    .002153   -18.14   0.000     .0048207    .0136463
---------------+----------------------------------------------------------------
         /ln_p |    .224053   .0548408     4.09   0.000     .1165669     .331539
---------------+----------------------------------------------------------------
             p |   1.251137   .0686134                      1.123633     1.39311
           1/p |   .7992728   .0438328                      .7178181    .8899706
--------------------------------------------------------------------------------

================================================================================
Catheter
================================================================================

           |      newspa_init
  Catheter |         0          1 |     Total
-----------+----------------------+----------
        No |     4,563        158 |     4,721 
           |     96.65       3.35 |    100.00 
-----------+----------------------+----------
   Unknown |       262          5 |       267 
           |     98.13       1.87 |    100.00 
-----------+----------------------+----------
       Yes |     1,559         56 |     1,615 
           |     96.53       3.47 |    100.00 
-----------+----------------------+----------
     Total |     6,384        219 |     6,603 
           |     96.68       3.32 |    100.00 


Weibull regression -- log relative-hazard form 

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(2)       =        2.17
Log likelihood  =   -512.69013                  Prob > chi2      =      0.3386

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    Catheter |
    Unknown  |   .5621541   .2553589    -1.27   0.205     .2307791    1.369349
        Yes  |   1.052208   .1636512     0.33   0.744     .7757351    1.427217
             |
       _cons |   .0065262   .0016821   -19.52   0.000     .0039379    .0108158
-------------+----------------------------------------------------------------
       /ln_p |   .2143606   .0548944     3.90   0.000     .1067695    .3219517
-------------+----------------------------------------------------------------
           p |   1.239069    .068018                      1.112678    1.379818
         1/p |   .8070573   .0443029                      .7247332    .8987328
------------------------------------------------------------------------------

================================================================================
inpatient
================================================================================

           |      newspa_init
 inpatient |         0          1 |     Total
-----------+----------------------+----------
        No |     1,139         55 |     1,194 
           |     95.39       4.61 |    100.00 
-----------+----------------------+----------
       Yes |     5,245        164 |     5,409 
           |     96.97       3.03 |    100.00 
-----------+----------------------+----------
     Total |     6,384        219 |     6,603 
           |     96.68       3.32 |    100.00 


Weibull regression -- log relative-hazard form 

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(1)       =        7.08
Log likelihood  =     -510.234                  Prob > chi2      =      0.0078

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   inpatient |
        Yes  |   .6501085   .1013366    -2.76   0.006     .4789649    .8824053
       _cons |   .0089797   .0024875   -17.01   0.000     .0052175    .0154547
-------------+----------------------------------------------------------------
       /ln_p |   .2175744   .0546296     3.98   0.000     .1105024    .3246464
-------------+----------------------------------------------------------------
           p |   1.243058   .0679077                      1.116839    1.383541
         1/p |   .8044678   .0439477                      .7227829    .8953842
------------------------------------------------------------------------------

================================================================================
inpatient_summ
================================================================================

               |      newspa_init
inpatient_summ |         0          1 |     Total
---------------+----------------------+----------
 > 30 days ago |     5,063        160 |     5,223 
               |     96.94       3.06 |    100.00 
---------------+----------------------+----------
            No |     1,139         55 |     1,194 
               |     95.39       4.61 |    100.00 
---------------+----------------------+----------
Within 30 days |       182          4 |       186 
               |     97.85       2.15 |    100.00 
---------------+----------------------+----------
         Total |     6,384        219 |     6,603 
               |     96.68       3.32 |    100.00 


Weibull regression -- log relative-hazard form 

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(2)       =        8.34
Log likelihood  =   -509.60159                  Prob > chi2      =      0.0154

---------------------------------------------------------------------------------
             _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
 inpatient_summ |
            No  |   1.513341   .2365864     2.65   0.008     1.113948     2.05593
Within 30 days  |   .5921773   .3003825    -1.03   0.302     .2191185    1.600385
                |
          _cons |   .0058121   .0015052   -19.88   0.000     .0034986    .0096554
----------------+----------------------------------------------------------------
          /ln_p |   .2222365   .0547219     4.06   0.000     .1149836    .3294895
----------------+----------------------------------------------------------------
              p |   1.248867   .0683404                      1.121855    1.390258
            1/p |   .8007259   .0438172                      .7192908    .8913808
---------------------------------------------------------------------------------

================================================================================
LiveAlone
================================================================================

           |      newspa_init
 LiveAlone |         0          1 |     Total
-----------+----------------------+----------
        No |     5,499        196 |     5,695 
           |     96.56       3.44 |    100.00 
-----------+----------------------+----------
       Yes |       885         23 |       908 
           |     97.47       2.53 |    100.00 
-----------+----------------------+----------
     Total |     6,384        219 |     6,603 
           |     96.68       3.32 |    100.00 


Weibull regression -- log relative-hazard form 

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(1)       =        2.18
Log likelihood  =   -512.68457                  Prob > chi2      =      0.1401

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   LiveAlone |
        Yes  |   .7318674   .1613321    -1.42   0.157     .4751102     1.12738
       _cons |   .0067142    .001717   -19.57   0.000     .0040675    .0110831
-------------+----------------------------------------------------------------
       /ln_p |   .2153154   .0548936     3.92   0.000      .107726    .3229048
-------------+----------------------------------------------------------------
           p |   1.240253   .0680819                      1.113743    1.381134
         1/p |   .8062871     .04426                      .7240428    .8978736
------------------------------------------------------------------------------

================================================================================
FollowUpNeg
================================================================================

FollowUpNe |      newspa_init
         g |         0          1 |     Total
-----------+----------------------+----------
         0 |     3,910        126 |     4,036 
           |     96.88       3.12 |    100.00 
-----------+----------------------+----------
         1 |     2,474         93 |     2,567 
           |     96.38       3.62 |    100.00 
-----------+----------------------+----------
     Total |     6,384        219 |     6,603 
           |     96.68       3.32 |    100.00 


Weibull regression -- log relative-hazard form 

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(1)       =        0.36
Log likelihood  =    -513.5947                  Prob > chi2      =      0.5504

-------------------------------------------------------------------------------
           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
1.FollowUpNeg |   1.085857   .1494471     0.60   0.550     .8291279     1.42208
        _cons |   .0063967   .0016382   -19.73   0.000     .0038722    .0105671
--------------+----------------------------------------------------------------
        /ln_p |   .2100634   .0553298     3.80   0.000     .1016189    .3185079
--------------+----------------------------------------------------------------
            p |   1.233756   .0682635                      1.106962    1.375074
          1/p |   .8105329   .0448467                      .7272334    .9033738
-------------------------------------------------------------------------------

================================================================================
household_group
================================================================================

                    |      newspa_init
    household_group |         0          1 |     Total
--------------------+----------------------+----------
                  1 |       847         22 |       869 
                    |     97.47       2.53 |    100.00 
--------------------+----------------------+----------
                  2 |     3,202         88 |     3,290 
                    |     97.33       2.67 |    100.00 
--------------------+----------------------+----------
                  3 |     1,091         43 |     1,134 
                    |     96.21       3.79 |    100.00 
--------------------+----------------------+----------
                  4 |       846         42 |       888 
                    |     95.27       4.73 |    100.00 
--------------------+----------------------+----------
                 5+ |       365         20 |       385 
                    |     94.81       5.19 |    100.00 
--------------------+----------------------+----------
shared accomodation |        33          4 |        37 
                    |     89.19      10.81 |    100.00 
--------------------+----------------------+----------
              Total |     6,384        219 |     6,603 
                    |     96.68       3.32 |    100.00 


Weibull regression -- log relative-hazard form 

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(5)       =       21.40
Log likelihood  =   -503.07443                  Prob > chi2      =      0.0007

--------------------------------------------------------------------------------------
                  _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
     household_group |
                  2  |    1.05167   .2506864     0.21   0.833     .6591414    1.677955
                  3  |   1.485996   .3896052     1.51   0.131     .8888855    2.484217
                  4  |   1.997544   .5270552     2.62   0.009     1.190983    3.350327
                 5+  |   2.159461   .6703527     2.48   0.013     1.175196     3.96808
shared accomodation  |    4.49321   2.462169     2.74   0.006     1.535038    13.15207
                     |
               _cons |    .004093   .0013785   -16.33   0.000     .0021152    .0079201
---------------------+----------------------------------------------------------------
               /ln_p |   .2543551   .0546922     4.65   0.000     .1471603    .3615499
---------------------+----------------------------------------------------------------
                   p |    1.28963   .0705327                       1.15854    1.435553
                 1/p |   .7754164   .0424093                      .6965958    .8631556
--------------------------------------------------------------------------------------

================================================================================
districtnurse
================================================================================

districtnu |      newspa_init
       rse |         0          1 |     Total
-----------+----------------------+----------
        No |     5,355        189 |     5,544 
           |     96.59       3.41 |    100.00 
-----------+----------------------+----------
       Yes |     1,029         30 |     1,059 
           |     97.17       2.83 |    100.00 
-----------+----------------------+----------
     Total |     6,384        219 |     6,603 
           |     96.68       3.32 |    100.00 


Weibull regression -- log relative-hazard form 

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(1)       =        1.04
Log likelihood  =   -513.25256                  Prob > chi2      =      0.3076

-------------------------------------------------------------------------------
           _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
districtnurse |
         Yes  |    .822127   .1615889    -1.00   0.319     .5592879    1.208488
        _cons |   .0066756   .0017092   -19.57   0.000     .0040417    .0110262
--------------+----------------------------------------------------------------
        /ln_p |   .2146918   .0549052     3.91   0.000     .1070796     .322304
--------------+----------------------------------------------------------------
            p |    1.23948   .0680539                      1.113023    1.380304
          1/p |   .8067901    .044297                      .7244779    .8984541
-------------------------------------------------------------------------------

================================================================================
DistrictNurse_summ
================================================================================

DistrictNurse_ |      newspa_init
          summ |         0          1 |     Total
---------------+----------------------+----------
 > 30 days ago |       986         29 |     1,015 
               |     97.14       2.86 |    100.00 
---------------+----------------------+----------
            No |     5,355        189 |     5,544 
               |     96.59       3.41 |    100.00 
---------------+----------------------+----------
Within 30 days |        43          1 |        44 
               |     97.73       2.27 |    100.00 
---------------+----------------------+----------
         Total |     6,384        219 |     6,603 
               |     96.68       3.32 |    100.00 


Weibull regression -- log relative-hazard form 

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(2)       =        1.22
Log likelihood  =    -513.1644                  Prob > chi2      =      0.5441

------------------------------------------------------------------------------------
                _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------+----------------------------------------------------------------
DistrictNurse_summ |
               No  |   1.196734   .2386721     0.90   0.368     .8095381    1.769123
   Within 30 days  |   .6696661   .6815206    -0.39   0.694     .0911147    4.921845
                   |
             _cons |   .0055557   .0017163   -16.81   0.000     .0030324    .0101787
-------------------+----------------------------------------------------------------
             /ln_p |   .2155971   .0549367     3.92   0.000     .1079232     .323271
-------------------+----------------------------------------------------------------
                 p |   1.240602   .0681546                      1.113962     1.38164
               1/p |     .80606   .0442823                      .7237777    .8976965
------------------------------------------------------------------------------------

================================================================================
skininfection
================================================================================

skininfect |      newspa_init
       ion |         0          1 |     Total
-----------+----------------------+----------
         0 |     6,384        219 |     6,603 
           |     96.68       3.32 |    100.00 
-----------+----------------------+----------
     Total |     6,384        219 |     6,603 
           |     96.68       3.32 |    100.00 


Weibull regression -- log relative-hazard form 

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(0)       =       -0.00
Log likelihood  =   -513.77302                  Prob > chi2      =           .

---------------------------------------------------------------------------------
             _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
0.skininfection |          1  (omitted)
          _cons |   .0065073   .0016593   -19.74   0.000     .0039477    .0107263
----------------+----------------------------------------------------------------
          /ln_p |   .2138733    .054945     3.89   0.000      .106183    .3215636
----------------+----------------------------------------------------------------
              p |   1.238466   .0680475                      1.112025    1.379283
            1/p |   .8074507   .0443654                      .7250145    .8992601
---------------------------------------------------------------------------------

================================================================================
skin
================================================================================

               |      newspa_init
          skin |         0          1 |     Total
---------------+----------------------+----------
     > 30 days |       461         15 |       476 
               |     96.85       3.15 |    100.00 
---------------+----------------------+----------
Did Not Report |     5,870        201 |     6,071 
               |     96.69       3.31 |    100.00 
---------------+----------------------+----------
            No |        51          3 |        54 
               |     94.44       5.56 |    100.00 
---------------+----------------------+----------
within 30 days |         2          0 |         2 
               |    100.00       0.00 |    100.00 
---------------+----------------------+----------
         Total |     6,384        219 |     6,603 
               |     96.68       3.32 |    100.00 


Weibull regression -- log relative-hazard form 

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(3)       =        1.05
Log likelihood  =   -513.24586                  Prob > chi2      =      0.7881

---------------------------------------------------------------------------------
             _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
           skin |
Did Not Report  |   .9904645   .2652726    -0.04   0.971     .5859554    1.674223
            No  |   1.646967   1.041302     0.79   0.430     .4769894    5.686708
within 30 days  |   .0000129   .0079943    -0.02   0.985            0           .
                |
          _cons |    .006541   .0022937   -14.34   0.000     .0032897    .0130056
----------------+----------------------------------------------------------------
          /ln_p |   .2136968   .0549767     3.89   0.000     .1059443    .3214492
----------------+----------------------------------------------------------------
              p |   1.238247   .0680748                       1.11176    1.379125
            1/p |   .8075932   .0443988                      .7250975    .8994747
---------------------------------------------------------------------------------

================================================================================
surgery
================================================================================

           |      newspa_init
   surgery |         0          1 |     Total
-----------+----------------------+----------
        No |     1,333         76 |     1,409 
           |     94.61       5.39 |    100.00 
-----------+----------------------+----------
       Yes |     5,051        143 |     5,194 
           |     97.25       2.75 |    100.00 
-----------+----------------------+----------
     Total |     6,384        219 |     6,603 
           |     96.68       3.32 |    100.00 


Weibull regression -- log relative-hazard form 

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(1)       =       23.41
Log likelihood  =   -502.06631                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     surgery |
        Yes  |   .4839629     .06954    -5.05   0.000     .3651775     .641387
       _cons |   .0093093    .002454   -17.74   0.000     .0055531    .0156064
-------------+----------------------------------------------------------------
       /ln_p |   .2511494   .0546741     4.59   0.000     .1439901    .3583087
-------------+----------------------------------------------------------------
           p |   1.285502   .0702837                      1.154873    1.430907
         1/p |   .7779061   .0425313                      .6988573    .8658964
------------------------------------------------------------------------------

================================================================================
surgery_summ
================================================================================

               |      newspa_init
  surgery_summ |         0          1 |     Total
---------------+----------------------+----------
 > 30 days ago |     4,862        138 |     5,000 
               |     97.24       2.76 |    100.00 
---------------+----------------------+----------
            No |     1,333         76 |     1,409 
               |     94.61       5.39 |    100.00 
---------------+----------------------+----------
Within 30 days |       189          5 |       194 
               |     97.42       2.58 |    100.00 
---------------+----------------------+----------
         Total |     6,384        219 |     6,603 
               |     96.68       3.32 |    100.00 


Weibull regression -- log relative-hazard form 

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(2)       =       23.63
Log likelihood  =   -501.95979                  Prob > chi2      =      0.0000

---------------------------------------------------------------------------------
             _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
   surgery_summ |
            No  |   2.051195   .2962499     4.97   0.000     1.545502    2.722351
Within 30 days  |   .8156213   .3717713    -0.45   0.655       .33381    1.992865
                |
          _cons |    .004512   .0012312   -19.79   0.000      .002643    .0077026
----------------+----------------------------------------------------------------
          /ln_p |   .2524957   .0547226     4.61   0.000     .1452413    .3597501
----------------+----------------------------------------------------------------
              p |   1.287234   .0704408                      1.156319    1.432971
            1/p |   .7768596   .0425118                      .6978507    .8648136
---------------------------------------------------------------------------------

================================================================================
GP
================================================================================

           |      newspa_init
        GP |         0          1 |     Total
-----------+----------------------+----------
        No |        94          5 |        99 
           |     94.95       5.05 |    100.00 
-----------+----------------------+----------
       Yes |     6,290        214 |     6,504 
           |     96.71       3.29 |    100.00 
-----------+----------------------+----------
     Total |     6,384        219 |     6,603 
           |     96.68       3.32 |    100.00 


Weibull regression -- log relative-hazard form 

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(1)       =        1.20
Log likelihood  =     -513.174                  Prob > chi2      =      0.2737

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          GP |
        Yes  |   .5836796   .2645026    -1.19   0.235     .2401268    1.418758
       _cons |   .0108979   .0054358    -9.06   0.000     .0040999    .0289677
-------------+----------------------------------------------------------------
       /ln_p |    .216819   .0549479     3.95   0.000      .109123     .324515
-------------+----------------------------------------------------------------
           p |   1.242119   .0682519                        1.1153     1.38336
         1/p |   .8050757   .0442372                      .7228779    .8966201
------------------------------------------------------------------------------

================================================================================
GP_summ
================================================================================

               |      newspa_init
       GP_summ |         0          1 |     Total
---------------+----------------------+----------
 > 30 days ago |     4,389        153 |     4,542 
               |     96.63       3.37 |    100.00 
---------------+----------------------+----------
            No |        94          5 |        99 
               |     94.95       5.05 |    100.00 
---------------+----------------------+----------
Within 30 days |     1,901         61 |     1,962 
               |     96.89       3.11 |    100.00 
---------------+----------------------+----------
         Total |     6,384        219 |     6,603 
               |     96.68       3.32 |    100.00 


Weibull regression -- log relative-hazard form 

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(2)       =        1.72
Log likelihood  =   -512.91194                  Prob > chi2      =      0.4227

---------------------------------------------------------------------------------
             _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
        GP_summ |
            No  |    1.66006   .7555283     1.11   0.265     .6803371    4.050639
Within 30 days  |   .8968477   .1358972    -0.72   0.472     .6664049    1.206978
                |
          _cons |   .0065255    .001688   -19.45   0.000     .0039304    .0108343
----------------+----------------------------------------------------------------
          /ln_p |   .2183091   .0549423     3.97   0.000     .1106241    .3259941
----------------+----------------------------------------------------------------
              p |   1.243971   .0683467                      1.116975    1.385407
            1/p |   .8038769   .0441669                      .7218095    .8952752
---------------------------------------------------------------------------------

================================================================================
LTI
================================================================================

           |      newspa_init
       LTI |         0          1 |     Total
-----------+----------------------+----------
         0 |     4,428        155 |     4,583 
           |     96.62       3.38 |    100.00 
-----------+----------------------+----------
         1 |     1,956         64 |     2,020 
           |     96.83       3.17 |    100.00 
-----------+----------------------+----------
     Total |     6,384        219 |     6,603 
           |     96.68       3.32 |    100.00 


Weibull regression -- log relative-hazard form 

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(1)       =        0.06
Log likelihood  =   -513.74516                  Prob > chi2      =      0.8134

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       1.LTI |    .965609   .1434934    -0.24   0.814     .7216213    1.292092
       _cons |   .0065816   .0017069   -19.37   0.000     .0039589    .0109419
-------------+----------------------------------------------------------------
       /ln_p |   .2136489   .0549486     3.89   0.000     .1059516    .3213462
-------------+----------------------------------------------------------------
           p |   1.238188   .0680367                      1.111768    1.378983
         1/p |   .8076319   .0443783                      .7251722    .8994682
------------------------------------------------------------------------------

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. tab household_group LiveAlone

                    |       LiveAlone
    household_group |        No        Yes |     Total
--------------------+----------------------+----------
                  1 |         0        869 |       869 
                  2 |     3,270         20 |     3,290 
                  3 |     1,125          9 |     1,134 
                  4 |       888          0 |       888 
                 5+ |       375         10 |       385 
shared accomodation |        37          0 |        37 
--------------------+----------------------+----------
              Total |     5,695        908 |     6,603 


. 
. 
. 
. use "E:\users\amy.mason\staph_carriage\Datasets\clean_data.dta", clear

. 
. 
. 
. * check count

. 
. sort patid timepoint

. 
. by patid: gen first=(_n==1)

. 
. summ first

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       first |      8,949    .0582188    .2341698          0          1

. 
. noi di  " starting with " _N " records from " r(sum) " paticipants" 
 starting with 8949 records from 521 paticipants

. 
. * check everyone starts from zero

. 
. assert timepoint==0 if first==1

. 
. assert timepoint!=0 if first!=1

. 
. drop if first!=1
(8,428 observations deleted)

. 
. keep patid Sex DateOfBirth BestDate

. 
. 
. 
. * sex 

. 
. noi di "SEX"
SEX

. 
. assert inlist(Sex, "Female", "Male")

. 
. noi tab Sex ,m

        Sex |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |        281       53.93       53.93
       Male |        240       46.07      100.00
------------+-----------------------------------
      Total |        521      100.00

. 
. 
. 
. *age

. 
. noi di "AGE"
AGE

. 
. assert DateOfBirth!=.

. 
. by patid: gen age = floor((BestDate[1]-DateOfBirth)/ 365.25) 

. 
. noi tabstat age, c(s) s(n median iqr min p25 p75 max)

    variable |         N       p50       iqr       min       p25       p75       max
-------------+----------------------------------------------------------------------
         age |       521        51        37        16        27        64        93
------------------------------------------------------------------------------------

. 
. 
. 
. save temp, replace
file temp.dta saved

. 
. use temp, clear

. 
. ********************************************************************************

. 
. 
. 
. merge m:1 patid using "E:\users\amy.mason\staph_carriage\Datasets\Personal", update

    Result                           # of obs.
    -----------------------------------------
    not matched                           858
        from master                         0  (_merge==1)
        from using                        858  (_merge==2)

    matched                               521
        not updated                       521  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. 
. drop if _merge==2
(858 observations deleted)

. 
. assert _merge==3

. 
. 
. 
. *ethnicity

. 
. noi di "ETHNIC"
ETHNIC

. 
. noi assert Ethnic!=""

. 
. noi tab Ethnic 

                  EthnicBackground |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
                  1a White British |        476       91.36       91.36
                    1b White Irish |          3        0.58       91.94
         1c Other white background |         29        5.57       97.50
          2c Mixed White and Asian |          4        0.77       98.27
     2d Any other Mixed background |          2        0.38       98.66
                         3a Indian |          1        0.19       98.85
     3d Any other Asian Background |          2        0.38       99.23
                        4b African |          1        0.19       99.42
                         5 Chinese |          1        0.19       99.62
                       6 Any other |          1        0.19       99.81
7 Do not wish to give ethnic group |          1        0.19      100.00
-----------------------------------+-----------------------------------
                             Total |        521      100.00

. 
. gen Ethnic_group = "Other"

. 
. replace Ethnic_group = "White British/Irish" if inlist(EthnicB, "1a White British", "1b
>  White Irish")
variable Ethnic_group was str5 now str19
(479 real changes made)

. 
. replace Ethnic_group = "Other White" if inlist(EthnicB, "1c Other white background")
(29 real changes made)

. 
. noi tab Ethnic*,m

                      |           Ethnic_group
     EthnicBackground |     Other  Other W..  White B.. |     Total
----------------------+---------------------------------+----------
     1a White British |         0          0        476 |       476 
       1b White Irish |         0          0          3 |         3 
1c Other white back.. |         0         29          0 |        29 
2c Mixed White and .. |         4          0          0 |         4 
2d Any other Mixed .. |         2          0          0 |         2 
            3a Indian |         1          0          0 |         1 
3d Any other Asian .. |         2          0          0 |         2 
           4b African |         1          0          0 |         1 
            5 Chinese |         1          0          0 |         1 
          6 Any other |         1          0          0 |         1 
7 Do not wish to gi.. |         1          0          0 |         1 
----------------------+---------------------------------+----------
                Total |        13         29        479 |       521 


. 
. 
. 
. * residence (for use in deciding household)

. 
. noi di "residence"
residence

. 
. noi tab Residence

                             Residence |      Freq.     Percent        Cum.
---------------------------------------+-----------------------------------
           6 Educational establishment |          6        1.30        1.30
7 Hotel, boarding house or guest house |          1        0.22        1.52
                              8 Hostel |          1        0.22        1.74
            9 None of above / Own home |        453       98.26      100.00
---------------------------------------+-----------------------------------
                                 Total |        461      100.00

. 
. gen residence_group = "own home/None of the above" if strpos(Residence,"9")
(68 missing values generated)

. 
. replace residence_group = "shared home" if strpos(Reside, "6") | strpos(Resid, "7") | s
> trpos(Resid, "8")
(8 real changes made)

. 
. replace residence_group = "No response" if residence_group==""
(60 real changes made)

. 
. noi tab residence_ Reside, m

                      |                  Residence
      residence_group |            6 Educa..  7 Hotel..   8 Hostel |     Total
----------------------+--------------------------------------------+----------
          No response |        60          0          0          0 |        60 
own home/None of th.. |         0          0          0          0 |       453 
          shared home |         0          6          1          1 |         8 
----------------------+--------------------------------------------+----------
                Total |        60          6          1          1 |       521 


                      | Residence
      residence_group | 9 None .. |     Total
----------------------+-----------+----------
          No response |         0 |        60 
own home/None of th.. |       453 |       453 
          shared home |         0 |         8 
----------------------+-----------+----------
                Total |       453 |       521 


. 
. * current employment at baseline

. 
. 
. 
. noi di "Current Employment at recruitment"
Current Employment at recruitment

. 
. noi assert inlist(CurrentlyEmployed, "No", "Yes")

. 
. noi tab CurrentlyEmployed ,m

CurrentlyEm |
     ployed |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |        273       52.40       52.40
        Yes |        248       47.60      100.00
------------+-----------------------------------
      Total |        521      100.00

. 
. 
. 
. * Healthcare related employment at baseline

. 
. 
. 
. noi di "Healthcare related employment at recruitment"
Healthcare related employment at recruitment

. 
. rename  HeathcareRelatedEmployed HealthcareRelatedEmployed

. 
. noi assert inlist( HealthcareRelatedEmployed, "No", "Yes")

. 
. noi tab  HealthcareRelatedEmployed ,m

HeathcareRe |
latedEmploy |
         ed |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |        401       76.97       76.97
        Yes |        120       23.03      100.00
------------+-----------------------------------
      Total |        521      100.00

. 
. 
. 
. * participation in contact sport 

. 
. 
. 
. noi di "Participation in contact sport"
Participation in contact sport

. 
. noi assert inlist(SportsActivity, "Yes", "No")

. 
. noi tab SportsActivity ,m

SportsActiv |
        ity |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |        327       62.76       62.76
        Yes |        194       37.24      100.00
------------+-----------------------------------
      Total |        521      100.00

. 
. 
. 
. * looks after someone with disability or old age

. 
. 
. 
. noi di "Looks after anyone with a disability/old age"
Looks after anyone with a disability/old age

. 
. noi assert inlist( LookAfterDisability, "Yes", "No")

. 
. noi assert inlist( LookAfterOldAge, "Yes", "No")

. 
. noi tab LookAfter* 

LookAfterD |    LookAfterOldAge
 isability |        No        Yes |     Total
-----------+----------------------+----------
        No |       399         41 |       440 
       Yes |        39         42 |        81 
-----------+----------------------+----------
     Total |       438         83 |       521 


. 
. gen LookAfter = LookAfterDisability

. 
. replace LookAfter = "Yes" if LookAfterOldAge=="Yes"
(41 real changes made)

. 
. noi tab LookAfter,m

  LookAfter |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |        399       76.58       76.58
        Yes |        122       23.42      100.00
------------+-----------------------------------
      Total |        521      100.00

. 
. 
. 
. * ever had vasular access

. 
. noi di "Ever had vascular access"
Ever had vascular access

. 
. noi assert  VascularAccess!=""

. 
. noi tab  VascularAccess,m

VascularAcc |
        ess |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |        172       33.01       33.01
    Unknown |         17        3.26       36.28
        Yes |        332       63.72      100.00
------------+-----------------------------------
      Total |        521      100.00

. 
. 
. 
. * ever had catheter

. 
. noi di "Ever had Catheter"
Ever had Catheter

. 
. noi assert Catheter !=""

. 
. noi tab Catheter,m

   Catheter |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |        383       73.51       73.51
    Unknown |         19        3.65       77.16
        Yes |        119       22.84      100.00
------------+-----------------------------------
      Total |        521      100.00

. 
. 
. 
. * inpatient

. 
. noi di "inpatient"
inpatient

. 
. noi tab IPEver, m

     IPEver |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |        170       32.63       32.63
  Not known |         73       14.01       46.64
        Yes |        278       53.36      100.00
------------+-----------------------------------
      Total |        521      100.00

. 
. gen inpatient_days =  BestDate -  DateMostRecentIP
(243 missing values generated)

. 
. assert inpatient_days>=0

. 
. noi tabstat inpatient_days, c(s) s(n median iqr min p25 p75 max)

    variable |         N       p50       iqr       min       p25       p75       max
-------------+----------------------------------------------------------------------
inpatient_~s |       278  806.7083      1276  1.547917       340      1616      7980
------------------------------------------------------------------------------------

. 
. gen inpatient_summ = "Within 30 days" if inpatient_days<=30
(514 missing values generated)

. 
. replace inpatient_summ = "> 30 days ago" if inpatient_days> 30 & inpatient_days!=.
(271 real changes made)

. 
. replace inpatient_summ = "No" if inpatient_days==.
(243 real changes made)

. 
. noi tab inpatient_summ

inpatient_summ |      Freq.     Percent        Cum.
---------------+-----------------------------------
 > 30 days ago |        271       52.02       52.02
            No |        243       46.64       98.66
Within 30 days |          7        1.34      100.00
---------------+-----------------------------------
         Total |        521      100.00

. 
. gen inpatient = IPEver 

. 
. replace inpatient = "No" if IPEver=="Not known"
(73 real changes made)

. 
. 
. 
. *outpatient

. 
. noi di "outpatient"
outpatient

. 
. noi tab OPEver, m

     OPEver |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |         87       16.70       16.70
  Not known |         73       14.01       30.71
        Yes |        361       69.29      100.00
------------+-----------------------------------
      Total |        521      100.00

. 
. gen outpatient_days =  BestDate -  DateMostRecentOP
(160 missing values generated)

. 
. assert outpatient_days>=0

. 
. noi tabstat outpatient_days, c(s) s(n median iqr min p25 p75 max)

    variable |         N       p50       iqr       min       p25       p75       max
-------------+----------------------------------------------------------------------
outpatient~s |       361       283  692.5625  1.645833        91  783.5625     18522
------------------------------------------------------------------------------------

. 
. gen outpatient_summ = "Within 30 days" if outpatient_days<=30
(484 missing values generated)

. 
. replace outpatient_summ = "> 30 days ago" if outpatient_days> 30 & outpatient_days!=.
(324 real changes made)

. 
. replace outpatient_summ = "No" if outpatient_days==.
(160 real changes made)

. 
. noi tab outpatient_summ

outpatient_sum |
             m |      Freq.     Percent        Cum.
---------------+-----------------------------------
 > 30 days ago |        324       62.19       62.19
            No |        160       30.71       92.90
Within 30 days |         37        7.10      100.00
---------------+-----------------------------------
         Total |        521      100.00

. 
. gen outpatient = OPEver 

. 
. replace outpatient = "No" if OPEver=="Not known"
(73 real changes made)

. 
. 
. 
. 
. 
. 
. 
. keep outpatient_summ inpatient_summ patid residence_group LiveAlone Sex age DateOfBirth
>  Ethnic_group CurrentlyEmployed HealthcareRelatedEmployed SportsActivity LookAfter DIED
>  REMOVEDCONSENT FollowUpNeg VascularAccess Catheter inpatient outpatient

. 
. 
. 
. save temp, replace
file temp.dta saved

. 
. 
. 
. use temp, clear

. 
. 
. 
. 
. 
. ***************************************

. 
. 
. 
. use "E:\users\amy.mason\staph_carriage\Datasets\patid.dta", clear

. 
. merge 1:m patid using "E:\users\amy.mason\staph_carriage\Datasets\Household", update

    Result                           # of obs.
    -----------------------------------------
    not matched                         1,283
        from master                        69  (_merge==1)
        from using                      1,214  (_merge==2)

    matched                               889
        not updated                       889  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. 
.  drop if _merge==2
(1,214 observations deleted)

. 
.  assert inlist(_merge,1,3)

. 
.  noi di "people with no household members"
people with no household members

. 
.  list patid if _merge==1

     +-------+
     | patid |
     |-------|
  3. |     9 |
  9. |    22 |
 10. |    25 |
 11. |    31 |
 15. |    42 |
     |-------|
 17. |    45 |
 18. |    50 |
 19. |    51 |
 26. |    90 |
 39. |   133 |
     |-------|
 44. |   149 |
 45. |   150 |
 47. |   152 |
 50. |   160 |
 51. |   162 |
     |-------|
 52. |   164 |
 53. |   174 |
 61. |   304 |
 70. |   333 |
 75. |   359 |
     |-------|
 80. |   374 |
 88. |   416 |
 91. |   424 |
103. |   457 |
111. |   482 |
     |-------|
116. |   601 |
121. |   614 |
137. |   671 |
138. |   678 |
157. |   732 |
     |-------|
161. |   754 |
162. |   761 |
166. |   769 |
168. |   774 |
170. |   777 |
     |-------|
171. |   782 |
172. |   786 |
174. |   902 |
178. |   918 |
184. |   936 |
     |-------|
185. |   946 |
192. |   965 |
195. |   972 |
196. |   974 |
198. |   984 |
     |-------|
203. |   993 |
206. |  1003 |
219. |  1063 |
220. |  1064 |
230. |  1085 |
     |-------|
236. |  1202 |
245. |  1214 |
269. |  1238 |
293. |  1264 |
299. |  1270 |
     |-------|
310. |  1282 |
316. |  1288 |
331. |  1303 |
338. |  1310 |
358. |  1331 |
     |-------|
363. |  1337 |
368. |  1342 |
373. |  1347 |
398. |  1372 |
464. |  2051 |
     |-------|
465. |  2052 |
466. |  2053 |
467. |  2054 |
521. |  2121 |
     +-------+

. 
.  drop if _merge==1 
(69 observations deleted)

. 
.  * people with no family members i.e. live alone?

. 
. keep patid Member

. 
. collapse (count) Member, by(patid)

. 
. rename MemberID household

. 
. label variable household "number in household"

. 
. merge 1:1 patid using temp, update

    Result                           # of obs.
    -----------------------------------------
    not matched                            69
        from master                         0  (_merge==1)
        from using                         69  (_merge==2)

    matched                               452
        not updated                       452  (_merge==3)
        missing updated                     0  (_merge==4)
        nonmissing conflict                 0  (_merge==5)
    -----------------------------------------

. 
. noi di "Number of household members"
Number of household members

. 
. noi assert inlist(_merge,2,3)

. 
. replace household = 0 if _merge==2
(69 real changes made)

. 
. drop _merge

. 
. replace household = household +1 
(521 real changes made)

. 
. * to account for the participant as well

. 
.  noi tab household

  number in |
  household |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         69       13.24       13.24
          2 |        220       42.23       55.47
          3 |         97       18.62       74.09
          4 |         86       16.51       90.60
          5 |         34        6.53       97.12
          6 |         11        2.11       99.23
          7 |          3        0.58       99.81
          9 |          1        0.19      100.00
------------+-----------------------------------
      Total |        521      100.00

. 
.  gen household_group = string(household)

. 
.  replace household_group = "5+" if household>=5
variable household_group was str1 now str2
(49 real changes made)

. 
. * add catagory for if in shared housing

. 
.  replace household_group = "shared accomodation" if strpos(residence_group, "shared")
variable household_group was str2 now str19
(8 real changes made)

. 
.   noi tab household household_group, m

 number in |                    household_group
 household |         1          2          3          4         5+ |     Total
-----------+-------------------------------------------------------+----------
         1 |        61          0          0          0          0 |        69 
         2 |         0        220          0          0          0 |       220 
         3 |         0          0         97          0          0 |        97 
         4 |         0          0          0         86          0 |        86 
         5 |         0          0          0          0         34 |        34 
         6 |         0          0          0          0         11 |        11 
         7 |         0          0          0          0          3 |         3 
         9 |         0          0          0          0          1 |         1 
-----------+-------------------------------------------------------+----------
     Total |        61        220         97         86         49 |       521 


           | household_
 number in |   group
 household | shared .. |     Total
-----------+-----------+----------
         1 |         8 |        69 
         2 |         0 |       220 
         3 |         0 |        97 
         4 |         0 |        86 
         5 |         0 |        34 
         6 |         0 |        11 
         7 |         0 |         3 
         9 |         0 |         1 
-----------+-----------+----------
     Total |         8 |       521 


. 
.  noi tab residence household_group, m

                      |               household_group
      residence_group |         1          2          3          4 |     Total
----------------------+--------------------------------------------+----------
          No response |        60          0          0          0 |        60 
own home/None of th.. |         1        220         97         86 |       453 
          shared home |         0          0          0          0 |         8 
----------------------+--------------------------------------------+----------
                Total |        61        220         97         86 |       521 


                      |    household_group
      residence_group |        5+  shared .. |     Total
----------------------+----------------------+----------
          No response |         0          0 |        60 
own home/None of th.. |        49          0 |       453 
          shared home |         0          8 |         8 
----------------------+----------------------+----------
                Total |        49          8 |       521 


. tab household_group LiveAlone

                    |       LiveAlone
    household_group |        No        Yes |     Total
--------------------+----------------------+----------
                  1 |         0         61 |        61 
                  2 |       218          2 |       220 
                  3 |        96          1 |        97 
                  4 |        86          0 |        86 
                 5+ |        48          1 |        49 
shared accomodation |         8          0 |         8 
--------------------+----------------------+----------
              Total |       456         65 |       521 


.  streg tvc(prev_anti) ,distribution(weibull)
data not st 
r(119);

. 
. 
. 
. noi di "gain of spatype distinct from initial spatypes"
gain of spatype distinct from initial spatypes

. 
. 
. 
. use "E:\users\amy.mason\staph_carriage\Datasets\clean_data4.dta", clear

. 
. assert _N==8949

. 
. 
. 
. gsort patid -newspa_init timepoint

. 
. by patid: gen firstevent = timepoint[1] if newspa_i[1]==1
(4,743 missing values generated)

. 
. by patid: replace firstevent = timepoint[_N] if newspa_i[1]==0
(4743 real changes made)

. 
. assert firstevent!=.

. 
. drop if timepoint > firstevent
(1,825 observations deleted)

. 
. drop if timepoint==0
(521 observations deleted)

. 
. stset timepoint, fail(newspa_init) id(patid)

                id:  patid
     failure event:  newspa_init != 0 & newspa_init < .
obs. time interval:  (timepoint[_n-1], timepoint]
 exit on or before:  failure

------------------------------------------------------------------------------
       6603  total observations
          0  exclusions
------------------------------------------------------------------------------
       6603  observations remaining, representing
        521  subjects
        219  failures in single-failure-per-subject data
      14358  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        84

. 
. * NOTE GAIN MARKER = newspa_init; it is not single failure per person, but stata deals 
> with that

. 
. assert _st==1

. 
. 
. 
. *** 

. 
. noi di "Kaplan-Meier"
Kaplan-Meier

. 
. 
. 
. sts graph, by(Follow) risktable

         failure _d:  newspa_init
   analysis time _t:  timepoint
                 id:  patid

. 
. graph save Graph "E:\users\amy.mason\staph_carriage\Graphs\KM_gain.gph", replace
(file E:\users\amy.mason\staph_carriage\Graphs\KM_gain.gph saved)

. 
. graph export "E:\users\amy.mason\staph_carriage\Graphs\KM_gain.eps", as(eps) preview(of
> f) replace
(file E:\users\amy.mason\staph_carriage\Graphs\KM_gain.eps written in EPS format)

. 
. 
. 
. * log-cumulative graph of survival

. 
. noi di "Log-cumulative graph of survival"
Log-cumulative graph of survival

. 
. 
. 
. stphplot, by(Follow)

         failure _d:  newspa_init
   analysis time _t:  timepoint
                 id:  patid

. 
. graph save Graph "E:\users\amy.mason\staph_carriage\Graphs\log_cum_gain.gph", replace
(file E:\users\amy.mason\staph_carriage\Graphs\log_cum_gain.gph saved)

. 
. graph export "E:\users\amy.mason\staph_carriage\Graphs\log_cum_gain.eps", as(eps) previ
> ew(off) replace
(file E:\users\amy.mason\staph_carriage\Graphs\log_cum_gain.eps written in EPS format)

. 
. 
. 
. * linear in log-log graph? less so than shorter estimates (though not parellel)

. 
. 
. 
. *consider a Weibull model

. 
. 
. 
. streg, distribution(weibull)

         failure _d:  newspa_init
   analysis time _t:  timepoint
                 id:  patid

Fitting constant-only model:

Iteration 0:   log likelihood =  -520.5914
Iteration 1:   log likelihood = -513.79667
Iteration 2:   log likelihood = -513.77302
Iteration 3:   log likelihood = -513.77302

Fitting full model:
Iteration 0:   log likelihood = -513.77302  

Weibull regression -- log relative-hazard form 

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(0)       =       -0.00
Log likelihood  =   -513.77302                  Prob > chi2      =           .

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _cons |   .0065073   .0016593   -19.74   0.000     .0039477    .0107263
-------------+----------------------------------------------------------------
       /ln_p |   .2138733    .054945     3.89   0.000      .106183    .3215636
-------------+----------------------------------------------------------------
           p |   1.238466   .0680475                      1.112025    1.379283
         1/p |   .8074507   .0443654                      .7250145    .8992601
------------------------------------------------------------------------------

. streg tvc(prev_anti),distribution(weibull)
variable tvc not found
r(111);

. help streg

.  qui streg ,distribution(weibull) anc(i.`var')
nothing found where name expected
r(198);

. 
.    noi streg

Weibull regression -- log relative-hazard form 

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(0)       =       -0.00
Log likelihood  =   -513.77302                  Prob > chi2      =           .

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _cons |   .0065073   .0016593   -19.74   0.000     .0039477    .0107263
-------------+----------------------------------------------------------------
       /ln_p |   .2138733    .054945     3.89   0.000      .106183    .3215636
-------------+----------------------------------------------------------------
           p |   1.238466   .0680475                      1.112025    1.379283
         1/p |   .8074507   .0443654                      .7250145    .8992601
------------------------------------------------------------------------------

. noi tabstat age , c(s) s(n median iqr p75 p90 p95 p99 max)

    variable |         N       p50       iqr       p75       p90       p95       p99
-------------+----------------------------------------------------------------------
         age |      6603        57        25        66        75        79        87
------------------------------------------------------------------------------------

    variable |       max
-------------+----------
         age |        93
------------------------

. noi tabstat age , c(s) s(n median iqr  min p75 p90 p95 p99 max)

    variable |         N       p50       iqr       min       p75       p90       p95
-------------+----------------------------------------------------------------------
         age |      6603        57        25        16        66        75        79
------------------------------------------------------------------------------------

    variable |       p99       max
-------------+--------------------
         age |        87        93
----------------------------------

. cap mkspline temp=age, cubic nknots(3)

. assert _rc~=0
assertion is false
r(9);

. foreach var of varlist age  {
  2. 
.    centile `var', normal centile(50)
  3. 
.    gen `var'c=`var'-r(c_1)
  4. 
.    cap mkspline `var'C_=`var'c, cubic nknots(3) 
  5. 
.    cap mkspline `var'c_=`var'c, cubic nknots(4) 
  6. 
.    
. 
.    * variable indexed _1 is identical to agec, so can drop agec, so variables indexed _
> X are the spline terms
. 
.    drop `var'c
  7. 
.    noi summ `var'*
  8. 
. }

                                   -- Normal, based on observed centiles --
    Variable |       Obs  Percentile    Centile        [95% Conf. Interval]
-------------+-------------------------------------------------------------
         age |     6,603         50          57        56.42834    57.57166

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      6,603     52.8587    18.43927         16         93
      ageC_1 |      6,603   -4.141299    18.43927        -41         36
      ageC_2 |      6,603    20.74564    18.94438          0   86.85714
      agec_1 |      6,603   -4.141299    18.43927        -41         36
      agec_2 |      6,603    19.37828    18.13765          0   86.55738
-------------+---------------------------------------------------------
      agec_3 |      6,603     .991826    1.675529          0   9.328137

. sort age

. drop temp*

. * small program to visualise main spline effects to add model fitting

. 
. cap prog drop PlotSpline

. 
. prog def PlotSpline
  1. 
. qui {
  2. 
.    syntax, varstub(string) knots(integer)
  3. 
.    preserve
  4. 
.    bysort `varstub': drop if _n>1
  5. 
.    if `knots'==3 gen plot = `varstub'C_1*_b[`varstub'C_1]+`varstub'C_2*_b[`varstub'C_2]
  6. 
.    else if `knots'==4 gen plot = `varstub'c_1*_b[`varstub'c_1]+`varstub'c_2*_b[`varstub
> 'c_2]+`varstub'c_3*_b[`varstub'c_3]
  7. 
.    else if `knots'==5 gen plot = `varstub'd_1*_b[`varstub'd_1]+`varstub'd_2*_b[`varstub
> 'd_2]+`varstub'd_3*_b[`varstub'd_3]+`varstub'd_4*_b[`varstub'd_4]
  8. 
.    else if `knots'==6 gen plot = `varstub'e_1*_b[`varstub'e_1]+`varstub'e_2*_b[`varstub
> 'e_2]+`varstub'e_3*_b[`varstub'e_3]+`varstub'e_4*_b[`varstub'e_4]+`varstub'e_5*_b[`vars
> tub'e_5]
  9. 
.    else err 666
 10. 
.    scatter plot `varstub', sort
 11. 
. }
 12. 
. end

. foreach var of varlist age {
  2. 
.    noi di _n _dup(80) "=" _n "`var'" _n _dup(80) "=" 
  3. 
.    noi tabstat `var', by(died30) c(s) s(n median p25 p75 min max)
  4. 
. 
. 
.    qui stcox c.`var'
  5. 
.    noi stcox
  6. 
.    est store uv_`var'lin
  7. 
.    scalar biclin=-2*e(ll)+e(df_m)*ln(e(N))
  8. 
.    
. 
.    qui stcox c.`var'C_1 c.`var'C_2
  9. 
.    noi stcox
 10. 
.    est store uv_`var'3k
 11. 
.    scalar bic3k=-2*e(ll)+e(df_m)*ln(e(N))
 12. 
.    PlotSpline, varstub(`var') knots(3)
 13. 
.    graph export graphs\uv\uv_`var'3k.tif, replace
 14. 
.    
. 
.    qui stcox c.`var'c_1 c.`var'c_2 c.`var'c_3
 15. 
.    noi stcox
 16. 
.    est store uv_`var'4k
 17. 
.    scalar bic4k=-2*e(ll)+e(df_m)*ln(e(N))
 18. 
.    PlotSpline, varstub(`var') knots(4)
 19. 
.    graph export graphs\uv\uv_`var'4k.tif, replace
 20. 
.    
. 
.    
. 
. }

================================================================================
age
================================================================================
variable died30 not found
(error in option by())
r(111);

. foreach var of varlist age {
  2. 
.    noi di _n _dup(80) "=" _n "`var'" _n _dup(80) "=" 
  3. 
.    noi tabstat `var', by(newspa_init) c(s) s(n median p25 p75 min max)
  4. 
.    qui stcox c.`var'
  5. 
.    noi stcox
  6. 
.    est store uv_`var'lin
  7. 
.    scalar biclin=-2*e(ll)+e(df_m)*ln(e(N))
  8. 
.    
. 
.    qui stcox c.`var'C_1 c.`var'C_2
  9. 
.    noi stcox
 10. 
.    est store uv_`var'3k
 11. 
.    scalar bic3k=-2*e(ll)+e(df_m)*ln(e(N))
 12. 
.    PlotSpline, varstub(`var') knots(3)
 13. 
.    graph export graphs\uv\uv_`var'3k.tif, replace
 14. 
.    
. 
.    qui stcox c.`var'c_1 c.`var'c_2 c.`var'c_3
 15. 
.    noi stcox
 16. 
.    est store uv_`var'4k
 17. 
.    scalar bic4k=-2*e(ll)+e(df_m)*ln(e(N))
 18. 
.    PlotSpline, varstub(`var') knots(4)
 19. 
.    graph export graphs\uv\uv_`var'4k.tif, replace
 20. 
.    
. 
.    
. 
. }

================================================================================
age
================================================================================

Summary for variables: age
     by categories of: newspa_init 

newspa_init |         N       p50       p25       p75       min       max
------------+------------------------------------------------------------
          0 |      6384        58        42        66        16        93
          1 |       219        46        24        62        16        87
------------+------------------------------------------------------------
      Total |      6603        57        41        66        16        93
-------------------------------------------------------------------------

Cox regression -- Breslow method for ties

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(1)       =       38.41
Log likelihood  =   -1213.4184                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |     .97792   .0035158    -6.21   0.000     .9710533    .9848351
------------------------------------------------------------------------------

Cox regression -- Breslow method for ties

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(2)       =       43.80
Log likelihood  =    -1210.722                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      ageC_1 |   .9619974   .0075592    -4.93   0.000     .9472951    .9769278
      ageC_2 |   1.020841   .0088843     2.37   0.018     1.003576    1.038404
------------------------------------------------------------------------------
(note: file graphs\uv\uv_age3k.tif not found)
file graphs\uv\uv_age3k.tif could not be opened
r(603);

. cd "E:\users\amy.mason\staph_carriage\Graphs"
E:\users\amy.mason\staph_carriage\Graphs

. 
. * age, nprioradm: test 3-6 knot splines, 7 only for age

. 
. foreach var of varlist age {
  2. 
.    noi di _n _dup(80) "=" _n "`var'" _n _dup(80) "=" 
  3. 
.    noi tabstat `var', by(newspa_init) c(s) s(n median p25 p75 min max)
  4. 
. 
. 
.    qui stcox c.`var'
  5. 
.    noi stcox
  6. 
.    est store uv_`var'lin
  7. 
.    scalar biclin=-2*e(ll)+e(df_m)*ln(e(N))
  8. 
.    
. 
.    qui stcox c.`var'C_1 c.`var'C_2
  9. 
.    noi stcox
 10. 
.    est store uv_`var'3k
 11. 
.    scalar bic3k=-2*e(ll)+e(df_m)*ln(e(N))
 12. 
.    PlotSpline, varstub(`var') knots(3)
 13. 
.    graph export uv_`var'3k.tif, replace
 14. 
.    
. 
.    qui stcox c.`var'c_1 c.`var'c_2 c.`var'c_3
 15. 
.    noi stcox
 16. 
.    est store uv_`var'4k
 17. 
.    scalar bic4k=-2*e(ll)+e(df_m)*ln(e(N))
 18. 
.    PlotSpline, varstub(`var') knots(4)
 19. 
.    graph export uv_`var'4k.tif, replace
 20. 
.    
. 
.    
. 
. }

================================================================================
age
================================================================================

Summary for variables: age
     by categories of: newspa_init 

newspa_init |         N       p50       p25       p75       min       max
------------+------------------------------------------------------------
          0 |      6384        58        42        66        16        93
          1 |       219        46        24        62        16        87
------------+------------------------------------------------------------
      Total |      6603        57        41        66        16        93
-------------------------------------------------------------------------

Cox regression -- Breslow method for ties

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(1)       =       38.41
Log likelihood  =   -1213.4184                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |     .97792   .0035158    -6.21   0.000     .9710533    .9848351
------------------------------------------------------------------------------

Cox regression -- Breslow method for ties

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(2)       =       43.80
Log likelihood  =    -1210.722                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      ageC_1 |   .9619974   .0075592    -4.93   0.000     .9472951    .9769278
      ageC_2 |   1.020841   .0088843     2.37   0.018     1.003576    1.038404
------------------------------------------------------------------------------
(note: file uv_age3k.tif not found)
(file uv_age3k.tif written in TIFF format)

Cox regression -- Breslow method for ties

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(3)       =       43.98
Log likelihood  =   -1210.6335                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      agec_1 |   .9674296   .0119779    -2.67   0.007     .9442359     .991193
      agec_2 |   1.008348    .027502     0.30   0.761     .9558611    1.063718
      agec_3 |   1.097453   .2139743     0.48   0.633     .7489002    1.608228
------------------------------------------------------------------------------
(note: file uv_age4k.tif not found)
(file uv_age4k.tif written in TIFF format)

. graph use "E:\users\amy.mason\staph_carriage\Graphs\uv_age3k.tif"
file not a Stata .gph file
r(610);

. foreach var of varlist age {
  2. 
.    noi di _n _dup(80) "=" _n "`var'" _n _dup(80) "=" 
  3. 
.    noi tabstat `var', by(newspa_init) c(s) s(n median p25 p75 min max)
  4. 
. 
. 
.    qui stcox c.`var'
  5. 
.    noi stcox
  6. 
.    est store uv_`var'lin
  7. 
.    scalar biclin=-2*e(ll)+e(df_m)*ln(e(N))
  8. 
.    
. 
.    qui stcox c.`var'C_1 c.`var'C_2
  9. 
.    noi stcox
 10. 
.    est store uv_`var'3k
 11. 
.    scalar bic3k=-2*e(ll)+e(df_m)*ln(e(N))
 12. 
.    PlotSpline, varstub(`var') knots(3)
 13. 
.    graph export uv_`var'3k.tif, replace
 14. 
.    
. 
.    qui stcox c.`var'c_1 c.`var'c_2 c.`var'c_3
 15. 
.    noi stcox
 16. 
.    est store uv_`var'4k
 17. 
.    scalar bic4k=-2*e(ll)+e(df_m)*ln(e(N))
 18. 
.    PlotSpline, varstub(`var') knots(4)
 19. 
.    graph export uv_`var'4k.tif, replace
 20. 
.    
. 
.    qui stcox c.`var'd_1 c.`var'd_2 c.`var'd_3 c.`var'd_4
 21. 
.    noi stcox
 22. 
.    est store uv_`var'5k
 23. 
.    scalar bic5k=-2*e(ll)+e(df_m)*ln(e(N))
 24. 
.    PlotSpline, varstub(`var') knots(5)
 25. 
.    graph export uv_`var'5k.tif, replace
 26. 
.    
. 
.    cap confirm var `var'e_1
 27. 
.    if _rc==0 {
 28. 
.    qui stcox c.`var'e_1 c.`var'e_2 c.`var'e_3 c.`var'e_4 c.`var'e_5
 29. 
.    noi stcox
 30. 
.    est store uv_`var'6k
 31. 
.    scalar bic6k=-2*e(ll)+e(df_m)*ln(e(N))
 32. 
.    PlotSpline, varstub(`var') knots(6)
 33. 
.   graph export uv_`var'6k.tif, replace
 34. 
.    
. 
.   assert bic5k<biclin & bic5k<bic3k & bic5k<bic4k & bic5k<bic6k
 35. 
.    
. 
. }
 36. 
. }

================================================================================
age
================================================================================

Summary for variables: age
     by categories of: newspa_init 

newspa_init |         N       p50       p25       p75       min       max
------------+------------------------------------------------------------
          0 |      6384        58        42        66        16        93
          1 |       219        46        24        62        16        87
------------+------------------------------------------------------------
      Total |      6603        57        41        66        16        93
-------------------------------------------------------------------------

Cox regression -- Breslow method for ties

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(1)       =       38.41
Log likelihood  =   -1213.4184                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |     .97792   .0035158    -6.21   0.000     .9710533    .9848351
------------------------------------------------------------------------------

Cox regression -- Breslow method for ties

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(2)       =       43.80
Log likelihood  =    -1210.722                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      ageC_1 |   .9619974   .0075592    -4.93   0.000     .9472951    .9769278
      ageC_2 |   1.020841   .0088843     2.37   0.018     1.003576    1.038404
------------------------------------------------------------------------------
(file uv_age3k.tif written in TIFF format)

Cox regression -- Breslow method for ties

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(3)       =       43.98
Log likelihood  =   -1210.6335                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      agec_1 |   .9674296   .0119779    -2.67   0.007     .9442359     .991193
      agec_2 |   1.008348    .027502     0.30   0.761     .9558611    1.063718
      agec_3 |   1.097453   .2139743     0.48   0.633     .7489002    1.608228
------------------------------------------------------------------------------
(file uv_age4k.tif written in TIFF format)
variable aged_1 not found
r(111);

. foreach var of varlist age  {
  2. 
.    centile `var', normal centile(50)
  3. 
.    gen `var'c=`var'-r(c_1)
  4. 
.    cap mkspline `var'C_=`var'c, cubic nknots(3) 
  5. 
.    cap mkspline `var'c_=`var'c, cubic nknots(4) 
  6. 
.     cap mkspline `var'd_=`var'c, cubic nknots(5) 
  7. 
. cap mkspline `var'e_=`var'c, cubic nknots(6)
  8. 
.    
. 
.    * variable indexed _1 is identical to agec, so can drop agec, so variables indexed _
> X are the spline terms
. 
.    drop `var'c
  9. 
.    noi summ `var'*
 10. cd "E:\users\amy.mason\staph_carriage\Graphs"
 11. 
. * age, nprioradm: test 3-6 knot splines, 7 only for age
. 
. foreach var of varlist age {
 12. 
.    noi di _n _dup(80) "=" _n "`var'" _n _dup(80) "=" 
 13. 
.    noi tabstat `var', by(newspa_init) c(s) s(n median p25 p75 min max)
 14. 
. 
. 
.    qui stcox c.`var'
 15. 
.    noi stcox
 16. 
.    est store uv_`var'lin
 17. 
.    scalar biclin=-2*e(ll)+e(df_m)*ln(e(N))
 18. 
.    
. 
.    qui stcox c.`var'C_1 c.`var'C_2
 19. 
.    noi stcox
 20. 
.    est store uv_`var'3k
 21. 
.    scalar bic3k=-2*e(ll)+e(df_m)*ln(e(N))
 22. 
.    PlotSpline, varstub(`var') knots(3)
 23. 
.    graph export uv_`var'3k.tif, replace
 24. 
.    
. 
.    qui stcox c.`var'c_1 c.`var'c_2 c.`var'c_3
 25. 
.    noi stcox
 26. 
.    est store uv_`var'4k
 27. 
.    scalar bic4k=-2*e(ll)+e(df_m)*ln(e(N))
 28. 
.    PlotSpline, varstub(`var') knots(4)
 29. 
.    graph export uv_`var'4k.tif, replace
 30. 
.    
. 
.    qui stcox c.`var'd_1 c.`var'd_2 c.`var'd_3 c.`var'd_4
 31. 
.    noi stcox
 32. 
.    est store uv_`var'5k
 33. 
.    scalar bic5k=-2*e(ll)+e(df_m)*ln(e(N))
 34. 
.    PlotSpline, varstub(`var') knots(5)
 35. 
.    graph export uv_`var'5k.tif, replace
 36. 
.    
. 
.    cap confirm var `var'e_1
 37. 
.    if _rc==0 {
 38. 
.    qui stcox c.`var'e_1 c.`var'e_2 c.`var'e_3 c.`var'e_4 c.`var'e_5
 39. 
.    noi stcox
 40. 
.    est store uv_`var'6k
 41. 
.    scalar bic6k=-2*e(ll)+e(df_m)*ln(e(N))
 42. 
.    PlotSpline, varstub(`var') knots(6)
 43. 
.   graph export uv_`var'6k.tif, replace
 44. 
.    
. 
.   assert bic5k<biclin & bic5k<bic3k & bic5k<bic4k & bic5k<bic6k
 45. 
.    
. 
. }
 46. 
. }
 47. 
. }

                                   -- Normal, based on observed centiles --
    Variable |       Obs  Percentile    Centile        [95% Conf. Interval]
-------------+-------------------------------------------------------------
         age |     6,603         50          57        56.42834    57.57166

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |      6,603     52.8587    18.43927         16         93
      ageC_1 |      6,603   -4.141299    18.43927        -41         36
      ageC_2 |      6,603    20.74564    18.94438          0   86.85714
      agec_1 |      6,603   -4.141299    18.43927        -41         36
      agec_2 |      6,603    19.37828    18.13765          0   86.55738
-------------+---------------------------------------------------------
      agec_3 |      6,603     .991826    1.675529          0   9.328137
      aged_1 |      6,603   -4.141299    18.43927        -41         36
      aged_2 |      6,603    19.59525    18.59239          0   90.14754
      aged_3 |      6,603    2.367935    3.578655          0   19.58183
      aged_4 |      6,603    .2702113    .5981998          0   3.689331
-------------+---------------------------------------------------------
      agee_1 |      6,603   -4.141299    18.43927        -41         36
      agee_2 |      6,603    19.70774    18.84722          0   92.37705
      agee_3 |      6,603    3.727766    5.223112          0   28.29347
      agee_4 |      6,603    .6357216    1.291472          0   7.825853
      agee_5 |      6,603    .1230483    .3160135          0   2.089761
E:\users\amy.mason\staph_carriage\Graphs

================================================================================
age
================================================================================

Summary for variables: age
     by categories of: newspa_init 

newspa_init |         N       p50       p25       p75       min       max
------------+------------------------------------------------------------
--Break--
r(1);

. foreach var of varlist age {
  2. 
.    noi di _n _dup(80) "=" _n "`var'" _n _dup(80) "=" 
  3. 
.    noi tabstat `var', by(newspa_init) c(s) s(n median p25 p75 min max)
  4. 
. 
. 
.    qui stcox c.`var'
  5. 
.    noi stcox
  6. 
.    est store uv_`var'lin
  7. 
.    scalar biclin=-2*e(ll)+e(df_m)*ln(e(N))
  8. 
.    
. 
.    qui stcox c.`var'C_1 c.`var'C_2
  9. 
.    noi stcox
 10. 
.    est store uv_`var'3k
 11. 
.    scalar bic3k=-2*e(ll)+e(df_m)*ln(e(N))
 12. 
.    PlotSpline, varstub(`var') knots(3)
 13. 
.    graph export uv_`var'3k.tif, replace
 14. 
.    
. 
.    qui stcox c.`var'c_1 c.`var'c_2 c.`var'c_3
 15. 
.    noi stcox
 16. 
.    est store uv_`var'4k
 17. 
.    scalar bic4k=-2*e(ll)+e(df_m)*ln(e(N))
 18. 
.    PlotSpline, varstub(`var') knots(4)
 19. 
.    graph export uv_`var'4k.tif, replace
 20. 
.    
. 
.    qui stcox c.`var'd_1 c.`var'd_2 c.`var'd_3 c.`var'd_4
 21. 
.    noi stcox
 22. 
.    est store uv_`var'5k
 23. 
.    scalar bic5k=-2*e(ll)+e(df_m)*ln(e(N))
 24. 
.    PlotSpline, varstub(`var') knots(5)
 25. 
.    graph export uv_`var'5k.tif, replace
 26. 
.    
. 
.    cap confirm var `var'e_1
 27. 
.    if _rc==0 {
 28. 
.    qui stcox c.`var'e_1 c.`var'e_2 c.`var'e_3 c.`var'e_4 c.`var'e_5
 29. 
.    noi stcox
 30. 
.    est store uv_`var'6k
 31. 
.    scalar bic6k=-2*e(ll)+e(df_m)*ln(e(N))
 32. 
.    PlotSpline, varstub(`var') knots(6)
 33. 
.   graph export uv_`var'6k.tif, replace
 34. 
.    
. 
.   assert bic5k<biclin & bic5k<bic3k & bic5k<bic4k & bic5k<bic6k
 35. 
.    
. 
. }
 36. 
. 
. 
. }

================================================================================
age
================================================================================

Summary for variables: age
     by categories of: newspa_init 

newspa_init |         N       p50       p25       p75       min       max
------------+------------------------------------------------------------
          0 |      6384        58        42        66        16        93
          1 |       219        46        24        62        16        87
------------+------------------------------------------------------------
      Total |      6603        57        41        66        16        93
-------------------------------------------------------------------------

Cox regression -- Breslow method for ties

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(1)       =       38.41
Log likelihood  =   -1213.4184                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |     .97792   .0035158    -6.21   0.000     .9710533    .9848351
------------------------------------------------------------------------------

Cox regression -- Breslow method for ties

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(2)       =       43.80
Log likelihood  =    -1210.722                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      ageC_1 |   .9619974   .0075592    -4.93   0.000     .9472951    .9769278
      ageC_2 |   1.020841   .0088843     2.37   0.018     1.003576    1.038404
------------------------------------------------------------------------------
(file uv_age3k.tif written in TIFF format)

Cox regression -- Breslow method for ties

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(3)       =       43.98
Log likelihood  =   -1210.6335                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      agec_1 |   .9674296   .0119779    -2.67   0.007     .9442359     .991193
      agec_2 |   1.008348    .027502     0.30   0.761     .9558611    1.063718
      agec_3 |   1.097453   .2139743     0.48   0.633     .7489002    1.608228
------------------------------------------------------------------------------
(file uv_age4k.tif written in TIFF format)

Cox regression -- Breslow method for ties

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(4)       =       47.73
Log likelihood  =   -1208.7569                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      aged_1 |   .9876119    .016298    -0.76   0.450     .9561794    1.020078
      aged_2 |   .9140187   .0533345    -1.54   0.123     .8152411    1.024765
      aged_3 |   2.298301   .9592476     1.99   0.046     1.014236    5.208048
      aged_4 |    .097116   .1181158    -1.92   0.055     .0089543    1.053296
------------------------------------------------------------------------------
(note: file uv_age5k.tif not found)
(file uv_age5k.tif written in TIFF format)

Cox regression -- Breslow method for ties

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(5)       =       48.38
Log likelihood  =   -1208.4309                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      agee_1 |   .9877935   .0200648    -0.60   0.545     .9492397    1.027913
      agee_2 |   .9096569   .0897733    -0.96   0.337     .7496755    1.103779
      agee_3 |   1.533984   .9354127     0.70   0.483     .4642631    5.068478
      agee_4 |   1.535262   3.556857     0.19   0.853     .0163734    143.9545
      agee_5 |   .0299316   .1303652    -0.81   0.420     5.87e-06    152.5774
------------------------------------------------------------------------------
(note: file uv_age6k.tif not found)
(file uv_age6k.tif written in TIFF format)
assertion is false
r(9);

.  assert bic5k<biclin & bic5k<bic3k & bic5k<bic4k
assertion is false
r(9);

. display biclin
2435.632

. display bic3k
2439.0346

. display bic4k
2447.6529

. display ln(e(N))
8.7952794

. display bic5k
2452.6949

. foreach var of varlist age {
  2. 
.    noi di _n _dup(80) "=" _n "`var'" _n _dup(80) "=" 
  3. 
.    noi tabstat `var', by(newspa_init) c(s) s(n median p25 p75 min max)
  4. 
. 
. 
.    qui stcox c.`var'
  5. 
.    noi stcox
  6. 
.    est store uv_`var'lin
  7. 
.    scalar aiclin=-2*e(ll)-2*ln(e(N))
  8. 
.    
. 
.    qui stcox c.`var'C_1 c.`var'C_2
  9. 
.    noi stcox
 10. 
.    est store uv_`var'3k
 11. 
.    scalar aic3k=-2*e(ll)-2l*n(e(N))
 12. 
.    PlotSpline, varstub(`var') knots(3)
 13. 
.    graph export uv_`var'3k.tif, replace
 14. 
.    
. 
.    qui stcox c.`var'c_1 c.`var'c_2 c.`var'c_3
 15. 
.    noi stcox
 16. 
.    est store uv_`var'4k
 17. 
.    scalar aic4k=-2*e(ll)-2*ln(e(N))
 18. 
.    PlotSpline, varstub(`var') knots(4)
 19. 
.    graph export uv_`var'4k.tif, replace
 20. 
.    
. 
.    qui stcox c.`var'd_1 c.`var'd_2 c.`var'd_3 c.`var'd_4
 21. 
.    noi stcox
 22. 
.    est store uv_`var'5k
 23. 
.    scalar bic5k=-2*e(ll)-2*ln(e(N))
 24. 
.    PlotSpline, varstub(`var') knots(5)
 25. 
.    graph export uv_`var'5k.tif, replace
 26. 
.    
. }

================================================================================
age
================================================================================

Summary for variables: age
     by categories of: newspa_init 

newspa_init |         N       p50       p25       p75       min       max
------------+------------------------------------------------------------
          0 |      6384        58        42        66        16        93
          1 |       219        46        24        62        16        87
------------+------------------------------------------------------------
      Total |      6603        57        41        66        16        93
-------------------------------------------------------------------------

Cox regression -- Breslow method for ties

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(1)       =       38.41
Log likelihood  =   -1213.4184                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |     .97792   .0035158    -6.21   0.000     .9710533    .9848351
------------------------------------------------------------------------------

Cox regression -- Breslow method for ties

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(2)       =       43.80
Log likelihood  =    -1210.722                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      ageC_1 |   .9619974   .0075592    -4.93   0.000     .9472951    .9769278
      ageC_2 |   1.020841   .0088843     2.37   0.018     1.003576    1.038404
------------------------------------------------------------------------------
2l invalid name
r(198);

. cd "E:\users\amy.mason\staph_carriage\Graphs"
E:\users\amy.mason\staph_carriage\Graphs

. 
. * age, nprioradm: test 3-6 knot splines, 7 only for age

. 
. foreach var of varlist age {
  2. 
.    noi di _n _dup(80) "=" _n "`var'" _n _dup(80) "=" 
  3. 
.    noi tabstat `var', by(newspa_init) c(s) s(n median p25 p75 min max)
  4. 
. 
. 
.    qui stcox c.`var'
  5. 
.    noi stcox
  6. 
.    est store uv_`var'lin
  7. 
.    scalar aiclin=-2*e(ll)-2*ln(e(N))
  8. 
.    
. 
.    qui stcox c.`var'C_1 c.`var'C_2
  9. 
.    noi stcox
 10. 
.    est store uv_`var'3k
 11. 
.    scalar aic3k=-2*e(ll)-2*ln(e(N))
 12. 
.    PlotSpline, varstub(`var') knots(3)
 13. 
.    graph export uv_`var'3k.tif, replace
 14. 
.    
. 
.    qui stcox c.`var'c_1 c.`var'c_2 c.`var'c_3
 15. 
.    noi stcox
 16. 
.    est store uv_`var'4k
 17. 
.    scalar aic4k=-2*e(ll)-2*ln(e(N))
 18. 
.    PlotSpline, varstub(`var') knots(4)
 19. 
.    graph export uv_`var'4k.tif, replace
 20. 
.    
. 
.    qui stcox c.`var'd_1 c.`var'd_2 c.`var'd_3 c.`var'd_4
 21. 
.    noi stcox
 22. 
.    est store uv_`var'5k
 23. 
.    scalar bic5k=-2*e(ll)-2*ln(e(N))
 24. 
.    PlotSpline, varstub(`var') knots(5)
 25. 
.    graph export uv_`var'5k.tif, replace
 26. 
.    
. 
. 
. 
.    
. 
.  
. 
.    
. 
. }

================================================================================
age
================================================================================

Summary for variables: age
     by categories of: newspa_init 

newspa_init |         N       p50       p25       p75       min       max
------------+------------------------------------------------------------
          0 |      6384        58        42        66        16        93
          1 |       219        46        24        62        16        87
------------+------------------------------------------------------------
      Total |      6603        57        41        66        16        93
-------------------------------------------------------------------------

Cox regression -- Breslow method for ties

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(1)       =       38.41
Log likelihood  =   -1213.4184                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |     .97792   .0035158    -6.21   0.000     .9710533    .9848351
------------------------------------------------------------------------------

Cox regression -- Breslow method for ties

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(2)       =       43.80
Log likelihood  =    -1210.722                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      ageC_1 |   .9619974   .0075592    -4.93   0.000     .9472951    .9769278
      ageC_2 |   1.020841   .0088843     2.37   0.018     1.003576    1.038404
------------------------------------------------------------------------------
(file uv_age3k.tif written in TIFF format)

Cox regression -- Breslow method for ties

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(3)       =       43.98
Log likelihood  =   -1210.6335                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      agec_1 |   .9674296   .0119779    -2.67   0.007     .9442359     .991193
      agec_2 |   1.008348    .027502     0.30   0.761     .9558611    1.063718
      agec_3 |   1.097453   .2139743     0.48   0.633     .7489002    1.608228
------------------------------------------------------------------------------
(file uv_age4k.tif written in TIFF format)

Cox regression -- Breslow method for ties

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(4)       =       47.73
Log likelihood  =   -1208.7569                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      aged_1 |   .9876119    .016298    -0.76   0.450     .9561794    1.020078
      aged_2 |   .9140187   .0533345    -1.54   0.123     .8152411    1.024765
      aged_3 |   2.298301   .9592476     1.99   0.046     1.014236    5.208048
      aged_4 |    .097116   .1181158    -1.92   0.055     .0089543    1.053296
------------------------------------------------------------------------------
(file uv_age5k.tif written in TIFF format)

. 
. 
. 
. }
} is not a valid command name
r(199);

. display aiclin
2409.2462

. display aic3k
2403.8534

. display aic4k
2403.6765

. display aic5k
aic5k not found
r(111);

.  scalar aic5k=-2*e(ll)-2*ln(e(N))

. display aic5k
2399.9233

. * age, nprioradm: test 3-6 knot splines, 7 only for age

. 
. foreach var of varlist age {
  2. 
.    noi di _n _dup(80) "=" _n "`var'" _n _dup(80) "=" 
  3. 
.    noi tabstat `var', by(newspa_init) c(s) s(n median p25 p75 min max)
  4. 
. 
. 
.    qui stcox c.`var'
  5. 
.    noi stcox
  6. 
.    est store uv_`var'lin
  7. 
.    scalar biclin=-2*e(ll)-e(df_m)*ln(e(N))
  8. 
.    
. 
.    qui stcox c.`var'C_1 c.`var'C_2
  9. 
.    noi stcox
 10. 
.    est store uv_`var'3k
 11. 
.    scalar bic3k=-2*e(ll)-e(df_m)*ln(e(N))
 12. 
.    PlotSpline, varstub(`var') knots(3)
 13. 
.    graph export uv_`var'3k.tif, replace
 14. 
.    
. 
.    qui stcox c.`var'c_1 c.`var'c_2 c.`var'c_3
 15. 
.    noi stcox
 16. 
.    est store uv_`var'4k
 17. 
.    scalar bic4k=-2*e(ll)-e(df_m)*ln(e(N))
 18. 
.    PlotSpline, varstub(`var') knots(4)
 19. 
.    graph export uv_`var'4k.tif, replace
 20. 
.    
. 
.    qui stcox c.`var'd_1 c.`var'd_2 c.`var'd_3 c.`var'd_4
 21. 
.    noi stcox
 22. 
.    est store uv_`var'5k
 23. 
.    scalar bic5k=-2*e(ll)-e(df_m)*ln(e(N))
 24. 
.    PlotSpline, varstub(`var') knots(5)
 25. 
.    graph export uv_`var'5k.tif, replace
 26. 
.    
. 
. 
. 
.    
. 
.   *assert bic5k<biclin & bic5k<bic3k & bic5k<bic4k 
. 
.    
. 
. }

================================================================================
age
================================================================================

Summary for variables: age
     by categories of: newspa_init 

newspa_init |         N       p50       p25       p75       min       max
------------+------------------------------------------------------------
          0 |      6384        58        42        66        16        93
          1 |       219        46        24        62        16        87
------------+------------------------------------------------------------
      Total |      6603        57        41        66        16        93
-------------------------------------------------------------------------

Cox regression -- Breslow method for ties

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(1)       =       38.41
Log likelihood  =   -1213.4184                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |     .97792   .0035158    -6.21   0.000     .9710533    .9848351
------------------------------------------------------------------------------

Cox regression -- Breslow method for ties

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(2)       =       43.80
Log likelihood  =    -1210.722                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      ageC_1 |   .9619974   .0075592    -4.93   0.000     .9472951    .9769278
      ageC_2 |   1.020841   .0088843     2.37   0.018     1.003576    1.038404
------------------------------------------------------------------------------
(file uv_age3k.tif written in TIFF format)

Cox regression -- Breslow method for ties

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(3)       =       43.98
Log likelihood  =   -1210.6335                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      agec_1 |   .9674296   .0119779    -2.67   0.007     .9442359     .991193
      agec_2 |   1.008348    .027502     0.30   0.761     .9558611    1.063718
      agec_3 |   1.097453   .2139743     0.48   0.633     .7489002    1.608228
------------------------------------------------------------------------------
(file uv_age4k.tif written in TIFF format)

Cox regression -- Breslow method for ties

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(4)       =       47.73
Log likelihood  =   -1208.7569                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      aged_1 |   .9876119    .016298    -0.76   0.450     .9561794    1.020078
      aged_2 |   .9140187   .0533345    -1.54   0.123     .8152411    1.024765
      aged_3 |   2.298301   .9592476     1.99   0.046     1.014236    5.208048
      aged_4 |    .097116   .1181158    -1.92   0.055     .0089543    1.053296
------------------------------------------------------------------------------
(file uv_age5k.tif written in TIFF format)

. display biclin
2418.0415

. display bic3k
2403.8534

. display bic4k
2394.8812

. display bic5k
2382.3327

. display e(ll)
-1208.7569

. display e(df_m)
4

. display ln(e(N))
8.7952794

. foreach var of varlist age {
  2. 
.    noi di _n _dup(80) "=" _n "`var'" _n _dup(80) "=" 
  3. 
.    noi tabstat `var', by(newspa_init) c(s) s(n median p25 p75 min max)
  4. 
. 
. 
.    qui stcox c.`var'
  5. 
.    noi stcox
  6. 
.    est store uv_`var'lin
  7. 
.    scalar biclin=-2*e(ll)+e(df_m)*2
  8. 
.    
. 
.    qui stcox c.`var'C_1 c.`var'C_2
  9. 
.    noi stcox
 10. 
.    est store uv_`var'3k
 11. 
.    scalar bic3k=-2*e(ll)+e(df_m)*2
 12. 
.    PlotSpline, varstub(`var') knots(3)
 13. 
.    graph export uv_`var'3k.tif, replace
 14. 
.    
. 
.    qui stcox c.`var'c_1 c.`var'c_2 c.`var'c_3
 15. 
.    noi stcox
 16. 
.    est store uv_`var'4k
 17. 
.    scalar bic4k=-2*e(ll)+e(df_m)*2
 18. 
.    PlotSpline, varstub(`var') knots(4)
 19. 
.    graph export uv_`var'4k.tif, replace
 20. 
.    
. 
.    qui stcox c.`var'd_1 c.`var'd_2 c.`var'd_3 c.`var'd_4
 21. 
.    noi stcox
 22. 
.    est store uv_`var'5k
 23. 
.    scalar bic5k=-2*e(ll)+e(df_m)*2
 24. 
.    PlotSpline, varstub(`var') knots(5)
 25. 
.    graph export uv_`var'5k.tif, replace
 26. 
.    
. 
. 
. 
.    
. 
.   *assert bic5k<biclin & bic5k<bic3k & bic5k<bic4k 
. 
.    
. 
. }

================================================================================
age
================================================================================

Summary for variables: age
     by categories of: newspa_init 

newspa_init |         N       p50       p25       p75       min       max
------------+------------------------------------------------------------
          0 |      6384        58        42        66        16        93
          1 |       219        46        24        62        16        87
------------+------------------------------------------------------------
      Total |      6603        57        41        66        16        93
-------------------------------------------------------------------------

Cox regression -- Breslow method for ties

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(1)       =       38.41
Log likelihood  =   -1213.4184                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |     .97792   .0035158    -6.21   0.000     .9710533    .9848351
------------------------------------------------------------------------------

Cox regression -- Breslow method for ties

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(2)       =       43.80
Log likelihood  =    -1210.722                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      ageC_1 |   .9619974   .0075592    -4.93   0.000     .9472951    .9769278
      ageC_2 |   1.020841   .0088843     2.37   0.018     1.003576    1.038404
------------------------------------------------------------------------------
(file uv_age3k.tif written in TIFF format)

Cox regression -- Breslow method for ties

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(3)       =       43.98
Log likelihood  =   -1210.6335                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      agec_1 |   .9674296   .0119779    -2.67   0.007     .9442359     .991193
      agec_2 |   1.008348    .027502     0.30   0.761     .9558611    1.063718
      agec_3 |   1.097453   .2139743     0.48   0.633     .7489002    1.608228
------------------------------------------------------------------------------
(file uv_age4k.tif written in TIFF format)

Cox regression -- Breslow method for ties

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(4)       =       47.73
Log likelihood  =   -1208.7569                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      aged_1 |   .9876119    .016298    -0.76   0.450     .9561794    1.020078
      aged_2 |   .9140187   .0533345    -1.54   0.123     .8152411    1.024765
      aged_3 |   2.298301   .9592476     1.99   0.046     1.014236    5.208048
      aged_4 |    .097116   .1181158    -1.92   0.055     .0089543    1.053296
------------------------------------------------------------------------------
(file uv_age5k.tif written in TIFF format)

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. display biclin
2428.8367

. display bic3k
2425.444

. display bic4k
2427.267

. display bic5k
2425.5138

. * age, nprioradm: test 3-6 knot splines, 7 only for age

. 
. foreach var of varlist age {
  2. 
.    noi di _n _dup(80) "=" _n "`var'" _n _dup(80) "=" 
  3. 
.    noi tabstat `var', by(newspa_init) c(s) s(n median p25 p75 min max)
  4. 
. 
. 
.    qui stcox c.`var'
  5. 
.    noi stcox
  6. 
.    est store uv_`var'lin
  7. 
.    scalar biclin=-2*e(ll)+e(df_m)*2
  8. 
.    
. 
.    qui stcox c.`var'C_1 c.`var'C_2
  9. 
.    noi stcox
 10. 
.    est store uv_`var'3k
 11. 
.    scalar bic3k=-2*e(ll)+e(df_m)*2
 12. 
.    PlotSpline, varstub(`var') knots(3)
 13. 
.    graph export uv_`var'3k.tif, replace
 14. 
.    
. 
.    qui stcox c.`var'c_1 c.`var'c_2 c.`var'c_3
 15. 
.    noi stcox
 16. 
.    est store uv_`var'4k
 17. 
.    scalar bic4k=-2*e(ll)+e(df_m)*2
 18. 
.    PlotSpline, varstub(`var') knots(4)
 19. 
.    graph export uv_`var'4k.tif, replace
 20. 
.    
. 
.    qui stcox c.`var'd_1 c.`var'd_2 c.`var'd_3 c.`var'd_4
 21. 
.    noi stcox
 22. 
.    est store uv_`var'5k
 23. 
.    scalar bic5k=-2*e(ll)+e(df_m)*2
 24. 
.    PlotSpline, varstub(`var') knots(5)
 25. 
.    graph export uv_`var'5k.tif, replace
 26. 
.    
. 
. 
. 
.    
. 
.   assert bic3k<biclin & bic3k<bic4k & bic3k<bic5k 
 27. 
.    
. 
. }

================================================================================
age
================================================================================

Summary for variables: age
     by categories of: newspa_init 

newspa_init |         N       p50       p25       p75       min       max
------------+------------------------------------------------------------
          0 |      6384        58        42        66        16        93
          1 |       219        46        24        62        16        87
------------+------------------------------------------------------------
      Total |      6603        57        41        66        16        93
-------------------------------------------------------------------------

Cox regression -- Breslow method for ties

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(1)       =       38.41
Log likelihood  =   -1213.4184                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |     .97792   .0035158    -6.21   0.000     .9710533    .9848351
------------------------------------------------------------------------------

Cox regression -- Breslow method for ties

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(2)       =       43.80
Log likelihood  =    -1210.722                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      ageC_1 |   .9619974   .0075592    -4.93   0.000     .9472951    .9769278
      ageC_2 |   1.020841   .0088843     2.37   0.018     1.003576    1.038404
------------------------------------------------------------------------------
(file uv_age3k.tif written in TIFF format)

Cox regression -- Breslow method for ties

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(3)       =       43.98
Log likelihood  =   -1210.6335                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      agec_1 |   .9674296   .0119779    -2.67   0.007     .9442359     .991193
      agec_2 |   1.008348    .027502     0.30   0.761     .9558611    1.063718
      agec_3 |   1.097453   .2139743     0.48   0.633     .7489002    1.608228
------------------------------------------------------------------------------
(file uv_age4k.tif written in TIFF format)

Cox regression -- Breslow method for ties

No. of subjects =          521                  Number of obs    =       6,603
No. of failures =          219
Time at risk    =        14358
                                                LR chi2(4)       =       47.73
Log likelihood  =   -1208.7569                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      aged_1 |   .9876119    .016298    -0.76   0.450     .9561794    1.020078
      aged_2 |   .9140187   .0533345    -1.54   0.123     .8152411    1.024765
      aged_3 |   2.298301   .9592476     1.99   0.046     1.014236    5.208048
      aged_4 |    .097116   .1181158    -1.92   0.055     .0089543    1.053296
------------------------------------------------------------------------------
(file uv_age5k.tif written in TIFF format)

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. help stpm2

. stpm2
last estimates not found
r(301);

. stpm2 Follow
note: delayed entry models are being fitted
Use of either the df or knots option is compulsory
r(198);

. stpm2 Follow, df(1)
note: delayed entry models are being fitted
The scale must be specified

. stpm2 Follow, df(1) scale(hazard)
note: delayed entry models are being fitted

Iteration 0:   log likelihood = -514.51818  
Iteration 1:   log likelihood = -513.59707  
Iteration 2:   log likelihood = -513.59476  
Iteration 3:   log likelihood = -513.59476  

Log likelihood = -513.59476                     Number of obs     =      6,603

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
 FollowUpNeg |     .08237   .1376305     0.60   0.550    -.1873808    .3521207
       _rcs1 |   1.128476   .0624384    18.07   0.000     1.006099    1.250853
       _cons |  -1.776951   .1068017   -16.64   0.000    -1.986279   -1.567624
------------------------------------------------------------------------------

. stpm2, df(1) scale(hazard)
note: delayed entry models are being fitted

Iteration 0:   log likelihood = -514.54502  
Iteration 1:   log likelihood = -513.77429  
Iteration 2:   log likelihood = -513.77308  
Iteration 3:   log likelihood = -513.77308  

Log likelihood = -513.77308                     Number of obs     =      6,603

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
       _rcs1 |   1.132784   .0622409    18.20   0.000     1.010794    1.254774
       _cons |  -1.747309   .0939307   -18.60   0.000     -1.93141   -1.563208
------------------------------------------------------------------------------

. stpm2, df(2) scale(hazard)
note: delayed entry models are being fitted

Iteration 0:   log likelihood = -510.92003  
Iteration 1:   log likelihood = -504.65392  
Iteration 2:   log likelihood = -504.54754  
Iteration 3:   log likelihood =  -504.5475  

Log likelihood =  -504.5475                     Number of obs     =      6,603

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
       _rcs1 |   1.418637   .1049018    13.52   0.000     1.213033    1.624241
       _rcs2 |   .2021072   .0499329     4.05   0.000     .1042405     .299974
       _cons |  -1.873081   .1038842   -18.03   0.000     -2.07669   -1.669471
------------------------------------------------------------------------------

. stpm2, df(3) scale(hazard)
note: delayed entry models are being fitted

Iteration 0:   log likelihood =  -510.2511  
Iteration 1:   log likelihood = -504.18729  
Iteration 2:   log likelihood = -504.09014  
Iteration 3:   log likelihood = -504.09006  
Iteration 4:   log likelihood = -504.09006  

Log likelihood = -504.09006                     Number of obs     =      6,603

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
       _rcs1 |   1.428863   .1111331    12.86   0.000     1.211046     1.64668
       _rcs2 |   .2095625   .0667953     3.14   0.002     .0786461    .3404789
       _rcs3 |   .0141616   .0307738     0.46   0.645     -.046154    .0744771
       _cons |  -1.877447   .1046856   -17.93   0.000    -2.082627   -1.672267
------------------------------------------------------------------------------

. stpm2, df(3) scale(hazard)
note: delayed entry models are being fitted

Iteration 0:   log likelihood =  -510.2511  
Iteration 1:   log likelihood = -504.18729  
Iteration 2:   log likelihood = -504.09014  
Iteration 3:   log likelihood = -504.09006  
Iteration 4:   log likelihood = -504.09006  

Log likelihood = -504.09006                     Number of obs     =      6,603

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
       _rcs1 |   1.428863   .1111331    12.86   0.000     1.211046     1.64668
       _rcs2 |   .2095625   .0667953     3.14   0.002     .0786461    .3404789
       _rcs3 |   .0141616   .0307738     0.46   0.645     -.046154    .0744771
       _cons |  -1.877447   .1046856   -17.93   0.000    -2.082627   -1.672267
------------------------------------------------------------------------------

. stpm2, df(4) scale(hazard)
note: delayed entry models are being fitted

Iteration 0:   log likelihood = -505.27841  
Iteration 1:   log likelihood = -498.00808  
Iteration 2:   log likelihood = -497.79549  
Iteration 3:   log likelihood = -497.79521  
Iteration 4:   log likelihood = -497.79521  

Log likelihood = -497.79521                     Number of obs     =      6,603

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
       _rcs1 |   1.521068   .1247976    12.19   0.000     1.276469    1.765667
       _rcs2 |     .29702   .0836482     3.55   0.000     .1330724    .4609676
       _rcs3 |  -.0696134   .0385889    -1.80   0.071    -.1452463    .0060194
       _rcs4 |   .0684813   .0198324     3.45   0.001     .0296105     .107352
       _cons |   -1.91467   .1078101   -17.76   0.000    -2.125974   -1.703366
------------------------------------------------------------------------------

. stpm2, df(5) scale(hazard)
note: delayed entry models are being fitted

Iteration 0:   log likelihood = -505.45419  
Iteration 1:   log likelihood = -496.77874  
Iteration 2:   log likelihood = -496.44298  
Iteration 3:   log likelihood = -496.44216  
Iteration 4:   log likelihood = -496.44216  

Log likelihood = -496.44216                     Number of obs     =      6,603

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
       _rcs1 |    1.53672   .1305613    11.77   0.000     1.280824    1.792615
       _rcs2 |    .319141   .0927302     3.44   0.001     .1373931    .5008888
       _rcs3 |  -.0828383   .0437118    -1.90   0.058    -.1685119    .0028353
       _rcs4 |    .052632   .0217169     2.42   0.015     .0100676    .0951964
       _rcs5 |    .034016   .0141639     2.40   0.016     .0062552    .0617767
       _cons |  -1.916836    .109333   -17.53   0.000    -2.131125   -1.702548
------------------------------------------------------------------------------

. stpm2 Follow, tvc(Follow) df(5) scale(hazard) dftvc(3)
note: delayed entry models are being fitted

Iteration 0:   log likelihood = -504.77899  
Iteration 1:   log likelihood = -492.93183  
Iteration 2:   log likelihood = -492.05278  
Iteration 3:   log likelihood = -492.04988  
Iteration 4:   log likelihood = -492.04988  

Log likelihood = -492.04988                     Number of obs     =      6,603

--------------------------------------------------------------------------------------
                     |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
xb                   |
         FollowUpNeg |   .4485331   .2095346     2.14   0.032     .0378528    .8592134
               _rcs1 |   1.662225   .1857882     8.95   0.000     1.298087    2.026363
               _rcs2 |   .2897447    .128335     2.26   0.024     .0382128    .5412766
               _rcs3 |  -.0767909   .0520073    -1.48   0.140    -.1787233    .0251415
               _rcs4 |   .0572965   .0253708     2.26   0.024     .0075706    .1070223
               _rcs5 |   .0323971   .0142656     2.27   0.023      .004437    .0603573
   _rcs_FollowUpNeg1 |  -.2518339   .2320593    -1.09   0.278    -.7066618     .202994
   _rcs_FollowUpNeg2 |   .0760606   .1522768     0.50   0.617    -.2223965    .3745176
   _rcs_FollowUpNeg3 |  -.0244299   .0604254    -0.40   0.686    -.1428615    .0940016
               _cons |  -2.107105   .1521617   -13.85   0.000    -2.405337   -1.808874
--------------------------------------------------------------------------------------

. * test different df for baseline and tvc hazard with adm_we

. 
. forval i=1(1)10 {
  2. 
.    noi di _c "..`i'"
  3. 
.    qui stpm2 Follow, scale(hazard) df(`i')
  4. 
.    qui est store stpm_`i'
  5. 
.    forval j=1(1)`i' {
  6. 
.       qui stpm2 Follow, scale(hazard) df(`i') tvc(Follow) dftvc(`j')
  7. 
.       qui est store stpm_`i'_`j'
  8. 
.    }
  9. 
.    *noi est stats _all
. 
. }   
..1..2..3..4..5..6..7..8..9..10
. 
. noi est stats _all

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
   uv_agelin |      6,603 -1232.622  -1213.418       1    2428.837   2435.632
    uv_age3k |      6,603 -1232.622  -1210.722       2    2425.444   2439.035
    uv_age4k |      6,603 -1232.622  -1210.634       3    2427.267   2447.653
    uv_age5k |      6,603 -1232.622  -1208.757       4    2425.514   2452.695
    uv_age6k |      6,603 -1232.622  -1208.431       5    2426.862   2460.838
      stpm_1 |      6,603         .  -513.5948       3     1033.19   1053.575
    stpm_1_1 |      6,603         .  -510.2752       4     1028.55   1055.731
      stpm_2 |      6,603         .  -503.9494       4    1015.899    1043.08
    stpm_2_1 |      6,603         .  -500.1309       5    1010.262   1044.238
    stpm_2_2 |      6,603         .  -499.9662       6    1011.932   1052.704
      stpm_3 |      6,603         .  -503.4795       5    1016.959   1050.935
    stpm_3_1 |      6,603         .  -499.6472       6    1011.294   1052.066
    stpm_3_2 |      6,603         .  -499.5539       7    1013.108   1060.675
    stpm_3_3 |      6,603         .  -499.3681       8    1014.736   1069.098
      stpm_4 |      6,603         .  -497.2449       6     1006.49   1047.261
    stpm_4_1 |      6,603         .  -493.4254       7    1000.851   1048.418
    stpm_4_2 |      6,603         .  -493.3994       8    1002.799   1057.161
    stpm_4_3 |      6,603         .  -493.2704       9    1004.541   1065.698
    stpm_4_4 |      6,603         .  -493.0917      10    1006.183   1074.136
      stpm_5 |      6,603         .  -495.9418       7    1005.884   1053.451
    stpm_5_1 |      6,603         .  -492.1764       8    1000.353   1054.715
    stpm_5_2 |      6,603         .  -492.1449       9     1002.29   1063.447
    stpm_5_3 |      6,603         .  -492.0499      10      1004.1   1072.053
    stpm_5_4 |      6,603         .  -491.9453      11    1005.891   1080.639
    stpm_5_5 |      6,603         .   -491.465      12     1006.93   1088.473
      stpm_6 |      6,603         .  -496.1966       8    1008.393   1062.755
    stpm_6_1 |      6,603         .  -492.3489       9    1002.698   1063.855
    stpm_6_2 |      6,603         .  -492.3113      10    1004.623   1072.575
    stpm_6_3 |      6,603         .  -492.1728      11    1006.346   1081.094
    stpm_6_4 |      6,603         .  -491.9708      12    1007.942   1089.485
    stpm_6_5 |      6,603         .  -491.7938      13    1009.588   1097.926
    stpm_6_6 |      6,603         .  -491.8526      14    1011.705   1106.839
      stpm_7 |      6,603         .  -494.1672       9    1006.334   1067.492
    stpm_7_1 |      6,603         .  -490.7154      10    1001.431   1069.384
    stpm_7_2 |      6,603         .  -490.6423      11    1003.285   1078.033
    stpm_7_3 |      6,603         .  -490.4777      12    1004.955   1086.499
    stpm_7_4 |      6,603         .  -490.2842      13    1006.568   1094.907
    stpm_7_5 |      6,603         .  -490.1932      14    1008.386    1103.52
    stpm_7_6 |      6,603         .  -490.3572      15    1010.714   1112.644
    stpm_7_7 |      6,603         .  -488.3073      16    1008.615   1117.339
      stpm_8 |      6,603         .  -492.6636      10    1005.327    1073.28
    stpm_8_1 |      6,603         .  -489.5698      11     1001.14   1075.888
    stpm_8_2 |      6,603         .  -489.4876      12    1002.975   1084.519
    stpm_8_3 |      6,603         .  -489.2881      13    1004.576   1092.915
    stpm_8_4 |      6,603         .  -488.9586      14    1005.917   1101.051
    stpm_8_5 |      6,603         .  -488.7903      15    1007.581    1109.51
    stpm_8_6 |      6,603         .  -489.0023      16    1010.005   1118.729
    stpm_8_7 |      6,603         .  -486.4924      17    1006.985   1122.504
    stpm_8_8 |      6,603         .  -485.2639      18    1006.528   1128.843
      stpm_9 |      6,603         .  -492.6049      11     1007.21   1081.958
    stpm_9_1 |      6,603         .  -489.5336      12    1003.067    1084.61
    stpm_9_2 |      6,603         .  -489.3999      13      1004.8   1093.139
    stpm_9_3 |      6,603         .  -489.1106      14    1006.221   1101.355
    stpm_9_4 |      6,603         .   -488.921      15    1007.842   1109.771
    stpm_9_5 |      6,603         .  -488.7289      16    1009.458   1118.182
    stpm_9_6 |      6,603         .  -488.9571      17    1011.914   1127.434
    stpm_9_7 |      6,603         .  -487.0581      18    1010.116   1132.431
    stpm_9_8 |      6,603         .  -485.1692      19    1008.338   1137.449
    stpm_9_9 |      6,603         .  -485.1211      20    1010.242   1146.148
     stpm_10 |      6,603         .  -489.6121      12    1003.224   1084.768
   stpm_10_1 |      6,603         .  -486.9642      13    999.9284   1088.267
   stpm_10_2 |      6,603         .  -486.7769      14    1001.554   1096.688
   stpm_10_3 |      6,603         .  -486.6434      15    1003.287   1105.216
   stpm_10_4 |      6,603         .   -486.323      16    1004.646    1113.37
   stpm_10_5 |      6,603         .  -485.9234      17    1005.847   1121.366
   stpm_10_6 |      6,603         .  -486.2867      18    1008.573   1130.889
   stpm_10_7 |      6,603         .  -484.3079      19    1006.616   1135.726
   stpm_10_8 |      6,603         .  -482.6537      20    1005.307   1141.213
   stpm_10_9 |      6,603         .  -482.0578      21    1006.116   1148.816
  stpm_10_10 |      6,603         .  -480.9256      22    1005.851   1155.347
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

. 
. noi di _n "- minimum at df=10 dftvc=1"

- minimum at df=10 dftvc=1

. help est stats

. estimates replay stpm_3_2

-----------------------------------------------------------------------------------------
Model stpm_3_2
-----------------------------------------------------------------------------------------

Log likelihood = -499.55389                     Number of obs     =      6,603

--------------------------------------------------------------------------------------
                     |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
xb                   |
         FollowUpNeg |   .4744508   .2096601     2.26   0.024     .0635244    .8853771
               _rcs1 |   1.571641   .1634307     9.62   0.000     1.251323    1.891959
               _rcs2 |   .1976086   .0890651     2.22   0.027     .0230442     .372173
               _rcs3 |   .0079877   .0307011     0.26   0.795    -.0521853    .0681608
   _rcs_FollowUpNeg1 |  -.2810039   .2124216    -1.32   0.186    -.6973426    .1353348
   _rcs_FollowUpNeg2 |   .0436056   .1007263     0.43   0.665    -.1538144    .2410256
               _cons |  -2.078202   .1484196   -14.00   0.000    -2.369099   -1.787305
--------------------------------------------------------------------------------------

. estimates replay stpm_10_1

-----------------------------------------------------------------------------------------
Model stpm_10_1
-----------------------------------------------------------------------------------------

Log likelihood = -486.96421                     Number of obs     =      6,603

--------------------------------------------------------------------------------------
                     |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
xb                   |
         FollowUpNeg |   .4311691   .1880893     2.29   0.022     .0625208    .7998174
               _rcs1 |   1.844334   .1750778    10.53   0.000     1.501188     2.18748
               _rcs2 |    .493594   .1310458     3.77   0.000      .236749     .750439
               _rcs3 |  -.2024227   .0714038    -2.83   0.005    -.3423716   -.0624738
               _rcs4 |   .0402313   .0262299     1.53   0.125    -.0111784    .0916411
               _rcs5 |   .0071265   .0193317     0.37   0.712    -.0307629    .0450159
               _rcs6 |   .0421837   .0135031     3.12   0.002      .015718    .0686493
               _rcs7 |   .0239302   .0123451     1.94   0.053    -.0002657    .0481262
               _rcs8 |   .0252281   .0094509     2.67   0.008     .0067048    .0437515
               _rcs9 |  -.0026097   .0087415    -0.30   0.765    -.0197427    .0145233
              _rcs10 |  -.0028014   .0066708    -0.42   0.675     -.015876    .0102731
   _rcs_FollowUpNeg1 |  -.2894173   .1259067    -2.30   0.022      -.53619   -.0426447
               _cons |   -2.17406   .1467314   -14.82   0.000    -2.461649   -1.886472
--------------------------------------------------------------------------------------

. st* only predict for one observation per _t
varlist not allowed
r(101);

. 
. bysort _t: gen time=_t if _n==1
(6,562 missing values generated)

. 
. predict h0, hazard   at(Follow 0) zeros timevar(time)

. 
. predict h1, hazard   at(Follow 1) zeros timevar(time)

. * only predict for one observation per _t

. 
. bysort _t: gen time=_t if _n==1
variable time already defined
r(110);

. 
. predict h0, hazard   at(Follow 0) zeros timevar(time)
variable h0 already defined
r(110);

. 
. predict h1, hazard   at(Follow 1) zeros timevar(time)
variable h1 already defined
r(110);

. 
. predict s0, survival at(Follow 0) zeros timevar(time)

. 
. predict s1, survival at(Follow 1) zeros timevar(time)

. 
. predict hdiff,   hdiff1(Follow 0) hdiff2(Follow 1) ci  timevar(time)

. 
. predict sdiff,   sdiff1(Follow 0) sdiff2(Follow 1) ci  timevar(time)

. 
. noi di _n "On per 1 day scale"

On per 1 day scale

. 
. noi summ h0 h1 s0 s1 sdiff

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          h0 |         41    .0161931    .0069536   .0007466   .0366929
          h1 |         41    .0123774    .0083837   .0023348   .0307332
          s0 |         41    .5497464    .2384877    .260817   .9997057
          s1 |         41    .5409484    .1973703   .3576234   .9981926
       sdiff |         41     .008798    .0552214  -.0968064   .1011765

. 
. * rescale hazards per 100 rather than per 1 person-day(s)

. 
. for var h0 h1 hdiff*: replace X=X*100

->  replace h0=h0*100
(41 real changes made)

->  replace h1=h1*100
(41 real changes made)

->  replace hdiff=hdiff*100
(41 real changes made)

->  replace hdiff_lci=hdiff_lci*100
(41 real changes made)

->  replace hdiff_uci=hdiff_uci*100
(41 real changes made)

. 
. noi di _n "Rescaling hazards per 100 days"

Rescaling hazards per 100 days

. 
. noi summ h0 h1 s0 s1 sdiff

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          h0 |         41    1.619312    .6953604   .0746647   3.669292
          h1 |         41    1.237744    .8383709   .2334822   3.073319
          s0 |         41    .5497464    .2384877    .260817   .9997057
          s1 |         41    .5409484    .1973703   .3576234   .9981926
       sdiff |         41     .008798    .0552214  -.0968064   .1011765

. 
. scatter h0 h1 time, sort c(l l) s(i i) color(blue red) graphregion(color(white)) /*
option / not allowed
r(198);

. 
. */  ytitle(Gain of Spa-type risk per 100 person-days) ylabel(0(0.02).1, angle(0)) /*

. 
. */  xtitle(Days from first swab, size(medlarge)) xlabel(0(7)21 30) /*

. 
. */  legend(order( 1 "No carriage at t=0" 2 "Carriage at t=0") rows(3) size(small) ring(
> 0) position(12))

. 
. scatter h0 h1 time, sort c(l l) s(i i) color(blue red) graphregion(color(white))  ytitl
> e(Gain of Spa-type risk per 100 person-days) ylabel(0(0.02).1, angle(0)) xtitle(Days fr
> om first swab, size(medlarge)) xlabel(0(7)21 30) legend(order( 1 "No carriage at t=0" 2
>  "Carriage at t=0") rows(3) size(small) ring(0) position(12))

. scatter h0 h1 time, sort c(l l) s(i i) color(blue red) graphregion(color(white))  ytitl
> e(Gain of Spa-type risk per 100 person-days), angle(0)) xtitle(Days from first swab, si
> ze(medlarge)) legend(order( 1 "No carriage at t=0" 2 "Carriage at t=0") rows(3) size(sm
> all) ring(0) position(12))
0 invalid name
r(198);

. scatter h0 h1 time, sort c(l l) s(i i) color(blue red) graphregion(color(white))  ytitl
> e(Gain of Spa-type risk per 100 person-days), angle(0))  xtitle(Days from first swab, s
> ize(medlarge)) legend(order( 1 "No carriage at t=0" 2 "Carriage at t=0"))
0 invalid name
r(198);

. scatter h0 h1 time, sort c(l l) s(i i) color(blue red) graphregion(color(white))  ytitl
> e(Gain of Spa-type risk per 100 person-days) ylabel(0(0.02).1, angle(0)) xtitle(Days fr
> om first swab, size(medlarge)) xlabel(0(7)21 30) legend(order( 1 "No carriage at t=0" 2
>  "Carriage at t=0") rows(3) size(small) ring(0) position(12))

. scatter h0 h1 time, sort c(l l) s(i i) color(blue red) graphregion(color(white))  ytitl
> e(Gain of Spa-type risk per 100 person-days)  xtitle(Days from first swab, size(medlarg
> e)) legend(order( 1 "No carriage at t=0" 2 "Carriage at t=0") rows(3) size(small) ring(
> 0) position(12))

. scatter s0 s1 time, sort c(l l) s(i i) color(blue red) graphregion(color(white))   ytit
> le(Survival)   xtitle(Days from admission, size(medlarge))  legend(order( 1 "No carriag
> e at t=0" 2 "Carriage at t=0"))

. * identify df using aIC

. 
. cap est drop _all

. 
. * test different df for baseline and tvc hazard with adm_we

. 
. forval i=1(1)6{
  2. 
.    noi di _c "..`i'"
  3. 
.    qui stpm2 Follow, scale(hazard) df(`i')
  4. 
.    qui est store stpm_`i'
  5. 
.    forval j=1(1)`i' {
  6. 
.       qui stpm2 Follow, scale(hazard) df(`i') tvc(Follow) dftvc(`j')
  7. 
.       qui est store stpm_`i'_`j'
  8. 
.    }
  9. 
.    *noi est stats _all
. 
. }   
..1..2..3..4..5..6
. 
. noi est stats _all

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |        Obs  ll(null)  ll(model)      df         AIC        BIC
-------------+---------------------------------------------------------------
      stpm_1 |      6,603         .  -513.5948       3     1033.19   1053.575
    stpm_1_1 |      6,603         .  -510.2752       4     1028.55   1055.731
      stpm_2 |      6,603         .  -503.9494       4    1015.899    1043.08
    stpm_2_1 |      6,603         .  -500.1309       5    1010.262   1044.238
    stpm_2_2 |      6,603         .  -499.9662       6    1011.932   1052.704
      stpm_3 |      6,603         .  -503.4795       5    1016.959   1050.935
    stpm_3_1 |      6,603         .  -499.6472       6    1011.294   1052.066
    stpm_3_2 |      6,603         .  -499.5539       7    1013.108   1060.675
    stpm_3_3 |      6,603         .  -499.3681       8    1014.736   1069.098
      stpm_4 |      6,603         .  -497.2449       6     1006.49   1047.261
    stpm_4_1 |      6,603         .  -493.4254       7    1000.851   1048.418
    stpm_4_2 |      6,603         .  -493.3994       8    1002.799   1057.161
    stpm_4_3 |      6,603         .  -493.2704       9    1004.541   1065.698
    stpm_4_4 |      6,603         .  -493.0917      10    1006.183   1074.136
      stpm_5 |      6,603         .  -495.9418       7    1005.884   1053.451
    stpm_5_1 |      6,603         .  -492.1764       8    1000.353   1054.715
    stpm_5_2 |      6,603         .  -492.1449       9     1002.29   1063.447
    stpm_5_3 |      6,603         .  -492.0499      10      1004.1   1072.053
    stpm_5_4 |      6,603         .  -491.9453      11    1005.891   1080.639
    stpm_5_5 |      6,603         .   -491.465      12     1006.93   1088.473
      stpm_6 |      6,603         .  -496.1966       8    1008.393   1062.755
    stpm_6_1 |      6,603         .  -492.3489       9    1002.698   1063.855
    stpm_6_2 |      6,603         .  -492.3113      10    1004.623   1072.575
    stpm_6_3 |      6,603         .  -492.1728      11    1006.346   1081.094
    stpm_6_4 |      6,603         .  -491.9708      12    1007.942   1089.485
    stpm_6_5 |      6,603         .  -491.7938      13    1009.588   1097.926
    stpm_6_6 |      6,603         .  -491.8526      14    1011.705   1106.839
-----------------------------------------------------------------------------
               Note: N=Obs used in calculating BIC; see [R] BIC note.

. 
. noi di _n "- AIC minimum at df=10 dftvc=1"

- AIC minimum at df=10 dftvc=1

. estimates replay stpm_5_1

-----------------------------------------------------------------------------------------
Model stpm_5_1
-----------------------------------------------------------------------------------------

Log likelihood = -492.17639                     Number of obs     =      6,603

--------------------------------------------------------------------------------------
                     |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
xb                   |
         FollowUpNeg |   .4889472   .1861641     2.63   0.009     .1240723    .8538222
               _rcs1 |   1.717128   .1495913    11.48   0.000     1.423934    2.010321
               _rcs2 |   .3357619   .0931327     3.61   0.000      .153225    .5182987
               _rcs3 |  -.0876686   .0440904    -1.99   0.047    -.1740843   -.0012529
               _rcs4 |   .0523233   .0217516     2.41   0.016      .009691    .0949556
               _rcs5 |   .0324149   .0142817     2.27   0.023     .0044232    .0604066
   _rcs_FollowUpNeg1 |  -.3421876   .1245094    -2.75   0.006    -.5862216   -.0981536
               _cons |  -2.133343   .1409937   -15.13   0.000    -2.409686   -1.857001
--------------------------------------------------------------------------------------

.  drop h0 h1 s0 s1 hdiff hdiff_lci hdiff_uci sdiff sdiff_lci sdiff_uci

. 
. * only predict for one observation per _t

. 
. bysort _t: gen time=_t if _n==1
variable time already defined
r(110);

. 
. predict h0, hazard   at(Follow 0) zeros timevar(time)

. 
. predict h1, hazard   at(Follow 1) zeros timevar(time)

. 
. predict s0, survival at(Follow 0) zeros timevar(time)

. 
. predict s1, survival at(Follow 1) zeros timevar(time)

. 
. predict hdiff,   hdiff1(Follow 0) hdiff2(Follow 1) ci  timevar(time)

. 
. predict sdiff,   sdiff1(Follow 0) sdiff2(Follow 1) ci  timevar(time)

. 
. noi di _n "On per 1 day scale"

On per 1 day scale

. 
. noi summ h0 h1 s0 s1 sdiff

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          h0 |         41    .0151047     .005365   .0026818   .0250571
          h1 |         41    .0125718      .00812   .0032492   .0311779
          s0 |         41    .5563402    .2352304   .2841881   .9979061
          s1 |         41    .5405997    .1974419   .3522538   .9975467
       sdiff |         41    .0157405    .0511912  -.0680656   .0821462

. 
. * rescale hazards per 100 rather than per 1 person-day(s)

. 
. for var h0 h1 hdiff*: replace X=X*100

->  replace h0=h0*100
(41 real changes made)

->  replace h1=h1*100
(41 real changes made)

->  replace hdiff=hdiff*100
(41 real changes made)

->  replace hdiff_lci=hdiff_lci*100
(41 real changes made)

->  replace hdiff_uci=hdiff_uci*100
(41 real changes made)

. 
. noi di _n "Rescaling hazards per 100 days"

Rescaling hazards per 100 days

. 
. noi summ h0 h1 s0 s1 sdiff

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          h0 |         41    1.510467    .5364951   .2681777   2.505706
          h1 |         41    1.257182    .8119999   .3249159   3.117787
          s0 |         41    .5563402    .2352304   .2841881   .9979061
          s1 |         41    .5405997    .1974419   .3522538   .9975467
       sdiff |         41    .0157405    .0511912  -.0680656   .0821462

. 
. 
. 
. scatter h0 h1 time, sort c(l l) s(i i) color(blue red) graphregion(color(white)) /*
option / not allowed
r(198);

. scatter h0 h1 time, sort c(l l) s(i i) color(blue red) graphregion(color(white))

. scatter s0 s1 time, sort c(l l) s(i i) color(blue red) graphregion(color(white)) /*
option / not allowed
r(198);

. scatter s0 s1 time, sort c(l l) s(i i) color(blue red) graphregion(color(white))

. forval i=1(1)6{
  2. 
.    noi di _c "..`i'"
  3. 
.    qui stpm2 Follow, scale(hazard) df(`i') cure
  4. 
.    qui est store stpm_`i'_cure
  5. 
.    forval j=1(1)`i' {
  6. 
.       qui stpm2 Follow, scale(hazard) df(`i') tvc(Follow) dftvc(`j') cure
  7. 
.       qui est store stpm_`i'_`j'_cure
  8. 
.    }
  9. 
.    *noi est stats _all
. 
. }
..1DF must be between 3 and 11
DF must be between 3 and 11
..2DF must be between 3 and 11
DF must be between 3 and 11
DF must be between 3 and 11
..3
initial values not feasible
r(1400);

. help stpm2

. forval i=3(1)6{
  2. 
.    noi di _c "..`i'"
  3. 
.    qui stpm2 Follow, scale(hazard) df(`i') cure
  4. 
.    qui est store stpm_`i'_cure
  5. 
.    forval j=1(1)`i' {
  6. 
.       qui stpm2 Follow, scale(hazard) df(`i') tvc(Follow) dftvc(`j') cure
  7. 
.       qui est store stpm_`i'_`j'_cure
  8. 
.    }
  9. 
.    *noi est stats _all
. 
. }
..3
initial values not feasible
r(1400);

.  qui stpm2 Follow, scale(hazard) df(3) cure
initial values not feasible
r(1400);

. stpm2 Follow, scale(hazard) df(3) cure
note: delayed entry models are being fitted

initial values not feasible
r(1400);

.  stpm2 Follow, scale(hazard) df(3) tvc(Follow) dftvc(1) cure
note: delayed entry models are being fitted
varlist required
               st_data():  3598  Stata returned error
                orthgs():     -  function returned error
                 <istmt>:     -  function returned error
r(3598);

. stpm2 Follow, scale(hazard) knots(25 75) cure
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2, scale(hazard) knots(25 75) cure
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2, scale(hazard) knots(25 75)
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2 Follow, scale(hazard) knots(25 75)
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2 Follow, scale(hazard) df(3)
note: delayed entry models are being fitted

Iteration 0:   log likelihood = -509.62812  
Iteration 1:   log likelihood = -503.57702  
Iteration 2:   log likelihood =  -503.4796  
Iteration 3:   log likelihood = -503.47952  
Iteration 4:   log likelihood = -503.47952  

Log likelihood = -503.47952                     Number of obs     =      6,603

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
 FollowUpNeg |    .153558   .1383744     1.11   0.267    -.1176507    .4247668
       _rcs1 |   1.427743   .1111458    12.85   0.000     1.209902    1.645585
       _rcs2 |   .2127152   .0668552     3.18   0.001     .0816814     .343749
       _rcs3 |   .0160008   .0306475     0.52   0.602    -.0440671    .0760687
       _cons |  -1.935878   .1183161   -16.36   0.000    -2.167773   -1.703982
------------------------------------------------------------------------------

. stpm2 Follow, scale(hazard) knots(50 95)
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2 Follow, scale(hazard) knots(33 67)
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2 Follow, scale(hazard) df(2)
note: delayed entry models are being fitted

Iteration 0:   log likelihood = -510.40542  
Iteration 1:   log likelihood = -504.06569  
Iteration 2:   log likelihood =  -503.9494  
Iteration 3:   log likelihood = -503.94935  
Iteration 4:   log likelihood = -503.94935  

Log likelihood = -503.94935                     Number of obs     =      6,603

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
 FollowUpNeg |   .1518652   .1382701     1.10   0.272    -.1191392    .4228697
       _rcs1 |   1.419156   .1049705    13.52   0.000     1.213417    1.624894
       _rcs2 |   .2073393   .0500564     4.14   0.000     .1092306     .305448
       _cons |  -1.931373   .1178068   -16.39   0.000     -2.16227   -1.700476
------------------------------------------------------------------------------

. summ time

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        time |         41    42.78049     24.7987          2         84

. stpm2 Follow, scale(hazard) knots(0 33 66 84)
note: delayed entry models are being fitted
knots() invalid -- invalid numlist has missing values
r(127);

. stpm2 Follow, scale(hazard) knots(33 66) bknots(0 84)
note: delayed entry models are being fitted
knots() invalid -- invalid numlist has missing values
r(127);

. stpm2 Follow, scale(hazard) knots(33 66) bknots(2 84)
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2 Follow, scale(hazard) knots(33 67) knscale(centile)
note: delayed entry models are being fitted

Iteration 0:   log likelihood = -509.62812  
Iteration 1:   log likelihood = -503.57702  
Iteration 2:   log likelihood =  -503.4796  
Iteration 3:   log likelihood = -503.47952  
Iteration 4:   log likelihood = -503.47952  

Log likelihood = -503.47952                     Number of obs     =      6,603

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
 FollowUpNeg |    .153558   .1383744     1.11   0.267    -.1176507    .4247668
       _rcs1 |   1.427743   .1111458    12.85   0.000     1.209902    1.645585
       _rcs2 |   .2127152   .0668552     3.18   0.001     .0816814     .343749
       _rcs3 |   .0160008   .0306475     0.52   0.602    -.0440671    .0760687
       _cons |  -1.935878   .1183161   -16.36   0.000    -2.167773   -1.703982
------------------------------------------------------------------------------

. stpm2 Follow, scale(hazard) knots(33 67) knscale(centile) cure
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. 
. use "E:\users\amy.mason\staph_carriage\Datasets\clean_data4.dta", clear

. 
. assert _N==8949

. 
. gsort patid -newspa_init timepoint

. 
. by patid: gen firstevent = timepoint[1] if newspa_i[1]==1
(4,743 missing values generated)

. 
. by patid: replace firstevent = timepoint[_N] if newspa_i[1]==0
(4743 real changes made)

. 
. assert firstevent!=.

. 
. drop if timepoint > firstevent
(1,825 observations deleted)

. 
. drop if timepoint==0
(521 observations deleted)

. 
. stset timepoint, fail(newspa_init) id(patid)

                id:  patid
     failure event:  newspa_init != 0 & newspa_init < .
obs. time interval:  (timepoint[_n-1], timepoint]
 exit on or before:  failure

------------------------------------------------------------------------------
       6603  total observations
          0  exclusions
------------------------------------------------------------------------------
       6603  observations remaining, representing
        521  subjects
        219  failures in single-failure-per-subject data
      14358  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        84

. 
. assert _st==1

. 
. stpm2 Follow, scale(hazard) df(3) cure
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. logit Follow

Iteration 0:   log likelihood = -4412.0678  
Iteration 1:   log likelihood = -4412.0678  

Logistic regression                             Number of obs     =      6,603
                                                LR chi2(0)        =      -0.00
                                                Prob > chi2       =          .
Log likelihood = -4412.0678                     Pseudo R2         =    -0.0000

------------------------------------------------------------------------------
 FollowUpNeg |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _cons |  -.4525162   .0252454   -17.92   0.000    -.5019963   -.4030361
------------------------------------------------------------------------------

. matrix b=e(b)

. 
. xtlogit Follow, from(b)
must specify panelvar; use xtset
r(459);

. stpm2 Follow, scale(hazard) df(3) cure
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. help stpm2

. stpm2 Follow, scale(hazard) df(3) cure  lininit
note: delayed entry models are being fitted
could not find feasible values
r(491);

. stpm2 Follow, scale(hazard) df(3) cure  lininit showcons
note: delayed entry models are being fitted
could not find feasible values
r(491);

. stpm2 Follow, scale(hazard) df(3) cure  from{Follow b)
option from not allowed
r(198);

. stpm2 Follow, scale(hazard) df(3) cure  from{Follow -0.45)
option from not allowed
r(198);

. stpm2 Follow, scale(hazard) df(3) cure  from{Follow=-0.45)
option from not allowed
r(198);

. stpm2 Follow, scale(hazard) df(3) cure  from{b)
option from not allowed
r(198);

. stpm2 Follow, scale(hazard) df(3)  from{b)
option from not allowed
r(198);

. stpm2 Follow, scale(hazard) df(3)  maximise(from{b))
option maximise() not allowed
r(198);

. stpm2 Follow, scale(hazard) df(3) difficult
note: delayed entry models are being fitted

Iteration 0:   log likelihood = -509.62812  
Iteration 1:   log likelihood = -503.57702  
Iteration 2:   log likelihood =  -503.4796  
Iteration 3:   log likelihood = -503.47952  
Iteration 4:   log likelihood = -503.47952  

Log likelihood = -503.47952                     Number of obs     =      6,603

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
 FollowUpNeg |    .153558   .1383744     1.11   0.267    -.1176507    .4247668
       _rcs1 |   1.427743   .1111458    12.85   0.000     1.209902    1.645585
       _rcs2 |   .2127152   .0668552     3.18   0.001     .0816814     .343749
       _rcs3 |   .0160008   .0306475     0.52   0.602    -.0440671    .0760687
       _cons |  -1.935878   .1183161   -16.36   0.000    -2.167773   -1.703982
------------------------------------------------------------------------------

. stpm2 Follow, scale(hazard) df(3) hessian
note: delayed entry models are being fitted

-----------------------------------------------------------------------------------------
Iteration 0:
                                                   log likelihood = -509.62812
Hessian matrix:
           c1         c2         c3         c4         c5
r1  -212.5769
r2  -66.99299  -125.2933
r3    57.5817   37.00843  -48.14382
r4  -59.42679  -197.6347    24.0794  -597.2503
r5   162.0117   97.41717  -43.30646   267.8545  -373.6568
-----------------------------------------------------------------------------------------
Iteration 1:
                                                   log likelihood = -503.57702
Hessian matrix:
           c1         c2         c3         c4         c5
r1  -196.9826
r2  -71.71541  -117.8692
r3   55.70131   34.59075  -46.06534
r4  -62.78382  -197.4152   21.51823  -614.6348
r5   168.3318   107.2595  -41.06317   316.5672  -363.6224
-----------------------------------------------------------------------------------------
Iteration 2:
                                                   log likelihood =  -503.4796
Hessian matrix:
           c1         c2         c3         c4         c5
r1  -198.8047
r2   -71.1928  -117.6697
r3   56.31116   35.07944  -46.50439
r4  -60.18882  -193.3076   22.28442  -595.4993
r5   170.4647   103.6256  -41.77578   305.3866  -359.0105
-----------------------------------------------------------------------------------------
Iteration 3:
                                                   log likelihood = -503.47952
Hessian matrix:
           c1         c2         c3         c4         c5
r1  -198.7824
r2  -71.19637  -117.6224
r3   56.31119   35.07834      -46.5
r4  -60.16321  -193.1816   22.29586  -595.0264
r5   170.4712   103.5735  -41.78372   305.1879  -358.8281
-----------------------------------------------------------------------------------------
Iteration 4:
                                                   log likelihood = -503.47952
Hessian matrix:
           c1         c2         c3         c4         c5
r1  -198.7824
r2  -71.19637  -117.6224
r3   56.31119   35.07833      -46.5
r4  -60.16318  -193.1815   22.29587  -595.0261
r5   170.4712   103.5735  -41.78373   305.1879   -358.828
-----------------------------------------------------------------------------------------

Log likelihood = -503.47952                     Number of obs     =      6,603

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
 FollowUpNeg |    .153558   .1383744     1.11   0.267    -.1176507    .4247668
       _rcs1 |   1.427743   .1111458    12.85   0.000     1.209902    1.645585
       _rcs2 |   .2127152   .0668552     3.18   0.001     .0816814     .343749
       _rcs3 |   .0160008   .0306475     0.52   0.602    -.0440671    .0760687
       _cons |  -1.935878   .1183161   -16.36   0.000    -2.167773   -1.703982
------------------------------------------------------------------------------

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. stpm2 Follow, scale(hazard) df(3) from(Follow=1)
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2 Follow, scale(hazard) df(3) from(Follow=0)
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2 Follow, scale(hazard) df(3) from(Follow=0.5)
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2 Follow, scale(hazard) df(3) from(Follow=-0.5)
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2 Follow, scale(hazard) df(3) from(Follow=-0.45)
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2 Follow, scale(hazard) df(3) from(Follow=b)
note: delayed entry models are being fitted
'b' found where number expected
r(7);

. stpm2 Follow, scale(hazard) df(3) from(Follow=b[1])
note: delayed entry models are being fitted
'b' found where number expected
r(7);

. display b
type mismatch
r(109);

. display `b'


. logit Follow

Iteration 0:   log likelihood = -4412.0678  
Iteration 1:   log likelihood = -4412.0678  

Logistic regression                             Number of obs     =      6,603
                                                LR chi2(0)        =      -0.00
                                                Prob > chi2       =          .
Log likelihood = -4412.0678                     Pseudo R2         =    -0.0000

------------------------------------------------------------------------------
 FollowUpNeg |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       _cons |  -.4525162   .0252454   -17.92   0.000    -.5019963   -.4030361
------------------------------------------------------------------------------

. matrix b=e(b)

. display `b'


. display e(b)
matrix operators that return matrices not allowed in this context
r(509);

. e(b)
type mismatch
r(109);

. display b[1,1]
-.4525162

. stpm2 Follow, scale(hazard) df(3) from(Follow=b[1,1])
note: delayed entry models are being fitted
'b' found where number expected
r(7);

. stpm2 Follow, scale(hazard) df(3) from(Follow=b[1,1])
note: delayed entry models are being fitted
'b' found where number expected
r(7);

. b[1,1]
command b is unrecognized
r(199);

. stpm2 Follow, scale(hazard) df(3) from(Follow=`b'[1,1])
note: delayed entry models are being fitted
'[' found where number expected
r(7);

. stpm2 Follow, scale(hazard) df(3) from(Follow=b)
note: delayed entry models are being fitted
'b' found where number expected
r(7);

. stpm2 Follow, scale(hazard) df(3) from(Follow=-0.45)
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2 Follow, scale(hazard) df(3) from(Follow= -.4525162 )
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2 Follow, scale(hazard) df(5) from(Follow= -.4525162 )
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2 Follow, scale(hazard) df(5)
note: delayed entry models are being fitted

Iteration 0:   log likelihood = -504.97635  
Iteration 1:   log likelihood = -496.27959  
Iteration 2:   log likelihood = -495.94264  
Iteration 3:   log likelihood = -495.94181  
Iteration 4:   log likelihood = -495.94181  

Log likelihood = -495.94181                     Number of obs     =      6,603

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
 FollowUpNeg |   .1387091   .1381402     1.00   0.315    -.1320406    .4094589
       _rcs1 |   1.535327   .1305955    11.76   0.000     1.279364    1.791289
       _rcs2 |   .3221855    .092816     3.47   0.001     .1402695    .5041016
       _rcs3 |  -.0814754   .0437621    -1.86   0.063    -.1672476    .0042967
       _rcs4 |   .0527005   .0216847     2.43   0.015     .0101993    .0952018
       _rcs5 |   .0332782   .0140929     2.36   0.018     .0056565    .0608998
       _cons |   -1.96969   .1223428   -16.10   0.000    -2.209477   -1.729902
------------------------------------------------------------------------------

. stpm2 Follow, scale(hazard) df(5) from(Follow= 0.138)
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2 Follow, scale(hazard) df(3) showcons
note: delayed entry models are being fitted

Iteration 0:   log likelihood = -509.62812  
Iteration 1:   log likelihood = -503.57702  
Iteration 2:   log likelihood =  -503.4796  
Iteration 3:   log likelihood = -503.47952  
Iteration 4:   log likelihood = -503.47952  

Log likelihood = -503.47952                     Number of obs     =      6,603

 ( 1)  [xb]_rcs1 - [dxb]_d_rcs1 = 0
 ( 2)  [xb]_rcs2 - [dxb]_d_rcs2 = 0
 ( 3)  [xb]_rcs3 - [dxb]_d_rcs3 = 0
 ( 4)  [xb]FollowUpNeg - [xb0]FollowUpNeg = 0
 ( 5)  [xb]_rcs1 - [xb0]_s0_rcs1 = 0
 ( 6)  [xb]_rcs2 - [xb0]_s0_rcs2 = 0
 ( 7)  [xb]_rcs3 - [xb0]_s0_rcs3 = 0
 ( 8)  [xb]_cons - [xb0]_cons = 0
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
 FollowUpNeg |    .153558   .1383744     1.11   0.267    -.1176507    .4247668
       _rcs1 |   1.427743   .1111458    12.85   0.000     1.209902    1.645585
       _rcs2 |   .2127152   .0668552     3.18   0.001     .0816814     .343749
       _rcs3 |   .0160008   .0306475     0.52   0.602    -.0440671    .0760687
       _cons |  -1.935878   .1183161   -16.36   0.000    -2.167773   -1.703982
------------------------------------------------------------------------------

. stpm2 Follow, scale(hazard) df(5) from(Follow= 0)
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2 Follow, scale(hazard) df(5) from(Follow= 1)
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2 Follow, scale(hazard) df(3) from(Follow=0.5)
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2 Follow, scale(hazard) df(5) from(Follow= 1)
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2 Follow, scale(hazard) df(5) cure
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2 Follow, scale(hazard) df(1) cure
note: delayed entry models are being fitted
DF must be between 3 and 11

. 
. use "E:\users\amy.mason\staph_carriage\Datasets\clean_data4.dta", clear

. 
. assert _N==8949

. 
. gsort patid -newspa_init timepoint

. 
. by patid: gen firstevent = timepoint[1] if newspa_i[1]==1
(4,743 missing values generated)

. 
. by patid: replace firstevent = timepoint[_N] if newspa_i[1]==0
(4743 real changes made)

. 
. assert firstevent!=.

. 
. drop if timepoint > firstevent
(1,825 observations deleted)

. 
. drop if timepoint==0
(521 observations deleted)

. 
. stset timepoint, fail(newspa_init) id(patid)

                id:  patid
     failure event:  newspa_init != 0 & newspa_init < .
obs. time interval:  (timepoint[_n-1], timepoint]
 exit on or before:  failure

------------------------------------------------------------------------------
       6603  total observations
          0  exclusions
------------------------------------------------------------------------------
       6603  observations remaining, representing
        521  subjects
        219  failures in single-failure-per-subject data
      14358  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =        84

. 
. assert _st==1

. 
. stpm2 Follow, scale(hazard) df(3) 
note: delayed entry models are being fitted

Iteration 0:   log likelihood = -509.62812  
Iteration 1:   log likelihood = -503.57702  
Iteration 2:   log likelihood =  -503.4796  
Iteration 3:   log likelihood = -503.47952  
Iteration 4:   log likelihood = -503.47952  

Log likelihood = -503.47952                     Number of obs     =      6,603

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
 FollowUpNeg |    .153558   .1383744     1.11   0.267    -.1176507    .4247668
       _rcs1 |   1.427743   .1111458    12.85   0.000     1.209902    1.645585
       _rcs2 |   .2127152   .0668552     3.18   0.001     .0816814     .343749
       _rcs3 |   .0160008   .0306475     0.52   0.602    -.0440671    .0760687
       _cons |  -1.935878   .1183161   -16.36   0.000    -2.167773   -1.703982
------------------------------------------------------------------------------

. stpm2 Follow, scale(hazard) df(3) cure
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2 Follow, scale(hazard) df(3) cure from(Follow =0.15, )rcs1=1.43, _rcs2=0.21, _rcs3
> =0.016, _cons=-1.95)
invalid '_rcs2' 
r(198);

. stpm2 Follow, scale(hazard) df(3) cure from(Follow =0.15, rcs1=1.43, _rcs2=0.21, _rcs3=
> 0.016, _cons=-1.95)
note: delayed entry models are being fitted
invalid '_rcs2' 
r(198);

. stpm2 Follow, scale(hazard) df(3) cure from(Follow =0.15, rcs1=1.43, _rcs2=0.2127, _rcs
> 3=0.016, _cons=-1.95)
note: delayed entry models are being fitted
invalid '_rcs2' 
r(198);

. stpm2 Follow, scale(hazard) df(3) cure from(Follow =0.15, rcs1=1.43, _rcs3=0.016, _cons
> =-1.95)
note: delayed entry models are being fitted
invalid '_rcs3' 
r(198);

. stpm2 Follow, scale(hazard) df(3) cure from(Follow =0.15, rcs1=1.43, _cons=-1.95)
note: delayed entry models are being fitted
invalid '_cons' 
r(198);

. stpm2 Follow, scale(hazard) df(3) cure from(Follow =0.15, rcs1=1.43)
note: delayed entry models are being fitted
option rcs1 not allowed
r(198);

. stpm2 Follow, scale(hazard) df(3) cure from(Follow =0.15 rcs1=1.43)
note: delayed entry models are being fitted
initial vector: extra parameter rcs1 found
specify skip option if necessary
r(111);

. stpm2 Follow, scale(hazard) df(3) cure from(Follow =0.15/  rcs1=1.43)
note: delayed entry models are being fitted
'/' found where nothing expected
r(7);

. stpm2 Follow, scale(hazard) df(3) cure from(0.15, 1.43, 0.2127,0.016,-1.95, skipcopy)
note: delayed entry models are being fitted
invalid '0.2127' 
r(198);

. stpm2 Follow, scale(hazard) df(3) cure from(0.15, 1.43, 0.2127,0.016,-1.95, copy)
note: delayed entry models are being fitted
invalid '0.2127' 
r(198);

. stpm2 Follow, scale(hazard) df(3) cure from(0.15, 1.43, copy)
note: delayed entry models are being fitted
invalid 'copy' 
r(198);

. stpm2 Follow, scale(hazard) df(3) cure from(0.15 1.43, copy)
note: delayed entry models are being fitted
initial vector: matrix must be dimension 13
r(503);

. stpm2 Follow, scale(hazard) df(3) cure from(Follow =0.15, rcs1=1.43, _rcs2=0.2127, _rcs
> 3=0.016, _cons=-1.95)
note: delayed entry models are being fitted
invalid '_rcs2' 
r(198);

. stpm2 Follow, scale(hazard) df(3) cure from(Follow =0.15, rcs1=1.43, rcs2=0.2127, rcs3=
> 0.016, cons=-1.95)
note: delayed entry models are being fitted
invalid 'rcs2' 
r(198);

. stpm2 Follow, scale(hazard) df(3) cure from(Follow =0.15/ rcs1=1.43/ rcs2=0.2127/ rcs3=
> 0.016/ cons=-1.95)
note: delayed entry models are being fitted
'/' found where nothing expected
r(7);

. stpm2 Follow, scale(hazard) df(3) cure from(Follow =0.15 rcs1=1.43 rcs2=0.2127 rcs3=0.0
> 16 cons=-1.95)
note: delayed entry models are being fitted
initial vector: extra parameter rcs1 found
specify skip option if necessary
r(111);

. stpm2 Follow, scale(hazard) df(3) cure from(Follow =0.15 _rcs1=1.43 _rcs2=0.2127 _rcs3=
> 0.016 _cons=-1.95)
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2 Follow, scale(hazard) df(3) cure from(Follow =-0.45 _rcs1=1.43 _rcs2=0.2127 _rcs3=0.016 _con
> s=-1.95)
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2 Follow, scale(hazard) df(3) cure from(Follow =0 _rcs1=1.43 _rcs2=0.2127 _rcs3=0.016 _cons=-1
> .95)
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2 Follow, scale(hazard) df(3) cure from(Follow =1 _rcs1=1.43 _rcs2=0.2127 _rcs3=0.016 _cons=-1
> .95)
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2 Follow, scale(hazard) df(3) cure from(Follow =1)
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2 Follow, scale(hazard) df(3)  from(Follow =1)
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2 Follow, scale(hazard) df(3)  from(Follow =0)
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2 Follow, scale(hazard) df(3)  from(Follow =0.5)
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2 Follow, scale(hazard) df(3)  from(Follow =0.15)
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2 Follow, scale(hazard) df(3)
note: delayed entry models are being fitted

Iteration 0:   log likelihood = -509.62812  
Iteration 1:   log likelihood = -503.57702  
Iteration 2:   log likelihood =  -503.4796  
Iteration 3:   log likelihood = -503.47952  
Iteration 4:   log likelihood = -503.47952  

Log likelihood = -503.47952                     Number of obs     =      6,603

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
 FollowUpNeg |    .153558   .1383744     1.11   0.267    -.1176507    .4247668
       _rcs1 |   1.427743   .1111458    12.85   0.000     1.209902    1.645585
       _rcs2 |   .2127152   .0668552     3.18   0.001     .0816814     .343749
       _rcs3 |   .0160008   .0306475     0.52   0.602    -.0440671    .0760687
       _cons |  -1.935878   .1183161   -16.36   0.000    -2.167773   -1.703982
------------------------------------------------------------------------------

. help stpm2

. stpm2 Follow, scale(hazard) df(3) soncons
option soncons not allowed
r(198);

. stpm2 Follow, scale(hazard) df(3) showcons
note: delayed entry models are being fitted

Iteration 0:   log likelihood = -509.62812  
Iteration 1:   log likelihood = -503.57702  
Iteration 2:   log likelihood =  -503.4796  
Iteration 3:   log likelihood = -503.47952  
Iteration 4:   log likelihood = -503.47952  

Log likelihood = -503.47952                     Number of obs     =      6,603

 ( 1)  [xb]_rcs1 - [dxb]_d_rcs1 = 0
 ( 2)  [xb]_rcs2 - [dxb]_d_rcs2 = 0
 ( 3)  [xb]_rcs3 - [dxb]_d_rcs3 = 0
 ( 4)  [xb]FollowUpNeg - [xb0]FollowUpNeg = 0
 ( 5)  [xb]_rcs1 - [xb0]_s0_rcs1 = 0
 ( 6)  [xb]_rcs2 - [xb0]_s0_rcs2 = 0
 ( 7)  [xb]_rcs3 - [xb0]_s0_rcs3 = 0
 ( 8)  [xb]_cons - [xb0]_cons = 0
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
 FollowUpNeg |    .153558   .1383744     1.11   0.267    -.1176507    .4247668
       _rcs1 |   1.427743   .1111458    12.85   0.000     1.209902    1.645585
       _rcs2 |   .2127152   .0668552     3.18   0.001     .0816814     .343749
       _rcs3 |   .0160008   .0306475     0.52   0.602    -.0440671    .0760687
       _cons |  -1.935878   .1183161   -16.36   0.000    -2.167773   -1.703982
------------------------------------------------------------------------------

. stpm2 Follow, scale(hazard) knots(33 66) showcons
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2 Follow, scale(hazard) knots(25 50 75) showcons
note: delayed entry models are being fitted

Iteration 0:   log likelihood = -506.36261  
Iteration 1:   log likelihood = -501.84666  
Iteration 2:   log likelihood = -501.82799  
Iteration 3:   log likelihood = -501.82799  

Log likelihood = -501.82799                     Number of obs     =      6,603

 ( 1)  [xb]_rcs1 - [dxb]_d_rcs1 = 0
 ( 2)  [xb]_rcs2 - [dxb]_d_rcs2 = 0
 ( 3)  [xb]_rcs3 - [dxb]_d_rcs3 = 0
 ( 4)  [xb]_rcs4 - [dxb]_d_rcs4 = 0
 ( 5)  [xb]FollowUpNeg - [xb0]FollowUpNeg = 0
 ( 6)  [xb]_rcs1 - [xb0]_s0_rcs1 = 0
 ( 7)  [xb]_rcs2 - [xb0]_s0_rcs2 = 0
 ( 8)  [xb]_rcs3 - [xb0]_s0_rcs3 = 0
 ( 9)  [xb]_rcs4 - [xb0]_s0_rcs4 = 0
 (10)  [xb]_cons - [xb0]_cons = 0
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
 FollowUpNeg |   .1555297   .1380153     1.13   0.260    -.1149753    .4260347
       _rcs1 |   1.367515   .1002864    13.64   0.000     1.170957    1.564073
       _rcs2 |   .1485544   .0498827     2.98   0.003     .0507861    .2463227
       _rcs3 |   .0370276    .018348     2.02   0.044     .0010661     .072989
       _rcs4 |  -.0049429   .0057601    -0.86   0.391    -.0162324    .0063466
       _cons |  -1.914758   .1165511   -16.43   0.000    -2.143194   -1.686322
------------------------------------------------------------------------------

. stpm2 Follow, scale(hazard) knots( 50 75) showcons
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2 Follow, scale(hazard) knots(40 50 75) showcons
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2 Follow, scale(hazard) knots(10 50 75) showcons
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2 Follow, scale(hazard) knots(10 50 90) showcons
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2 Follow, scale(hazard) knots(25 50 90) showcons
note: delayed entry models are being fitted

Iteration 0:   log likelihood = -506.29167  
Iteration 1:   log likelihood = -501.79034  
Iteration 2:   log likelihood = -501.77207  
Iteration 3:   log likelihood = -501.77207  

Log likelihood = -501.77207                     Number of obs     =      6,603

 ( 1)  [xb]_rcs1 - [dxb]_d_rcs1 = 0
 ( 2)  [xb]_rcs2 - [dxb]_d_rcs2 = 0
 ( 3)  [xb]_rcs3 - [dxb]_d_rcs3 = 0
 ( 4)  [xb]_rcs4 - [dxb]_d_rcs4 = 0
 ( 5)  [xb]FollowUpNeg - [xb0]FollowUpNeg = 0
 ( 6)  [xb]_rcs1 - [xb0]_s0_rcs1 = 0
 ( 7)  [xb]_rcs2 - [xb0]_s0_rcs2 = 0
 ( 8)  [xb]_rcs3 - [xb0]_s0_rcs3 = 0
 ( 9)  [xb]_rcs4 - [xb0]_s0_rcs4 = 0
 (10)  [xb]_cons - [xb0]_cons = 0
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
 FollowUpNeg |   .1559268   .1380051     1.13   0.259    -.1145583    .4264119
       _rcs1 |   1.367327   .1002602    13.64   0.000     1.170821    1.563834
       _rcs2 |    .148806   .0497527     2.99   0.003     .0512926    .2463194
       _rcs3 |   .0360278   .0184298     1.95   0.051    -.0000939    .0721496
       _rcs4 |  -.0056786   .0057126    -0.99   0.320     -.016875    .0055179
       _cons |  -1.914894   .1165487   -16.43   0.000    -2.143325   -1.686463
------------------------------------------------------------------------------

. stpm2 Follow, scale(hazard) knots(25 75) showcons
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2 Follow, scale(hazard) knots(25 66) showcons
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2 Follow, scale(hazard) knots(25 50) showcons
note: delayed entry models are being fitted

Iteration 0:   log likelihood = -507.89649  
Iteration 1:   log likelihood = -502.33567  
Iteration 2:   log likelihood =   -502.268  
Iteration 3:   log likelihood = -502.26766  
Iteration 4:   log likelihood = -502.26766  

Log likelihood = -502.26766                     Number of obs     =      6,603

 ( 1)  [xb]_rcs1 - [dxb]_d_rcs1 = 0
 ( 2)  [xb]_rcs2 - [dxb]_d_rcs2 = 0
 ( 3)  [xb]_rcs3 - [dxb]_d_rcs3 = 0
 ( 4)  [xb]FollowUpNeg - [xb0]FollowUpNeg = 0
 ( 5)  [xb]_rcs1 - [xb0]_s0_rcs1 = 0
 ( 6)  [xb]_rcs2 - [xb0]_s0_rcs2 = 0
 ( 7)  [xb]_rcs3 - [xb0]_s0_rcs3 = 0
 ( 8)  [xb]_cons - [xb0]_cons = 0
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
 FollowUpNeg |   .1551913   .1380319     1.12   0.261    -.1153462    .4257288
       _rcs1 |   1.373641   .1006951    13.64   0.000     1.176282       1.571
       _rcs2 |   .1540321    .049997     3.08   0.002     .0560398    .2520244
       _rcs3 |   .0283856   .0161081     1.76   0.078    -.0031857    .0599569
       _cons |   -1.91617   .1166818   -16.42   0.000    -2.144862   -1.687478
------------------------------------------------------------------------------

. 
. * only predict for one observation per _t

. 
. bysort _t: gen time=_t if _n==1
(6,562 missing values generated)

. 
. predict h0, hazard   at(Follow 0) zeros timevar(time)

. 
. predict h1, hazard   at(Follow 1) zeros timevar(time)

. 
. predict s0, survival at(Follow 0) zeros timevar(time)

. 
. predict s1, survival at(Follow 1) zeros timevar(time)

. 
. predict hdiff,   hdiff1(Follow 0) hdiff2(Follow 1) ci  timevar(time)

. 
. predict sdiff,   sdiff1(Follow 0) sdiff2(Follow 1) ci  timevar(time)

. 
. noi di _n "On per 1 day scale"

On per 1 day scale

. 
. noi summ h0 h1 s0 s1 sdiff

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          h0 |         41    .0125013    .0052233   .0052557   .0196322
          h1 |         41    .0146001    .0061002   .0061381   .0229281
          s0 |         41    .5782923    .2062562   .3526778   .9939578
          s1 |         41    .5336523    .2231297   .2960679    .992947
       sdiff |         41      .04464    .0174925   .0010108   .0570341

. 
. * rescale hazards per 100 rather than per 1 person-day(s)

. 
. for var h0 h1 hdiff*: replace X=X*100

->  replace h0=h0*100
(41 real changes made)

->  replace h1=h1*100
(41 real changes made)

->  replace hdiff=hdiff*100
(41 real changes made)

->  replace hdiff_lci=hdiff_lci*100
(41 real changes made)

->  replace hdiff_uci=hdiff_uci*100
(41 real changes made)

. 
. noi di _n "Rescaling hazards per 100 days"

Rescaling hazards per 100 days

. 
. noi summ h0 h1 s0 s1 sdiff

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          h0 |         41    1.250133    .5223339   .5255742   1.963221
          h1 |         41    1.460007     .610024   .6138083    2.29281
          s0 |         41    .5782923    .2062562   .3526778   .9939578
          s1 |         41    .5336523    .2231297   .2960679    .992947
       sdiff |         41      .04464    .0174925   .0010108   .0570341

. 
. 
. 
. scatter h0 h1 time, sort c(l l) s(i i) color(blue red) graphregion(color(white)) /*
option / not allowed
r(198);

. 
. */  ytitle(Gain of Spa-type risk per 100 person-days) /*

. 
. */  xtitle(Days from first swab, size(medlarge))  /*

. 
. */  legend(order( 1 "Carriage at t=0" 2 "No carriage at t=0"))

. scatter h0 h1 time, sort c(l l) s(i i) color(blue red) graphregion(color(white))

. scatter h0 h1 time, sort c(l l) s(i i) color(blue red) graphregion(color(white))

. scatter s0 s1 time, sort c(l l) s(i i) color(blue red) graphregion(color(white)) /*
option / not allowed
r(198);

. scatter s0 s1 time, sort c(l l) s(i i) color(blue red) graphregion(color(white))

. stpm2 Follow, scale(hazard) cure knots(25 50) showcons
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2 Follow, scale(hazard) knots(25 50) showcons
note: delayed entry models are being fitted

Iteration 0:   log likelihood = -507.89649  
Iteration 1:   log likelihood = -502.33567  
Iteration 2:   log likelihood =   -502.268  
Iteration 3:   log likelihood = -502.26766  
Iteration 4:   log likelihood = -502.26766  

Log likelihood = -502.26766                     Number of obs     =      6,603

 ( 1)  [xb]_rcs1 - [dxb]_d_rcs1 = 0
 ( 2)  [xb]_rcs2 - [dxb]_d_rcs2 = 0
 ( 3)  [xb]_rcs3 - [dxb]_d_rcs3 = 0
 ( 4)  [xb]FollowUpNeg - [xb0]FollowUpNeg = 0
 ( 5)  [xb]_rcs1 - [xb0]_s0_rcs1 = 0
 ( 6)  [xb]_rcs2 - [xb0]_s0_rcs2 = 0
 ( 7)  [xb]_rcs3 - [xb0]_s0_rcs3 = 0
 ( 8)  [xb]_cons - [xb0]_cons = 0
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
 FollowUpNeg |   .1551913   .1380319     1.12   0.261    -.1153462    .4257288
       _rcs1 |   1.373641   .1006951    13.64   0.000     1.176282       1.571
       _rcs2 |   .1540321    .049997     3.08   0.002     .0560398    .2520244
       _rcs3 |   .0283856   .0161081     1.76   0.078    -.0031857    .0599569
       _cons |   -1.91617   .1166818   -16.42   0.000    -2.144862   -1.687478
------------------------------------------------------------------------------

. stpm2 Follow, scale(hazard) knots(25 50) showcons cure  from(Follow =0.155 _rcs1=1.37 _rcs2=0.15 _
> rcs3=0.028 _cons=-1.91
) required
r(100);

. stpm2 Follow, scale(hazard) knots(25 50) showcons cure  from(Follow =0.155 _rcs1=1.37 _rcs2=0.15 _
> rcs3=0.028 _cons=-1.91)
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2 Follow, scale(hazard) df(10)
note: delayed entry models are being fitted

Iteration 0:   log likelihood = -503.28316  
Iteration 1:   log likelihood = -491.38226  
Iteration 2:   log likelihood = -489.66523  
Iteration 3:   log likelihood = -489.61219  
Iteration 4:   log likelihood = -489.61214  
Iteration 5:   log likelihood = -489.61214  

Log likelihood = -489.61214                     Number of obs     =      6,603

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
 FollowUpNeg |   .1325209    .138251     0.96   0.338    -.1384461     .403488
       _rcs1 |   1.703328   .1625727    10.48   0.000     1.384692    2.021965
       _rcs2 |   .4950977   .1321332     3.75   0.000     .2361214     .754074
       _rcs3 |   -.210515   .0724293    -2.91   0.004    -.3524739   -.0685561
       _rcs4 |   .0468764     .02608     1.80   0.072    -.0042395    .0979924
       _rcs5 |   .0066604   .0193546     0.34   0.731    -.0312738    .0445947
       _rcs6 |   .0436321   .0136978     3.19   0.001      .016785    .0704793
       _rcs7 |   .0252675   .0123308     2.05   0.040     .0010996    .0494354
       _rcs8 |    .026968   .0094998     2.84   0.005     .0083488    .0455872
       _rcs9 |  -.0045786   .0086168    -0.53   0.595    -.0214671      .01231
      _rcs10 |  -.0040977   .0066878    -0.61   0.540    -.0172055    .0090101
       _cons |  -2.040057   .1305997   -15.62   0.000    -2.296027   -1.784086
------------------------------------------------------------------------------

. stpm2 Follow, scale(hazard) df(10) cure
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2 Follow, scale(hazard) df(9) cure
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2 Follow, scale(hazard) knots(10 20 30 40 50 60 70 80 90_ cure
) required
r(100);

. stpm2 Follow, scale(hazard) knots(10 20 30 40 50 60 70 80 90) cure
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2 Follow, scale(hazard) knots(10 20 30 40 50 60 70 80 90)
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2 Follow, scale(hazard) knots(10 20 30 40 50 60 70 80 95)
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2, scale(hazard) knots(10 20 30 40 50 60 70 80 95)
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2, scale(hazard) df(3)
note: delayed entry models are being fitted

Iteration 0:   log likelihood =  -510.2511  
Iteration 1:   log likelihood = -504.18729  
Iteration 2:   log likelihood = -504.09014  
Iteration 3:   log likelihood = -504.09006  
Iteration 4:   log likelihood = -504.09006  

Log likelihood = -504.09006                     Number of obs     =      6,603

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
       _rcs1 |   1.428863   .1111331    12.86   0.000     1.211046     1.64668
       _rcs2 |   .2095625   .0667953     3.14   0.002     .0786461    .3404789
       _rcs3 |   .0141616   .0307738     0.46   0.645     -.046154    .0744771
       _cons |  -1.877447   .1046856   -17.93   0.000    -2.082627   -1.672267
------------------------------------------------------------------------------

. stpm2, scale(hazard) df(3) cure
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2, scale(hazard) df(3) bhazard(rate) cure
variable rate not found
(error in option bhazard())
r(111);

. stpm2, scale(hazard) df(3) bhazard(rate) cure
variable rate not found
(error in option bhazard())
r(111);

. stpm2, scale(hazard) df(3)  cure
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2, scale(hazard) df(10)  cure
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2, scale(hazard) df(3)  cure
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2, scale(hazard)   cur
last estimates not found
r(301);

. stpm2, scale(hazard) knots (25 50)
note: delayed entry models are being fitted

Iteration 0:   log likelihood = -508.41537  
Iteration 1:   log likelihood = -502.94825  
Iteration 2:   log likelihood =  -502.8945  
Iteration 3:   log likelihood = -502.89431  
Iteration 4:   log likelihood = -502.89431  

Log likelihood = -502.89431                     Number of obs     =      6,603

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
       _rcs1 |   1.374168   .1006456    13.65   0.000     1.176906    1.571429
       _rcs2 |   .1495775   .0498903     3.00   0.003     .0517942    .2473608
       _rcs3 |   .0287598   .0163364     1.76   0.078     -.003259    .0607786
       _cons |  -1.856961    .102806   -18.06   0.000    -2.058457   -1.655465
------------------------------------------------------------------------------

. stpm2, scale(hazard) knots (25 50) cure
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2, scale(hazard) knots(25 50 95)
note: delayed entry models are being fitted

Iteration 0:   log likelihood = -506.89912  
Iteration 1:   log likelihood = -502.42423  
Iteration 2:   log likelihood = -502.40632  
Iteration 3:   log likelihood = -502.40632  

Log likelihood = -502.40632                     Number of obs     =      6,603

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
       _rcs1 |   1.367982   .1002141    13.65   0.000     1.171566    1.564398
       _rcs2 |   .1445814   .0496182     2.91   0.004     .0473314    .2418314
       _rcs3 |   .0360528   .0187403     1.92   0.054    -.0006775    .0727831
       _rcs4 |  -.0059175   .0058586    -1.01   0.312    -.0174001     .005565
       _cons |  -1.855464   .1026819   -18.07   0.000    -2.056717   -1.654211
------------------------------------------------------------------------------

. stpm2, scale(hazard) knots(25 50 95) cure
note: delayed entry models are being fitted

Iteration 0:   log likelihood = -510.45466  
Iteration 1:   log likelihood = -504.47608  
Iteration 2:   log likelihood =  -504.3588  
Iteration 3:   log likelihood = -504.35852  
Iteration 4:   log likelihood = -504.35852  

Log likelihood = -504.35852                     Number of obs     =      6,603

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
       _rcs1 |   1.385296   .1056088    13.12   0.000     1.178307    1.592285
       _rcs2 |  -.0606927   .0390176    -1.56   0.120    -.1371657    .0157803
       _rcs3 |  -.0038179   .0190088    -0.20   0.841    -.0410744    .0334386
       _rcs4 |          0  (omitted)
       _cons |  -1.857872   .1028893   -18.06   0.000    -2.059531   -1.656213
------------------------------------------------------------------------------

. stpm2, scale(hazard) knots(25 75 95) cure
note: delayed entry models are being fitted

Iteration 0:   log likelihood =  -510.5034  
Iteration 1:   log likelihood = -504.39665  
Iteration 2:   log likelihood = -503.59374  
Iteration 3:   log likelihood = -503.58809  
Iteration 4:   log likelihood = -503.58808  

Log likelihood = -503.58808                     Number of obs     =      6,603

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
       _rcs1 |   1.392337    .105682    13.17   0.000     1.185204     1.59947
       _rcs2 |  -.0542337   .0375254    -1.45   0.148    -.1277821    .0193148
       _rcs3 |  -.0011249    .016154    -0.07   0.944    -.0327862    .0305363
       _rcs4 |          0  (omitted)
       _cons |  -1.860424   .1030041   -18.06   0.000    -2.062309    -1.65854
------------------------------------------------------------------------------

. stpm2, scale(hazard) knots(25 90 95) cure
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2, scale(hazard) knots(10 50 95) cure
note: delayed entry models are being fitted

Iteration 0:   log likelihood = -509.83085  
Iteration 1:   log likelihood = -503.97422  
Iteration 2:   log likelihood = -503.90954  
Iteration 3:   log likelihood = -503.90949  

Log likelihood = -503.90949                     Number of obs     =      6,603

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
       _rcs1 |   1.444655   .1170908    12.34   0.000     1.215161    1.674149
       _rcs2 |  -.0197213   .0489298    -0.40   0.687    -.1156219    .0761794
       _rcs3 |   .0340541   .0358342     0.95   0.342    -.0361797    .1042879
       _rcs4 |          0  (omitted)
       _cons |  -1.877656   .1047175   -17.93   0.000    -2.082899   -1.672413
------------------------------------------------------------------------------

.  drop h0 h1 s0 s1 hdiff hdiff_lci hdiff_uci sdiff sdiff_lci sdiff_uci _rcs1 _d_rcs1 _rcs2 _d_rcs2 
> _rcs3 _d_rcs3 _rcs4 _d_rcs4 _s0_rcs1 _s0_rcs2 _s0_rcs3 _s0_rcs4

. stpm2, scale(hazard) knots(10 50 95) cure
note: delayed entry models are being fitted

Iteration 0:   log likelihood = -509.83085  
Iteration 1:   log likelihood = -503.97422  
Iteration 2:   log likelihood = -503.90954  
Iteration 3:   log likelihood = -503.90949  

Log likelihood = -503.90949                     Number of obs     =      6,603

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
       _rcs1 |   1.444655   .1170908    12.34   0.000     1.215161    1.674149
       _rcs2 |  -.0197213   .0489298    -0.40   0.687    -.1156219    .0761794
       _rcs3 |   .0340541   .0358342     0.95   0.342    -.0361797    .1042879
       _rcs4 |          0  (omitted)
       _cons |  -1.877656   .1047175   -17.93   0.000    -2.082899   -1.672413
------------------------------------------------------------------------------

. 
. 
. 
. * only predict for one observation per _t

. 
. bysort _t: gen time=_t if _n==1
variable time already defined
r(110);

. 
. predict h0, hazard   at(Follow 0) zeros timevar(time)

. 
. predict h1, hazard   at(Follow 1) zeros timevar(time)

. 
. predict s0, survival at(Follow 0) zeros timevar(time)

. 
. predict s1, survival at(Follow 1) zeros timevar(time)

. 
. predict hdiff,   hdiff1(Follow 0) hdiff2(Follow 1) ci  timevar(time)

. 
. predict sdiff,   sdiff1(Follow 0) sdiff2(Follow 1) ci  timevar(time)

. 
. noi di _n "On per 1 day scale"

On per 1 day scale

. 
. noi summ h0 h1 s0 s1 sdiff

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          h0 |         41    .0133674    .0057629   .0013304    .019795
          h1 |         41    .0133674    .0057629   .0013304    .019795
          s0 |         41    .5575987    .2165017   .3245717   .9951523
          s1 |         41    .5575987    .2165017   .3245717   .9951523
       sdiff |         41           0           0          0          0

. 
. * rescale hazards per 100 rather than per 1 person-day(s)

. 
. for var h0 h1 hdiff*: replace X=X*100

->  replace h0=h0*100
(41 real changes made)

->  replace h1=h1*100
(41 real changes made)

->  replace hdiff=hdiff*100
(0 real changes made)

->  replace hdiff_lci=hdiff_lci*100
(0 real changes made)

->  replace hdiff_uci=hdiff_uci*100
(0 real changes made)

. 
. noi di _n "Rescaling hazards per 100 days"

Rescaling hazards per 100 days

. 
. noi summ h0 h1 s0 s1 sdiff

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          h0 |         41    1.336737    .5762887   .1330351   1.979501
          h1 |         41    1.336737    .5762887   .1330351   1.979501
          s0 |         41    .5575987    .2165017   .3245717   .9951523
          s1 |         41    .5575987    .2165017   .3245717   .9951523
       sdiff |         41           0           0          0          0

. 
. 
. 
. scatter h0 h1 time, sort c(l l) s(i i) color(blue red) graphregion(color(white)) /*
option / not allowed
r(198);

. scatter h0 h1 time, sort c(l l) s(i i) color(blue red) graphregion(color(white))

. scatter s0 s1 time, sort c(l l) s(i i) color(blue red) graphregion(color(white))

. stpm2 Follow, scale(hazard) knots(25 90 95) cure
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2, scale(hazard) df(5) cure
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2, scale(hazard) df(4) cure
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2, scale(hazard) df(5) cure
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2, scale(hazard) knots(33 66 95) cure
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2, scale(hazard) knots(33 50 95) cure
note: delayed entry models are being fitted

Iteration 0:   log likelihood = -515.25227  
Iteration 1:   log likelihood = -507.97313  
Iteration 2:   log likelihood = -504.53354  
Iteration 3:   log likelihood = -504.37848  
Iteration 4:   log likelihood = -504.37777  
Iteration 5:   log likelihood = -504.37777  

Log likelihood = -504.37777                     Number of obs     =      6,603

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
       _rcs1 |   1.394183   .1046447    13.32   0.000     1.189083    1.599283
       _rcs2 |  -.0548087   .0365024    -1.50   0.133    -.1263522    .0167347
       _rcs3 |   .0005742   .0153353     0.04   0.970    -.0294824    .0306307
       _rcs4 |          0  (omitted)
       _cons |  -1.861122   .1028898   -18.09   0.000    -2.062782   -1.659461
------------------------------------------------------------------------------

. help stpm2

. predict cure
You must specify one of the predict options
r(198);

. stpm2, scale(hazard) knots(33 50 95) cure
note: delayed entry models are being fitted

Iteration 0:   log likelihood = -515.25227  
Iteration 1:   log likelihood = -507.97313  
Iteration 2:   log likelihood = -504.53354  
Iteration 3:   log likelihood = -504.37848  
Iteration 4:   log likelihood = -504.37777  
Iteration 5:   log likelihood = -504.37777  

Log likelihood = -504.37777                     Number of obs     =      6,603

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
       _rcs1 |   1.394183   .1046447    13.32   0.000     1.189083    1.599283
       _rcs2 |  -.0548087   .0365024    -1.50   0.133    -.1263522    .0167347
       _rcs3 |   .0005742   .0153353     0.04   0.970    -.0294824    .0306307
       _rcs4 |          0  (omitted)
       _cons |  -1.861122   .1028898   -18.09   0.000    -2.062782   -1.659461
------------------------------------------------------------------------------

. predict cure
You must specify one of the predict options
r(198);

. predict cure, cure ci

. stpm2  Sex, scale(hazard) knots(33 50 95) cure
note: delayed entry models are being fitted
inv(): matrix has missing values
r(504);

. codebook Sex

----------------------------------------------------------------------------------------------------
Sex                                                                                              Sex
----------------------------------------------------------------------------------------------------

                  type:  string (str6)

         unique values:  2                        missing "":  0/6,603

            tabulation:  Freq.  Value
                         3,557  "Female"
                         3,046  "Male"

. stpm2 Sex, scale(hazard) knots(33 50 95) cure
note: delayed entry models are being fitted
inv(): matrix has missing values
r(504);

. stpm2 Sex, scale(hazard) knots(33 50 95)
note: delayed entry models are being fitted
inv(): matrix has missing values
r(504);

. tab Sex, m

        Sex |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |      3,557       53.87       53.87
       Male |      3,046       46.13      100.00
------------+-----------------------------------
      Total |      6,603      100.00

. stpm2 househ, scale(hazard) knots(33 50 95)
note: delayed entry models are being fitted
inv(): matrix has missing values
r(504);

. stpm2 househ, scale(hazard) knots(25 50 95)
note: delayed entry models are being fitted
inv(): matrix has missing values
r(504);

. stpm2, scale(hazard) knots(25 50 95)
note: delayed entry models are being fitted

Iteration 0:   log likelihood = -506.89912  
Iteration 1:   log likelihood = -502.42423  
Iteration 2:   log likelihood = -502.40632  
Iteration 3:   log likelihood = -502.40632  

Log likelihood = -502.40632                     Number of obs     =      6,603

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
       _rcs1 |   1.367982   .1002141    13.65   0.000     1.171566    1.564398
       _rcs2 |   .1445814   .0496182     2.91   0.004     .0473314    .2418314
       _rcs3 |   .0360528   .0187403     1.92   0.054    -.0006775    .0727831
       _rcs4 |  -.0059175   .0058586    -1.01   0.312    -.0174001     .005565
       _cons |  -1.855464   .1026819   -18.07   0.000    -2.056717   -1.654211
------------------------------------------------------------------------------

. encode Sex
invalid syntax
r(198);

. encode Sex, replace
option replace not allowed
r(198);

. encode Sex, gen sex
option gen incorrectly specified
r(198);

. encode Sex, gen(sex)

. drop Sex

. rename sex Sex

. stpm2 Sex, scale(hazard) knots(33 50 95)
note: delayed entry models are being fitted

Iteration 0:   log likelihood = -508.16856  
Iteration 1:   log likelihood = -502.35219  
Iteration 2:   log likelihood = -502.07835  
Iteration 3:   log likelihood = -502.07583  
Iteration 4:   log likelihood = -502.07583  

Log likelihood = -502.07583                     Number of obs     =      6,603

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
         Sex |   .1222414   .1351912     0.90   0.366    -.1427285    .3872114
       _rcs1 |   1.375258   .0996687    13.80   0.000     1.179911    1.570606
       _rcs2 |   .1545759    .046548     3.32   0.001     .0633435    .2458083
       _rcs3 |   .0235359   .0157967     1.49   0.136    -.0074251    .0544968
       _rcs4 |  -.0056902   .0054932    -1.04   0.300    -.0164567    .0050763
       _cons |  -2.038378    .226034    -9.02   0.000    -2.481397    -1.59536
------------------------------------------------------------------------------

. codebook Follow

----------------------------------------------------------------------------------------------------
FollowUpNeg                                                                              FollowUpNeg
----------------------------------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  0/6,603

            tabulation:  Freq.  Value
                         4,036  0
                         2,567  1

. stpm2 Follow, scale(hazard) knots(33 50 95)
note: delayed entry models are being fitted

Iteration 0:   log likelihood = -508.10218  
Iteration 1:   log likelihood = -502.16818  
Iteration 2:   log likelihood = -501.85151  
Iteration 3:   log likelihood =  -501.8486  
Iteration 4:   log likelihood =  -501.8486  

Log likelihood =  -501.8486                     Number of obs     =      6,603

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
 FollowUpNeg |   .1562592   .1380175     1.13   0.258    -.1142502    .4267687
       _rcs1 |   1.374587     .09967    13.79   0.000     1.179238    1.569937
       _rcs2 |   .1589028   .0465906     3.41   0.001     .0675869    .2502186
       _rcs3 |   .0228754   .0155953     1.47   0.142    -.0076907    .0534416
       _rcs4 |  -.0055469   .0053719    -1.03   0.302    -.0160756    .0049818
       _cons |  -1.917744   .1165556   -16.45   0.000    -2.146189   -1.689299
------------------------------------------------------------------------------

. stpm2 Follow, scale(hazard) knots(25 50 95)
note: delayed entry models are being fitted

Iteration 0:   log likelihood = -506.29336  
Iteration 1:   log likelihood = -501.79164  
Iteration 2:   log likelihood =  -501.7734  
Iteration 3:   log likelihood =  -501.7734  

Log likelihood =  -501.7734                     Number of obs     =      6,603

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
 FollowUpNeg |   .1559396   .1380049     1.13   0.258     -.114545    .4264241
       _rcs1 |   1.367334   .1002612    13.64   0.000     1.170826    1.563843
       _rcs2 |   .1489109   .0497254     2.99   0.003     .0514509    .2463708
       _rcs3 |   .0355953   .0184967     1.92   0.054    -.0006577    .0718482
       _rcs4 |  -.0058351   .0057387    -1.02   0.309    -.0170828    .0054125
       _cons |  -1.914901    .116549   -16.43   0.000    -2.143333    -1.68647
------------------------------------------------------------------------------

. stpm2 Follow, scale(hazard) knots(15 50 95)
note: delayed entry models are being fitted

initial values not feasible
r(1400);

. stpm2 Follow, scale(hazard) knots(20 50 95)
note: delayed entry models are being fitted

Iteration 0:   log likelihood =  -507.4992  
Iteration 1:   log likelihood = -502.17944  
Iteration 2:   log likelihood =  -502.0663  
Iteration 3:   log likelihood = -502.06486  
Iteration 4:   log likelihood = -502.06486  

Log likelihood = -502.06486                     Number of obs     =      6,603

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
xb           |
 FollowUpNeg |   .1577608   .1380117     1.14   0.253     -.112737    .4282587
       _rcs1 |   1.373219   .1017197    13.50   0.000     1.173852    1.572586
       _rcs2 |   .1518935   .0528212     2.88   0.004     .0483659    .2554211
       _rcs3 |   .0397601   .0210332     1.89   0.059    -.0014643    .0809844
       _rcs4 |  -.0048831   .0058896    -0.83   0.407    -.0164265    .0066602
       _cons |  -1.918545   .1167293   -16.44   0.000     -2.14733    -1.68976
------------------------------------------------------------------------------

. 
. foreach var of varlist prev_anti prev_anti_6mon prev_n_spa Sex Ethnic_group residence_group Curren
> tlyEm HealthcareR SportsActivity LookAfter VascularAccess Catheter inpatient inpatient_summ househ
> old_group districtnurse DistrictNurse_summ skin surgery surgery_summ GP GP_summ {
  2. 
. encode `var', gen(`var'_cat)
  3. 
. drop `var'
  4. 
. rename `var'_cat `var'
  5. 
. }
not possible with numeric variable
r(107);

. 
. * small program to visualise main spline effects to add model fitting

. 
. cap prog drop PlotSpline

. 
. prog def PlotSpline
  1. 
. qui {
  2. 
.    syntax, varstub(string) knots(integer)
  3. 
.    preserve
  4. 
.    bysort `varstub': drop if _n>1
  5. 
.    if `knots'==3 gen plot = `varstub'C_1*_b[`varstub'C_1]+`varstub'C_2*_b[`varstub'C_2]
  6. 
.    else if `knots'==4 gen plot = `varstub'c_1*_b[`varstub'c_1]+`varstub'c_2*_b[`varstub'c_2]+`vars
> tub'c_3*_b[`varstub'c_3]
  7. 
.    else if `knots'==5 gen plot = `varstub'd_1*_b[`varstub'd_1]+`varstub'd_2*_b[`varstub'd_2]+`vars
> tub'd_3*_b[`varstub'd_3]+`varstub'd_4*_b[`varstub'd_4]
  8. 
.    else if `knots'==6 gen plot = `varstub'e_1*_b[`varstub'e_1]+`varstub'e_2*_b[`varstub'e_2]+`vars
> tub'e_3*_b[`varstub'e_3]+`varstub'e_4*_b[`varstub'e_4]+`varstub'e_5*_b[`varstub'e_5]
  9. 
.    else err 666
 10. 
.    scatter plot `varstub', sort
 11. 
. }
 12. 
. end

. 
. 
. 
. 
. 
. set li 130

. 
. 
. 
. cap log close
