Run by AMM on 24 Nov 2016 14:22:04
split spatypes
number of spatypes in each swab

  n_spatype |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,544       50.53       50.53
          1 |      4,263       47.41       97.94
          2 |        165        1.83       99.78
          3 |         18        0.20       99.98
          5 |          2        0.02      100.00
------------+-----------------------------------
      Total |      8,992      100.00
max number of spatypes

    max_spa |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         87       16.70       16.70
          1 |        343       65.83       82.53
          2 |         77       14.78       97.31
          3 |         12        2.30       99.62
          5 |          2        0.38      100.00
------------+-----------------------------------
      Total |        521      100.00
min number of spatypes

    min_spa |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        383       73.51       73.51
          1 |        138       26.49      100.00
------------+-----------------------------------
      Total |        521      100.00

           |        min_spa
   max_spa |         0          1 |     Total
-----------+----------------------+----------
         0 |        87          0 |        87 
         1 |       247         96 |       343 
         2 |        44         33 |        77 
         3 |         4          8 |        12 
         5 |         1          1 |         2 
-----------+----------------------+----------
     Total |       383        138 |       521 

carriage to date (unclear = unconfirmed neg at timepoint 0)

           |               carriage_todate
 timepoint |    always      never    unclear     varies |     Total
-----------+--------------------------------------------+----------
         0 |       346        161         14          0 |       521 
         2 |       302        147          0         44 |       493 
         4 |       266        145          0         72 |       483 
         6 |       256        138          0         86 |       480 
         8 |       238        128          0         98 |       464 
        10 |       221        116          0        105 |       442 
        12 |       209        119          0        124 |       452 
        14 |       195        109          0        132 |       436 
        16 |       186        107          0        143 |       436 
        18 |       188        105          0        146 |       439 
        20 |       176         98          0        154 |       428 
        22 |       173         93          0        147 |       413 
        24 |       177         92          0        157 |       426 
        26 |        75         74          0         75 |       224 
        28 |        64         70          0         80 |       214 
        30 |        65         67          0         88 |       220 
        32 |        59         61          0         92 |       212 
        34 |        57         57          0         93 |       207 
        36 |        58         58          0         91 |       207 
        38 |        55         52          0         90 |       197 
        40 |        54         49          0         95 |       198 
        42 |        55         49          0         96 |       200 
        44 |        50         48          0         96 |       194 
        46 |        50         46          0         94 |       190 
        48 |        49         43          0         91 |       183 
        50 |         2          1          0          5 |         8 
        52 |         0          0          0          2 |         2 
        54 |         0          2          0          0 |         2 
        56 |         2         10          0          5 |        17 
        58 |         3         13          0         11 |        27 
        60 |        10         19          0         11 |        40 
        62 |         4         16          0         17 |        37 
        64 |        13         18          0         18 |        49 
        66 |         8         14          0         17 |        39 
        68 |         9         16          0         19 |        44 
        70 |        13         17          0         22 |        52 
        72 |        13         18          0         20 |        51 
        74 |        10         16          0         20 |        46 
        76 |        10         17          0         20 |        47 
        78 |        10         17          0         21 |        48 
        80 |        12         17          0         21 |        50 
        82 |         8         12          0         18 |        38 
        84 |         5          1          0          8 |        14 
        86 |         6          0          0          5 |        11 
        88 |         6          0          0          4 |        10 
        90 |         0          0          0          1 |         1 
-----------+--------------------------------------------+----------
     Total |     3,768      2,456         14      2,754 |     8,992 

file E:\users\amy.mason\staph_carriage\Datasets\clean_data4.dta saved
missing due to lack of opportunity
Weigh by starting proportion of carriage/ no carriage

           |      FollowUpNeg
 timepoint |         0          1 |     Total
-----------+----------------------+----------
         0 |       332        189 |       521 
         2 |       321        172 |       493 
         4 |       305        178 |       483 
         6 |       308        172 |       480 
         8 |       298        166 |       464 
        10 |       285        157 |       442 
        12 |       288        164 |       452 
        14 |       286        150 |       436 
        16 |       280        156 |       436 
        18 |       282        157 |       439 
        20 |       273        155 |       428 
        22 |       268        145 |       413 
        24 |       275        151 |       426 
        26 |       124        100 |       224 
        28 |       115         99 |       214 
        30 |       117        103 |       220 
        32 |       117         95 |       212 
        34 |       115         92 |       207 
        36 |       111         96 |       207 
        38 |       110         87 |       197 
        40 |       109         89 |       198 
        42 |       111         89 |       200 
        44 |       103         91 |       194 
        46 |       106         84 |       190 
        48 |       102         81 |       183 
        50 |         5          3 |         8 
        52 |         0          2 |         2 
        54 |         0          2 |         2 
        56 |         4         13 |        17 
        58 |         6         21 |        27 
        60 |        13         27 |        40 
        62 |        12         25 |        37 
        64 |        18         31 |        49 
        66 |        15         24 |        39 
        68 |        16         28 |        44 
        70 |        22         30 |        52 
        72 |        21         30 |        51 
        74 |        19         27 |        46 
        76 |        18         29 |        47 
        78 |        19         29 |        48 
        80 |        21         29 |        50 
        82 |        17         21 |        38 
        84 |        12          2 |        14 
        86 |        11          0 |        11 
        88 |        10          0 |        10 
        90 |         1          0 |         1 
-----------+----------------------+----------
     Total |     5,401      3,591 |     8,992 

number of spatypes seen in each patid

      count |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        233       53.69       53.69
          2 |        119       27.42       81.11
          3 |         55       12.67       93.78
          4 |         15        3.46       97.24
          5 |          4        0.92       98.16
          6 |          5        1.15       99.31
          7 |          2        0.46       99.77
          9 |          1        0.23      100.00
------------+-----------------------------------
      Total |        434      100.00
file allspa.dta saved
file E:\users\amy.mason\staph_carriage\Datasets\record_per_spa.dta saved
. use "E:\users\amy.mason\staph_carriage\Datasets\record_per_spa.dta", clear

. tab timepoint

  timepoint |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        856        5.49        5.49
          2 |        823        5.28       10.77
          4 |        802        5.14       15.91
          6 |        793        5.09       21.00
          8 |        775        4.97       25.97
         10 |        751        4.82       30.78
         12 |        766        4.91       35.70
         14 |        735        4.71       40.41
         16 |        740        4.75       45.15
         18 |        757        4.85       50.01
         20 |        726        4.66       54.67
         22 |        710        4.55       59.22
         24 |        732        4.69       63.91
         26 |        391        2.51       66.42
         28 |        373        2.39       68.81
         30 |        385        2.47       71.28
         32 |        373        2.39       73.67
         34 |        372        2.39       76.06
         36 |        368        2.36       78.42
         38 |        351        2.25       80.67
         40 |        354        2.27       82.94
         42 |        353        2.26       85.20
         44 |        338        2.17       87.37
         46 |        338        2.17       89.54
         48 |        318        2.04       91.58
         50 |         24        0.15       91.73
         52 |          3        0.02       91.75
         54 |          2        0.01       91.77
         56 |         25        0.16       91.93
         58 |         48        0.31       92.23
         60 |         76        0.49       92.72
         62 |         70        0.45       93.17
         64 |         93        0.60       93.77
         66 |         85        0.55       94.31
         68 |         92        0.59       94.90
         70 |        106        0.68       95.58
         72 |        103        0.66       96.24
         74 |         94        0.60       96.84
         76 |         93        0.60       97.44
         78 |         99        0.63       98.08
         80 |        103        0.66       98.74
         82 |         88        0.56       99.30
         84 |         43        0.28       99.58
         86 |         33        0.21       99.79
         88 |         31        0.20       99.99
         90 |          2        0.01      100.00
------------+-----------------------------------
      Total |     15,593      100.00

. sort patid this_spa timepoint

. 
. by patid this_spa: drop if carriage_this_spa[1]==1& carriage_this_spa[2]==1
(4,412 observations deleted)

. 
. by patid this_spa: gen last = timepoint[_N]

. 
. drop if last<74
(8,006 observations deleted)

. tab patid

Participant |
         ID |      Freq.     Percent        Cum.
------------+-----------------------------------
        302 |         36        1.13        1.13
        366 |         72        2.27        3.40
        374 |        108        3.40        6.80
        407 |         68        2.14        8.94
        412 |         37        1.17       10.11
        418 |        222        6.99       17.10
        420 |        148        4.66       21.76
        424 |        152        4.79       26.55
        671 |         33        1.04       27.59
        993 |        312        9.83       37.42
       1211 |         38        1.20       38.61
       1214 |         37        1.17       39.78
       1217 |         37        1.17       40.94
       1218 |        111        3.50       44.44
       1219 |         68        2.14       46.58
       1223 |         37        1.17       47.75
       1226 |         30        0.94       48.69
       1229 |         39        1.23       49.92
       1231 |        204        6.43       56.35
       1233 |         36        1.13       57.48
       1236 |         34        1.07       58.55
       1244 |         36        1.13       59.69
       1246 |         39        1.23       60.91
       1247 |         38        1.20       62.11
       1251 |         39        1.23       63.34
       1261 |        102        3.21       66.55
       1274 |         76        2.39       68.94
       1277 |         33        1.04       69.98
       1284 |         35        1.10       71.09
       1295 |        116        3.65       74.74
       1316 |         39        1.23       75.97
       1328 |         34        1.07       77.04
       1331 |         38        1.20       78.24
       1332 |        148        4.66       82.90
       1338 |         38        1.20       84.09
       1359 |         74        2.33       86.43
       1370 |         33        1.04       87.46
       1372 |         36        1.13       88.60
       1375 |        111        3.50       92.09
       1382 |         39        1.23       93.32
       1385 |         39        1.23       94.55
       1386 |         38        1.20       95.75
       1392 |         36        1.13       96.88
       1395 |         35        1.10       97.98
       1400 |         33        1.04       99.02
       2055 |         31        0.98      100.00
------------+-----------------------------------
      Total |      3,175      100.00

. keep patid timepoint this_spa carriage_this_spa  this_confirmed_loss

. gen dropped = timepoint if this_confirmed ==1
(3,119 missing values generated)

. 
. by patid this_spa: egen lastdrop = max(dropped)
(1295 missing values generated)

. drop lastdrop

. by patid this_spa: egen lastdrop = min(dropped)
(1295 missing values generated)

. drop if lastdrop!=.
(1,880 observations deleted)

. 
. drop if timepoint!=last
(1,295 observations deleted)

. display _N
0

. use "E:\users\amy.mason\staph_carriage\Datasets\record_per_spa.dta", clear

. 
. * keep only the spatypes that start after timepoint 0/2 - ie those we know aquired during study

. 
. sort patid this_spa timepoint

. 
. by patid this_spa: drop if carriage_this_spa[1]==1& carriage_this_spa[2]==1
(4,412 observations deleted)

. 
. by patid this_spa: gen last = timepoint[_N]

. 
. drop if last<74
(8,006 observations deleted)

. 
. gen dropped = timepoint if this_confirmed ==1
(3,119 missing values generated)

. 
. by patid this_spa: egen lastdrop = min(dropped)
(1295 missing values generated)

. use "E:\users\amy.mason\staph_carriage\Datasets\record_per_spa.dta", clear

. 
. * keep only the spatypes that start after timepoint 0/2 - ie those we know aquired during study

. 
.  keep patid timepoint this_spa carriage_this_spa  this_confirmed_loss

. 
. sort patid this_spa timepoint

. 
. by patid this_spa: drop if carriage_this_spa[1]==1& carriage_this_spa[2]==1
(4,412 observations deleted)

. 
. by patid this_spa: gen last = timepoint[_N]

. 
. drop if last<74
(8,006 observations deleted)

. 
. gen dropped = timepoint if this_confirmed ==1
(3,119 missing values generated)

. 
. by patid this_spa: egen lastdrop = min(dropped)
(1295 missing values generated)

. 
. 
. 
. drop if lastdrop!=.
(1,880 observations deleted)

. drop if timepoint!=last
(1,259 observations deleted)

. 
. use "E:\users\amy.mason\staph_carriage\Datasets\record_per_spa.dta", clear

. 
. * keep only the spatypes that start after timepoint 0/2 - ie those we know aquired during study

. 
.  keep patid timepoint this_spa carriage_this_spa  this_confirmed_loss

. 
. sort patid this_spa timepoint

. 
. by patid this_spa: drop if carriage_this_spa[1]==1& carriage_this_spa[2]==1
(4,412 observations deleted)

. 
. by patid this_spa: gen last = timepoint[_N]

. 
. drop if last<74
(8,006 observations deleted)

. 
. gen dropped = timepoint if this_confirmed ==1
(3,119 missing values generated)

. 
. by patid this_spa: egen lastdrop = min(dropped)
(1295 missing values generated)

. 
. 
. 
. drop if lastdrop!=.
(1,880 observations deleted)

. gen count = (timepoint==last)

. keep if timepoint==last
(1,259 observations deleted)

. use "E:\users\amy.mason\staph_carriage\Datasets\record_per_spa.dta", clear

. tab this_spa

   spa type |      Freq.     Percent        Cum.
------------+-----------------------------------
       t002 |        344        2.47        2.47
       t004 |         10        0.07        2.55
       t005 |        199        1.43        3.98
       t006 |         13        0.09        4.07
       t008 |        272        1.96        6.03
       t010 |         37        0.27        6.29
       t012 |        899        6.47       12.76
       t015 |        157        1.13       13.89
       t017 |         25        0.18       14.07
       t018 |         75        0.54       14.61
       t019 |         26        0.19       14.80
       t021 |        354        2.55       17.34
       t022 |         11        0.08       17.42
       t024 |         74        0.53       17.95
       t026 |        104        0.75       18.70
       t031 |         37        0.27       18.97
       t032 |        175        1.26       20.23
       t037 |         86        0.62       20.84
       t040 |          9        0.06       20.91
       t045 |         36        0.26       21.17
       t050 |         42        0.30       21.47
       t053 |         13        0.09       21.56
       t056 |        134        0.96       22.53
       t061 |         37        0.27       22.79
       t065 |         77        0.55       23.35
       t071 |         24        0.17       23.52
       t078 |        117        0.84       24.36
       t084 |        400        2.88       27.24
       t085 |         86        0.62       27.86
       t088 |          9        0.06       27.92
       t089 |        109        0.78       28.71
       t091 |        220        1.58       30.29
       t096 |         36        0.26       30.55
     t10184 |         19        0.14       30.68
      t1023 |         37        0.27       30.95
     t10237 |         25        0.18       31.13
      t1036 |         25        0.18       31.31
      t1040 |         24        0.17       31.48
      t1046 |         25        0.18       31.66
       t105 |         13        0.09       31.76
     t10514 |         39        0.28       32.04
      t1070 |         13        0.09       32.13
      t1078 |         27        0.19       32.32
      t1094 |         37        0.27       32.59
     t11040 |         22        0.16       32.75
     t11041 |         24        0.17       32.92
     t11042 |         22        0.16       33.08
     t11048 |         24        0.17       33.25
     t11252 |         39        0.28       33.53
      t1149 |          4        0.03       33.56
      t1166 |         25        0.18       33.74
     t11779 |         25        0.18       33.92
       t120 |         46        0.33       34.25
       t121 |         37        0.27       34.52
     t12151 |         29        0.21       34.73
       t122 |         37        0.27       34.99
      t1236 |          3        0.02       35.01
      t1239 |         25        0.18       35.19
      t1245 |         22        0.16       35.35
      t1255 |         19        0.14       35.49
      t1265 |         20        0.14       35.63
       t127 |        337        2.42       38.06
     t12838 |         31        0.22       38.28
      t1306 |          8        0.06       38.34
      t1347 |         24        0.17       38.51
       t136 |        113        0.81       39.32
      t1362 |         21        0.15       39.47
       t140 |         13        0.09       39.57
      t1402 |         36        0.26       39.83
      t1414 |         89        0.64       40.47
       t144 |         13        0.09       40.56
      t1445 |         14        0.10       40.66
      t1451 |         34        0.24       40.90
     t14529 |         37        0.27       41.17
     t14530 |         36        0.26       41.43
      t1476 |          7        0.05       41.48
       t148 |         18        0.13       41.61
      t1492 |         13        0.09       41.70
     t14942 |         36        0.26       41.96
      t1509 |          9        0.06       42.03
      t1510 |         14        0.10       42.13
      t1521 |         24        0.17       42.30
      t1541 |         90        0.65       42.95
      t1544 |         16        0.12       43.06
     t15751 |         37        0.27       43.33
     t15752 |         29        0.21       43.54
      t1577 |         25        0.18       43.72
     t15775 |         22        0.16       43.88
     t15776 |         26        0.19       44.06
     t15777 |         22        0.16       44.22
     t15780 |         34        0.24       44.47
      t1596 |         39        0.28       44.75
       t160 |        213        1.53       46.28
      t1626 |         28        0.20       46.48
       t164 |        132        0.95       47.43
       t166 |         70        0.50       47.93
      t1685 |         13        0.09       48.03
       t171 |         87        0.63       48.65
      t1712 |         25        0.18       48.83
      t1716 |         59        0.42       49.26
      t1720 |         13        0.09       49.35
      t1736 |         21        0.15       49.50
       t177 |         13        0.09       49.59
      t1827 |         13        0.09       49.69
      t1854 |         25        0.18       49.87
       t186 |         54        0.39       50.26
      t1877 |         10        0.07       50.33
      t1885 |         24        0.17       50.50
       t189 |        179        1.29       51.79
       t190 |         41        0.29       52.08
      t1908 |         38        0.27       52.36
       t192 |         50        0.36       52.72
       t195 |         27        0.19       52.91
       t196 |         21        0.15       53.06
      t1963 |         25        0.18       53.24
      t1987 |         73        0.53       53.77
      t2029 |         49        0.35       54.12
      t2074 |         12        0.09       54.20
       t209 |         95        0.68       54.89
      t2098 |         10        0.07       54.96
      t2115 |          3        0.02       54.98
      t2119 |         23        0.17       55.15
       t213 |         58        0.42       55.56
      t2133 |         12        0.09       55.65
      t2143 |         11        0.08       55.73
       t216 |        219        1.58       57.30
       t219 |         13        0.09       57.40
       t223 |         61        0.44       57.84
       t227 |         46        0.33       58.17
      t2271 |         85        0.61       58.78
       t228 |         22        0.16       58.94
      t2292 |         12        0.09       59.02
       t230 |        120        0.86       59.89
      t2365 |         24        0.17       60.06
      t2422 |         38        0.27       60.33
      t2455 |         13        0.09       60.43
      t2556 |         13        0.09       60.52
       t258 |         49        0.35       60.87
      t2643 |         25        0.18       61.05
       t267 |        170        1.22       62.27
      t2726 |         30        0.22       62.49
       t273 |         24        0.17       62.66
       t275 |         50        0.36       63.02
       t279 |         61        0.44       63.46
       t280 |         34        0.24       63.71
      t2842 |         17        0.12       63.83
      t2849 |         13        0.09       63.92
      t2868 |         11        0.08       64.00
      t2883 |         13        0.09       64.09
      t2930 |         13        0.09       64.19
      t2933 |         25        0.18       64.37
       t298 |         38        0.27       64.64
      t3072 |         12        0.09       64.73
      t3085 |         13        0.09       64.82
      t3092 |         13        0.09       64.91
      t3097 |         12        0.09       65.00
       t310 |         10        0.07       65.07
       t316 |         26        0.19       65.26
       t318 |         58        0.42       65.68
       t321 |         13        0.09       65.77
      t3240 |          3        0.02       65.79
      t3262 |         26        0.19       65.98
      t3284 |         13        0.09       66.07
       t330 |         13        0.09       66.17
      t3304 |         63        0.45       66.62
       t334 |         10        0.07       66.69
      t3345 |         13        0.09       66.78
       t335 |         13        0.09       66.88
      t3369 |         12        0.09       66.96
       t337 |         26        0.19       67.15
       t338 |         63        0.45       67.60
       t342 |         26        0.19       67.79
       t346 |        159        1.14       68.93
       t349 |         47        0.34       69.27
       t350 |         13        0.09       69.37
       t360 |         74        0.53       69.90
      t3610 |         10        0.07       69.97
       t363 |          5        0.04       70.01
       t364 |        150        1.08       71.09
       t370 |         22        0.16       71.24
      t3732 |         13        0.09       71.34
       t375 |          7        0.05       71.39
       t377 |        111        0.80       72.19
       t379 |         64        0.46       72.65
       t382 |         73        0.53       73.17
       t386 |         14        0.10       73.27
      t3879 |         11        0.08       73.35
       t393 |         39        0.28       73.63
       t398 |          9        0.06       73.70
       t399 |         12        0.09       73.78
      t3992 |         25        0.18       73.96
       t400 |         26        0.19       74.15
       t401 |         24        0.17       74.32
       t408 |         95        0.68       75.01
       t410 |         37        0.27       75.27
      t4309 |         34        0.24       75.52
      t4322 |         24        0.17       75.69
       t442 |         13        0.09       75.78
      t4451 |         13        0.09       75.88
       t449 |         13        0.09       75.97
      t4549 |         13        0.09       76.06
       t471 |         11        0.08       76.14
      t4714 |          7        0.05       76.19
      t4776 |         10        0.07       76.26
       t491 |         18        0.13       76.39
       t493 |         46        0.33       76.72
       t499 |         46        0.33       77.06
       t505 |         50        0.36       77.41
      t5133 |         25        0.18       77.59
       t521 |          7        0.05       77.65
      t5211 |          9        0.06       77.71
       t525 |          3        0.02       77.73
       t528 |         54        0.39       78.12
       t530 |         17        0.12       78.24
       t537 |          9        0.06       78.31
       t543 |         24        0.17       78.48
       t548 |         25        0.18       78.66
       t550 |         12        0.09       78.75
       t559 |         25        0.18       78.93
      t5635 |          9        0.06       78.99
       t570 |         12        0.09       79.08
       t571 |        255        1.83       80.91
       t575 |         27        0.19       81.10
      t5753 |         13        0.09       81.20
       t579 |         16        0.12       81.31
      t5855 |         13        0.09       81.41
       t589 |         13        0.09       81.50
      t5973 |         13        0.09       81.59
       t605 |         71        0.51       82.10
       t608 |         37        0.27       82.37
      t6134 |         23        0.17       82.54
      t6154 |         26        0.19       82.72
       t620 |         73        0.53       83.25
      t6292 |         34        0.24       83.49
       t630 |        105        0.76       84.25
      t6390 |         26        0.19       84.44
      t6415 |         25        0.18       84.61
      t6416 |         24        0.17       84.79
      t6417 |         25        0.18       84.97
       t643 |         13        0.09       85.06
       t645 |         39        0.28       85.34
      t6584 |         12        0.09       85.43
       t659 |         53        0.38       85.81
      t6703 |         25        0.18       85.99
      t6791 |         13        0.09       86.08
      t6792 |         25        0.18       86.26
      t6793 |         13        0.09       86.36
      t6794 |         25        0.18       86.54
      t6795 |         13        0.09       86.63
      t6796 |         25        0.18       86.81
      t6797 |         36        0.26       87.07
      t6798 |         13        0.09       87.16
      t6799 |         25        0.18       87.34
      t6800 |          6        0.04       87.38
      t6801 |          3        0.02       87.41
      t6803 |         50        0.36       87.77
      t6804 |         13        0.09       87.86
      t6806 |          6        0.04       87.90
      t6807 |          7        0.05       87.95
      t6808 |         24        0.17       88.12
      t6809 |          7        0.05       88.18
      t6810 |         12        0.09       88.26
      t6811 |         25        0.18       88.44
      t6814 |         13        0.09       88.53
      t6815 |         13        0.09       88.63
      t6816 |         10        0.07       88.70
      t6817 |         26        0.19       88.89
      t6820 |          5        0.04       88.92
      t6821 |         50        0.36       89.28
      t6823 |          3        0.02       89.30
      t6825 |         13        0.09       89.40
      t6826 |         13        0.09       89.49
      t6828 |         23        0.17       89.66
      t6829 |          8        0.06       89.71
      t6831 |         13        0.09       89.81
      t6833 |         23        0.17       89.97
      t6835 |         13        0.09       90.07
      t6854 |          8        0.06       90.12
      t6855 |         13        0.09       90.22
      t6856 |         24        0.17       90.39
      t6899 |         13        0.09       90.48
       t693 |         24        0.17       90.66
      t6940 |          7        0.05       90.71
      t6941 |         11        0.08       90.79
      t6942 |         38        0.27       91.06
       t701 |          5        0.04       91.10
      t7031 |         25        0.18       91.28
      t7032 |          7        0.05       91.33
      t7049 |         38        0.27       91.60
      t7050 |         13        0.09       91.69
      t7060 |         13        0.09       91.79
       t710 |         16        0.12       91.90
      t7154 |         16        0.12       92.02
      t7205 |         13        0.09       92.11
       t730 |         13        0.09       92.20
       t731 |         10        0.07       92.28
       t737 |         13        0.09       92.37
      t7409 |         13        0.09       92.46
      t7421 |         23        0.17       92.63
       t748 |         39        0.28       92.91
      t7514 |         38        0.27       93.18
       t773 |          7        0.05       93.23
       t774 |         14        0.10       93.33
       t779 |         14        0.10       93.43
      t7855 |         13        0.09       93.53
       t786 |          3        0.02       93.55
      t7871 |         13        0.09       93.64
       t789 |          9        0.06       93.71
       t803 |         25        0.18       93.89
      t8062 |         39        0.28       94.17
      t8084 |         13        0.09       94.26
       t817 |         12        0.09       94.35
      t8518 |         24        0.17       94.52
       t853 |         13        0.09       94.61
      t8585 |         25        0.18       94.79
      t8600 |         36        0.26       95.05
       t870 |         13        0.09       95.14
       t871 |          9        0.06       95.21
       t880 |         13        0.09       95.30
      t8811 |         25        0.18       95.48
      t8868 |         12        0.09       95.57
       t888 |         46        0.33       95.90
       t908 |         13        0.09       95.99
       t910 |         26        0.19       96.18
      t9108 |         13        0.09       96.27
      t9162 |         12        0.09       96.36
       t922 |         36        0.26       96.62
       t938 |         13        0.09       96.71
      t9383 |         22        0.16       96.87
       t939 |         10        0.07       96.94
       t948 |         37        0.27       97.21
       t954 |         13        0.09       97.30
      t9572 |         13        0.09       97.40
      t9584 |         12        0.09       97.48
      t9726 |         37        0.27       97.75
       t975 |         13        0.09       97.84
      t9794 |         25        0.18       98.02
      t9873 |         24        0.17       98.19
       t996 |         25        0.18       98.37
      t9973 |         55        0.40       98.77
       txAE |         33        0.24       99.01
       txAG |         34        0.24       99.25
       txAH |         29        0.21       99.46
       txAI |         38        0.27       99.73
       txAJ |         37        0.27      100.00
------------+-----------------------------------
      Total |     13,903      100.00

. tab this_spa, m

   spa type |      Freq.     Percent        Cum.
------------+-----------------------------------
            |      1,690       10.84       10.84
       t002 |        344        2.21       13.04
       t004 |         10        0.06       13.11
       t005 |        199        1.28       14.38
       t006 |         13        0.08       14.47
       t008 |        272        1.74       16.21
       t010 |         37        0.24       16.45
       t012 |        899        5.77       22.22
       t015 |        157        1.01       23.22
       t017 |         25        0.16       23.38
       t018 |         75        0.48       23.86
       t019 |         26        0.17       24.03
       t021 |        354        2.27       26.30
       t022 |         11        0.07       26.37
       t024 |         74        0.47       26.85
       t026 |        104        0.67       27.51
       t031 |         37        0.24       27.75
       t032 |        175        1.12       28.87
       t037 |         86        0.55       29.42
       t040 |          9        0.06       29.48
       t045 |         36        0.23       29.71
       t050 |         42        0.27       29.98
       t053 |         13        0.08       30.06
       t056 |        134        0.86       30.92
       t061 |         37        0.24       31.16
       t065 |         77        0.49       31.66
       t071 |         24        0.15       31.81
       t078 |        117        0.75       32.56
       t084 |        400        2.57       35.12
       t085 |         86        0.55       35.68
       t088 |          9        0.06       35.73
       t089 |        109        0.70       36.43
       t091 |        220        1.41       37.84
       t096 |         36        0.23       38.07
     t10184 |         19        0.12       38.20
      t1023 |         37        0.24       38.43
     t10237 |         25        0.16       38.59
      t1036 |         25        0.16       38.75
      t1040 |         24        0.15       38.91
      t1046 |         25        0.16       39.07
       t105 |         13        0.08       39.15
     t10514 |         39        0.25       39.40
      t1070 |         13        0.08       39.49
      t1078 |         27        0.17       39.66
      t1094 |         37        0.24       39.90
     t11040 |         22        0.14       40.04
     t11041 |         24        0.15       40.19
     t11042 |         22        0.14       40.33
     t11048 |         24        0.15       40.49
     t11252 |         39        0.25       40.74
      t1149 |          4        0.03       40.76
      t1166 |         25        0.16       40.92
     t11779 |         25        0.16       41.08
       t120 |         46        0.30       41.38
       t121 |         37        0.24       41.61
     t12151 |         29        0.19       41.80
       t122 |         37        0.24       42.04
      t1236 |          3        0.02       42.06
      t1239 |         25        0.16       42.22
      t1245 |         22        0.14       42.36
      t1255 |         19        0.12       42.48
      t1265 |         20        0.13       42.61
       t127 |        337        2.16       44.77
     t12838 |         31        0.20       44.97
      t1306 |          8        0.05       45.02
      t1347 |         24        0.15       45.17
       t136 |        113        0.72       45.90
      t1362 |         21        0.13       46.03
       t140 |         13        0.08       46.12
      t1402 |         36        0.23       46.35
      t1414 |         89        0.57       46.92
       t144 |         13        0.08       47.00
      t1445 |         14        0.09       47.09
      t1451 |         34        0.22       47.31
     t14529 |         37        0.24       47.55
     t14530 |         36        0.23       47.78
      t1476 |          7        0.04       47.82
       t148 |         18        0.12       47.94
      t1492 |         13        0.08       48.02
     t14942 |         36        0.23       48.25
      t1509 |          9        0.06       48.31
      t1510 |         14        0.09       48.40
      t1521 |         24        0.15       48.55
      t1541 |         90        0.58       49.13
      t1544 |         16        0.10       49.23
     t15751 |         37        0.24       49.47
     t15752 |         29        0.19       49.66
      t1577 |         25        0.16       49.82
     t15775 |         22        0.14       49.96
     t15776 |         26        0.17       50.13
     t15777 |         22        0.14       50.27
     t15780 |         34        0.22       50.48
      t1596 |         39        0.25       50.73
       t160 |        213        1.37       52.10
      t1626 |         28        0.18       52.28
       t164 |        132        0.85       53.13
       t166 |         70        0.45       53.58
      t1685 |         13        0.08       53.66
       t171 |         87        0.56       54.22
      t1712 |         25        0.16       54.38
      t1716 |         59        0.38       54.76
      t1720 |         13        0.08       54.84
      t1736 |         21        0.13       54.97
       t177 |         13        0.08       55.06
      t1827 |         13        0.08       55.14
      t1854 |         25        0.16       55.30
       t186 |         54        0.35       55.65
      t1877 |         10        0.06       55.71
      t1885 |         24        0.15       55.86
       t189 |        179        1.15       57.01
       t190 |         41        0.26       57.28
      t1908 |         38        0.24       57.52
       t192 |         50        0.32       57.84
       t195 |         27        0.17       58.01
       t196 |         21        0.13       58.15
      t1963 |         25        0.16       58.31
      t1987 |         73        0.47       58.78
      t2029 |         49        0.31       59.09
      t2074 |         12        0.08       59.17
       t209 |         95        0.61       59.78
      t2098 |         10        0.06       59.84
      t2115 |          3        0.02       59.86
      t2119 |         23        0.15       60.01
       t213 |         58        0.37       60.38
      t2133 |         12        0.08       60.46
      t2143 |         11        0.07       60.53
       t216 |        219        1.40       61.93
       t219 |         13        0.08       62.02
       t223 |         61        0.39       62.41
       t227 |         46        0.30       62.70
      t2271 |         85        0.55       63.25
       t228 |         22        0.14       63.39
      t2292 |         12        0.08       63.46
       t230 |        120        0.77       64.23
      t2365 |         24        0.15       64.39
      t2422 |         38        0.24       64.63
      t2455 |         13        0.08       64.71
      t2556 |         13        0.08       64.80
       t258 |         49        0.31       65.11
      t2643 |         25        0.16       65.27
       t267 |        170        1.09       66.36
      t2726 |         30        0.19       66.56
       t273 |         24        0.15       66.71
       t275 |         50        0.32       67.03
       t279 |         61        0.39       67.42
       t280 |         34        0.22       67.64
      t2842 |         17        0.11       67.75
      t2849 |         13        0.08       67.83
      t2868 |         11        0.07       67.90
      t2883 |         13        0.08       67.99
      t2930 |         13        0.08       68.07
      t2933 |         25        0.16       68.23
       t298 |         38        0.24       68.47
      t3072 |         12        0.08       68.55
      t3085 |         13        0.08       68.63
      t3092 |         13        0.08       68.72
      t3097 |         12        0.08       68.79
       t310 |         10        0.06       68.86
       t316 |         26        0.17       69.02
       t318 |         58        0.37       69.40
       t321 |         13        0.08       69.48
      t3240 |          3        0.02       69.50
      t3262 |         26        0.17       69.67
      t3284 |         13        0.08       69.75
       t330 |         13        0.08       69.83
      t3304 |         63        0.40       70.24
       t334 |         10        0.06       70.30
      t3345 |         13        0.08       70.38
       t335 |         13        0.08       70.47
      t3369 |         12        0.08       70.54
       t337 |         26        0.17       70.71
       t338 |         63        0.40       71.12
       t342 |         26        0.17       71.28
       t346 |        159        1.02       72.30
       t349 |         47        0.30       72.60
       t350 |         13        0.08       72.69
       t360 |         74        0.47       73.16
      t3610 |         10        0.06       73.23
       t363 |          5        0.03       73.26
       t364 |        150        0.96       74.22
       t370 |         22        0.14       74.36
      t3732 |         13        0.08       74.44
       t375 |          7        0.04       74.49
       t377 |        111        0.71       75.20
       t379 |         64        0.41       75.61
       t382 |         73        0.47       76.08
       t386 |         14        0.09       76.17
      t3879 |         11        0.07       76.24
       t393 |         39        0.25       76.49
       t398 |          9        0.06       76.55
       t399 |         12        0.08       76.62
      t3992 |         25        0.16       76.78
       t400 |         26        0.17       76.95
       t401 |         24        0.15       77.11
       t408 |         95        0.61       77.71
       t410 |         37        0.24       77.95
      t4309 |         34        0.22       78.17
      t4322 |         24        0.15       78.32
       t442 |         13        0.08       78.41
      t4451 |         13        0.08       78.49
       t449 |         13        0.08       78.57
      t4549 |         13        0.08       78.66
       t471 |         11        0.07       78.73
      t4714 |          7        0.04       78.77
      t4776 |         10        0.06       78.84
       t491 |         18        0.12       78.95
       t493 |         46        0.30       79.25
       t499 |         46        0.30       79.54
       t505 |         50        0.32       79.86
      t5133 |         25        0.16       80.02
       t521 |          7        0.04       80.07
      t5211 |          9        0.06       80.13
       t525 |          3        0.02       80.14
       t528 |         54        0.35       80.49
       t530 |         17        0.11       80.60
       t537 |          9        0.06       80.66
       t543 |         24        0.15       80.81
       t548 |         25        0.16       80.97
       t550 |         12        0.08       81.05
       t559 |         25        0.16       81.21
      t5635 |          9        0.06       81.27
       t570 |         12        0.08       81.34
       t571 |        255        1.64       82.98
       t575 |         27        0.17       83.15
      t5753 |         13        0.08       83.24
       t579 |         16        0.10       83.34
      t5855 |         13        0.08       83.42
       t589 |         13        0.08       83.51
      t5973 |         13        0.08       83.59
       t605 |         71        0.46       84.04
       t608 |         37        0.24       84.28
      t6134 |         23        0.15       84.43
      t6154 |         26        0.17       84.60
       t620 |         73        0.47       85.06
      t6292 |         34        0.22       85.28
       t630 |        105        0.67       85.96
      t6390 |         26        0.17       86.12
      t6415 |         25        0.16       86.28
      t6416 |         24        0.15       86.44
      t6417 |         25        0.16       86.60
       t643 |         13        0.08       86.68
       t645 |         39        0.25       86.93
      t6584 |         12        0.08       87.01
       t659 |         53        0.34       87.35
      t6703 |         25        0.16       87.51
      t6791 |         13        0.08       87.59
      t6792 |         25        0.16       87.75
      t6793 |         13        0.08       87.83
      t6794 |         25        0.16       87.99
      t6795 |         13        0.08       88.08
      t6796 |         25        0.16       88.24
      t6797 |         36        0.23       88.47
      t6798 |         13        0.08       88.55
      t6799 |         25        0.16       88.71
      t6800 |          6        0.04       88.75
      t6801 |          3        0.02       88.77
      t6803 |         50        0.32       89.09
      t6804 |         13        0.08       89.17
      t6806 |          6        0.04       89.21
      t6807 |          7        0.04       89.26
      t6808 |         24        0.15       89.41
      t6809 |          7        0.04       89.46
      t6810 |         12        0.08       89.53
      t6811 |         25        0.16       89.69
      t6814 |         13        0.08       89.78
      t6815 |         13        0.08       89.86
      t6816 |         10        0.06       89.92
      t6817 |         26        0.17       90.09
      t6820 |          5        0.03       90.12
      t6821 |         50        0.32       90.44
      t6823 |          3        0.02       90.46
      t6825 |         13        0.08       90.55
      t6826 |         13        0.08       90.63
      t6828 |         23        0.15       90.78
      t6829 |          8        0.05       90.83
      t6831 |         13        0.08       90.91
      t6833 |         23        0.15       91.06
      t6835 |         13        0.08       91.14
      t6854 |          8        0.05       91.19
      t6855 |         13        0.08       91.28
      t6856 |         24        0.15       91.43
      t6899 |         13        0.08       91.52
       t693 |         24        0.15       91.67
      t6940 |          7        0.04       91.71
      t6941 |         11        0.07       91.78
      t6942 |         38        0.24       92.03
       t701 |          5        0.03       92.06
      t7031 |         25        0.16       92.22
      t7032 |          7        0.04       92.27
      t7049 |         38        0.24       92.51
      t7050 |         13        0.08       92.59
      t7060 |         13        0.08       92.68
       t710 |         16        0.10       92.78
      t7154 |         16        0.10       92.88
      t7205 |         13        0.08       92.96
       t730 |         13        0.08       93.05
       t731 |         10        0.06       93.11
       t737 |         13        0.08       93.20
      t7409 |         13        0.08       93.28
      t7421 |         23        0.15       93.43
       t748 |         39        0.25       93.68
      t7514 |         38        0.24       93.92
       t773 |          7        0.04       93.97
       t774 |         14        0.09       94.06
       t779 |         14        0.09       94.14
      t7855 |         13        0.08       94.23
       t786 |          3        0.02       94.25
      t7871 |         13        0.08       94.33
       t789 |          9        0.06       94.39
       t803 |         25        0.16       94.55
      t8062 |         39        0.25       94.80
      t8084 |         13        0.08       94.88
       t817 |         12        0.08       94.96
      t8518 |         24        0.15       95.11
       t853 |         13        0.08       95.20
      t8585 |         25        0.16       95.36
      t8600 |         36        0.23       95.59
       t870 |         13        0.08       95.67
       t871 |          9        0.06       95.73
       t880 |         13        0.08       95.81
      t8811 |         25        0.16       95.97
      t8868 |         12        0.08       96.05
       t888 |         46        0.30       96.34
       t908 |         13        0.08       96.43
       t910 |         26        0.17       96.59
      t9108 |         13        0.08       96.68
      t9162 |         12        0.08       96.75
       t922 |         36        0.23       96.99
       t938 |         13        0.08       97.07
      t9383 |         22        0.14       97.21
       t939 |         10        0.06       97.27
       t948 |         37        0.24       97.51
       t954 |         13        0.08       97.60
      t9572 |         13        0.08       97.68
      t9584 |         12        0.08       97.76
      t9726 |         37        0.24       97.99
       t975 |         13        0.08       98.08
      t9794 |         25        0.16       98.24
      t9873 |         24        0.15       98.39
       t996 |         25        0.16       98.55
      t9973 |         55        0.35       98.90
       txAE |         33        0.21       99.11
       txAG |         34        0.22       99.33
       txAH |         29        0.19       99.52
       txAI |         38        0.24       99.76
       txAJ |         37        0.24      100.00
------------+-----------------------------------
      Total |     15,593      100.00

. 
. use "E:\users\amy.mason\staph_carriage\Datasets\record_per_spa.dta", clear

. 
. * keep only the spatypes that start after timepoint 0/2 - ie those we know aquired during study

. 
.  keep patid timepoint this_spa carriage_this_spa  this_confirmed_loss

. 
. sort patid this_spa timepoint

. 
. by patid this_spa: drop if carriage_this_spa[1]==1& carriage_this_spa[2]==1
(4,412 observations deleted)

. 
. * drop people who never carry

. 
. drop if this_spa==""
(1,690 observations deleted)

. 
. * find people who are still carrying this spatype at end of their current swabs (min 74)

. 
. by patid this_spa: gen last = timepoint[_N]

. 
. drop if last<74
(6,975 observations deleted)

. 
. gen dropped = timepoint if this_confirmed ==1
(2,460 missing values generated)

. 
. by patid this_spa: egen lastdrop = min(dropped)
(636 missing values generated)

. 
. 
. 
. drop if lastdrop!=.
(1,880 observations deleted)

. 
. keep if timepoint==last
(618 observations deleted)

. use "E:\users\amy.mason\staph_carriage\Datasets\record_per_spa.dta", clear

. 
. * keep only the spatypes that start after timepoint 0/2 - ie those we know aquired during study

. 
.  keep patid timepoint this_spa carriage_this_spa  this_confirmed_loss

. 
. sort patid this_spa timepoint

. 
. by patid this_spa: drop if carriage_this_spa[1]==1& carriage_this_spa[2]==1
(4,412 observations deleted)

. 
. * drop people who never carry

. 
. drop if this_spa==""
(1,690 observations deleted)

. 
. * find people who are still carrying this spatype at end of their current swabs (min 74)

. 
. by patid this_spa: gen last = timepoint[_N]

. 
. drop if last<74
(6,975 observations deleted)

. 
. gen dropped = timepoint if this_confirmed ==1
(2,460 missing values generated)

. 
. by patid this_spa: egen lastdrop = min(dropped)
(636 missing values generated)

. 
. 
. 
. drop if lastdrop!=.
(1,880 observations deleted)

. 
. keep if timepoint==last
(618 observations deleted)

. 
. 
. 
.  noi di "people still carrying spas aquired during study"
people still carrying spas aquired during study

. 
. noi tab patid

Participant |
         ID |      Freq.     Percent        Cum.
------------+-----------------------------------
        366 |          1        5.56        5.56
        374 |          2       11.11       16.67
        418 |          1        5.56       22.22
        420 |          1        5.56       27.78
        424 |          1        5.56       33.33
        671 |          1        5.56       38.89
        993 |          1        5.56       44.44
       1218 |          1        5.56       50.00
       1219 |          1        5.56       55.56
       1231 |          2       11.11       66.67
       1233 |          1        5.56       72.22
       1295 |          2       11.11       83.33
       1332 |          2       11.11       94.44
       1359 |          1        5.56      100.00
------------+-----------------------------------
      Total |         18      100.00

. 
. noi tab patid this_spa

Participan |                                              spa type
       tID |      t008       t012       t021       t065      t1094      t1402      t1414     t14942      t2271 |     Total
-----------+---------------------------------------------------------------------------------------------------+----------
       366 |         0          0          0          0          0          0          0          1          0 |         1 
       374 |         0          0          0          0          0          1          0          0          0 |         2 
       418 |         0          0          0          0          1          0          0          0          0 |         1 
       420 |         0          0          0          0          0          0          1          0          0 |         1 
       424 |         0          0          0          0          0          0          0          0          0 |         1 
       671 |         0          0          0          0          0          0          0          0          0 |         1 
       993 |         1          0          0          0          0          0          0          0          0 |         1 
      1218 |         0          1          0          0          0          0          0          0          0 |         1 
      1219 |         0          0          1          0          0          0          0          0          0 |         1 
      1231 |         0          0          0          0          0          0          0          0          0 |         2 
      1233 |         0          0          0          0          0          0          0          0          1 |         1 
      1295 |         0          0          0          1          0          0          0          0          0 |         2 
      1332 |         0          0          0          0          0          0          0          0          0 |         2 
      1359 |         0          0          0          0          0          0          0          0          0 |         1 
-----------+---------------------------------------------------------------------------------------------------+----------
     Total |         1          1          1          1          1          1          1          1          1 |        18 


Participan |                                              spa type
       tID |      t267       t279       t499      t8600       txAE       txAG       txAH       txAI       txAJ |     Total
-----------+---------------------------------------------------------------------------------------------------+----------
       366 |         0          0          0          0          0          0          0          0          0 |         1 
       374 |         0          0          0          1          0          0          0          0          0 |         2 
       418 |         0          0          0          0          0          0          0          0          0 |         1 
       420 |         0          0          0          0          0          0          0          0          0 |         1 
       424 |         0          0          0          0          0          0          0          1          0 |         1 
       671 |         0          0          0          0          1          0          0          0          0 |         1 
       993 |         0          0          0          0          0          0          0          0          0 |         1 
      1218 |         0          0          0          0          0          0          0          0          0 |         1 
      1219 |         0          0          0          0          0          0          0          0          0 |         1 
      1231 |         0          0          1          0          0          1          0          0          0 |         2 
      1233 |         0          0          0          0          0          0          0          0          0 |         1 
      1295 |         0          0          0          0          0          0          1          0          0 |         2 
      1332 |         0          1          0          0          0          0          0          0          1 |         2 
      1359 |         1          0          0          0          0          0          0          0          0 |         1 
-----------+---------------------------------------------------------------------------------------------------+----------
     Total |         1          1          1          1          1          1          1          1          1 |        18 


. 
. noi tab patid timepoint

Participan |            timepoint
       tID |        82         84         88 |     Total
-----------+---------------------------------+----------
       366 |         0          0          1 |         1 
       374 |         0          0          2 |         2 
       418 |         0          0          1 |         1 
       420 |         0          0          1 |         1 
       424 |         0          0          1 |         1 
       671 |         0          0          1 |         1 
       993 |         0          1          0 |         1 
      1218 |         1          0          0 |         1 
      1219 |         1          0          0 |         1 
      1231 |         2          0          0 |         2 
      1233 |         1          0          0 |         1 
      1295 |         2          0          0 |         2 
      1332 |         2          0          0 |         2 
      1359 |         1          0          0 |         1 
-----------+---------------------------------+----------
     Total |        10          1          7 |        18 


. 
. 
. use  "E:\users\amy.mason\staph_carriage\Datasets\clean_data4.dta", clear

. use  "E:\users\amy.mason\staph_carriage\Datasets\clean_data4.dta", clear 

. 
. keep patid timepoint spatype pos confirmedneg pos_so_far neg_so_far carriage_to newspa*

. ********* drop those without varied carriage

. 
. gen green = 1 if carriage=="varies"
(6,238 missing values generated)

. 
. bysort patid: egen greenmax = max(green)
(4587 missing values generated)

. **** drop those not still returning swabs 

. 
. bysort patid: gen last = timepoint[_N]

. 
. drop if last <74
(7,118 observations deleted)

. drop if greenmax==.
(1,051 observations deleted)

. ************************

. 
. keep patid timepoint newspa_prev carriage

. list, sepby(patid)

     +----------------------------------------+
     | patid   timepo~t   newspa~v   carria~e |
     |----------------------------------------|
  1. |   302          0          0     always |
  2. |   302          2          0     always |
  3. |   302          4          0     always |
  4. |   302          6          0     always |
  5. |   302          8          0     always |
  6. |   302         10          0     always |
  7. |   302         12          0     always |
  8. |   302         14          0     always |
  9. |   302         16          0     always |
 10. |   302         18          0     always |
 11. |   302         20          0     always |
 12. |   302         22          0     always |
 13. |   302         24          0     always |
 14. |   302         26          0     always |
 15. |   302         28          0     always |
 16. |   302         30          0     always |
 17. |   302         32          0     varies |
 18. |   302         34          0     varies |
 19. |   302         36          1     varies |
 20. |   302         38          0     varies |
 21. |   302         40          0     varies |
 22. |   302         42          0     varies |
 23. |   302         44          0     varies |
 24. |   302         46          0     varies |
 25. |   302         48          0     varies |
 26. |   302         68          0     varies |
 27. |   302         70          1     varies |
 28. |   302         72          0     varies |
 29. |   302         74          0     varies |
 30. |   302         78          0     varies |
 31. |   302         80          0     varies |
 32. |   302         82          0     varies |
 33. |   302         84          0     varies |
 34. |   302         86          0     varies |
 35. |   302         88          0     varies |
 36. |   302         90          0     varies |
     |----------------------------------------|
 37. |   374          0          0     always |
 38. |   374          2          0     always |
 39. |   374          4          0     always |
 40. |   374          6          0     always |
 41. |   374          8          0     always |
 42. |   374         10          0     always |
 43. |   374         12          0     always |
 44. |   374         14          0     always |
 45. |   374         16          0     always |
 46. |   374         18          0     always |
 47. |   374         20          0     always |
 48. |   374         22          0     always |
 49. |   374         24          0     always |
 50. |   374         26          0     always |
 51. |   374         28          0     always |
 52. |   374         30          0     always |
 53. |   374         32          0     always |
 54. |   374         34          0     always |
 55. |   374         36          0     always |
 56. |   374         38          0     always |
 57. |   374         40          0     always |
 58. |   374         42          0     always |
 59. |   374         44          0     always |
 60. |   374         46          0     always |
 61. |   374         48          0     always |
 62. |   374         64          0     always |
 63. |   374         70          0     always |
 64. |   374         72          0     always |
 65. |   374         74          0     always |
 66. |   374         76          0     always |
 67. |   374         78          1     always |
 68. |   374         80          0     always |
 69. |   374         82          0     varies |
 70. |   374         84          0     varies |
 71. |   374         86          1     varies |
 72. |   374         88          1     varies |
     |----------------------------------------|
 73. |   407          0          0     always |
 74. |   407          2          0     varies |
 75. |   407          4          0     varies |
 76. |   407          6          0     varies |
 77. |   407          8          0     varies |
 78. |   407         10          0     varies |
 79. |   407         12          0     varies |
 80. |   407         14          0     varies |
 81. |   407         16          0     varies |
 82. |   407         18          0     varies |
 83. |   407         20          0     varies |
 84. |   407         22          0     varies |
 85. |   407         24          0     varies |
 86. |   407         26          0     varies |
 87. |   407         28          0     varies |
 88. |   407         30          0     varies |
 89. |   407         32          0     varies |
 90. |   407         34          0     varies |
 91. |   407         38          0     varies |
 92. |   407         40          1     varies |
 93. |   407         42          0     varies |
 94. |   407         44          0     varies |
 95. |   407         46          0     varies |
 96. |   407         48          1     varies |
 97. |   407         66          0     varies |
 98. |   407         70          0     varies |
 99. |   407         72          0     varies |
100. |   407         74          0     varies |
101. |   407         76          0     varies |
102. |   407         78          0     varies |
103. |   407         80          0     varies |
104. |   407         84          0     varies |
105. |   407         86          0     varies |
106. |   407         88          0     varies |
     |----------------------------------------|
107. |   412          0          0     always |
108. |   412          2          0     always |
109. |   412          4          0     always |
110. |   412          6          0     always |
111. |   412         10          0     always |
112. |   412         12          0     always |
113. |   412         14          0     always |
114. |   412         16          0     always |
115. |   412         18          0     varies |
116. |   412         20          0     varies |
117. |   412         22          0     varies |
118. |   412         24          0     varies |
119. |   412         26          0     varies |
120. |   412         28          0     varies |
121. |   412         30          0     varies |
122. |   412         32          1     varies |
123. |   412         34          0     varies |
124. |   412         36          0     varies |
125. |   412         38          0     varies |
126. |   412         40          0     varies |
127. |   412         42          0     varies |
128. |   412         44          0     varies |
129. |   412         46          1     varies |
130. |   412         48          0     varies |
131. |   412         62          0     varies |
132. |   412         64          0     varies |
133. |   412         66          0     varies |
134. |   412         68          0     varies |
135. |   412         70          0     varies |
136. |   412         72          0     varies |
137. |   412         74          0     varies |
138. |   412         76          0     varies |
139. |   412         78          0     varies |
140. |   412         80          0     varies |
141. |   412         82          0     varies |
142. |   412         84          0     varies |
143. |   412         86          0     varies |
     |----------------------------------------|
144. |   418          0          0     always |
145. |   418          2          0     always |
146. |   418          4          0     always |
147. |   418          6          0     always |
148. |   418          8          0     always |
149. |   418         10          0     always |
150. |   418         12          0     always |
151. |   418         14          0     always |
152. |   418         16          0     always |
153. |   418         18          0     always |
154. |   418         22          0     always |
155. |   418         24          0     always |
156. |   418         26          0     always |
157. |   418         28          0     always |
158. |   418         30          0     always |
159. |   418         32          0     varies |
160. |   418         34          0     varies |
161. |   418         36          0     varies |
162. |   418         38          1     varies |
163. |   418         40          0     varies |
164. |   418         42          0     varies |
165. |   418         44          1     varies |
166. |   418         46          0     varies |
167. |   418         48          0     varies |
168. |   418         64          1     varies |
169. |   418         66          0     varies |
170. |   418         68          0     varies |
171. |   418         70          0     varies |
172. |   418         72          0     varies |
173. |   418         74          0     varies |
174. |   418         76          0     varies |
175. |   418         78          1     varies |
176. |   418         80          1     varies |
177. |   418         82          0     varies |
178. |   418         84          0     varies |
179. |   418         86          0     varies |
180. |   418         88          1     varies |
     |----------------------------------------|
181. |   993          0          0     always |
182. |   993          2          0     always |
183. |   993          4          0     always |
184. |   993          6          0     always |
185. |   993          8          1     always |
186. |   993         10          0     always |
187. |   993         12          0     always |
188. |   993         14          0     varies |
189. |   993         16          0     varies |
190. |   993         18          0     varies |
191. |   993         20          0     varies |
192. |   993         22          0     varies |
193. |   993         24          0     varies |
194. |   993         26          0     varies |
195. |   993         28          0     varies |
196. |   993         30          0     varies |
197. |   993         32          1     varies |
198. |   993         34          0     varies |
199. |   993         36          0     varies |
200. |   993         38          0     varies |
201. |   993         40          0     varies |
202. |   993         42          0     varies |
203. |   993         44          0     varies |
204. |   993         46          1     varies |
205. |   993         48          0     varies |
206. |   993         58          0     varies |
207. |   993         60          1     varies |
208. |   993         62          0     varies |
209. |   993         64          1     varies |
210. |   993         66          0     varies |
211. |   993         68          1     varies |
212. |   993         70          0     varies |
213. |   993         72          0     varies |
214. |   993         74          0     varies |
215. |   993         76          1     varies |
216. |   993         78          0     varies |
217. |   993         80          0     varies |
218. |   993         82          0     varies |
219. |   993         84          1     varies |
     |----------------------------------------|
220. |  1211          0          0      never |
221. |  1211          2          0      never |
222. |  1211          4          0      never |
223. |  1211          6          0      never |
224. |  1211          8          0      never |
225. |  1211         10          0      never |
226. |  1211         12          0      never |
227. |  1211         14          0      never |
228. |  1211         16          0      never |
229. |  1211         18          0      never |
230. |  1211         20          0      never |
231. |  1211         22          0      never |
232. |  1211         24          0      never |
233. |  1211         26          0      never |
234. |  1211         28          0      never |
235. |  1211         30          0      never |
236. |  1211         32          0      never |
237. |  1211         34          0      never |
238. |  1211         36          0      never |
239. |  1211         38          0      never |
240. |  1211         40          0      never |
241. |  1211         42          0      never |
242. |  1211         44          0      never |
243. |  1211         46          0      never |
244. |  1211         48          0      never |
245. |  1211         58          1     varies |
246. |  1211         60          0     varies |
247. |  1211         62          0     varies |
248. |  1211         64          0     varies |
249. |  1211         68          0     varies |
250. |  1211         70          0     varies |
251. |  1211         72          0     varies |
252. |  1211         74          0     varies |
253. |  1211         76          0     varies |
254. |  1211         78          0     varies |
255. |  1211         80          0     varies |
256. |  1211         82          0     varies |
257. |  1211         84          0     varies |
     |----------------------------------------|
258. |  1215          0          0     always |
259. |  1215          2          0     always |
260. |  1215          4          0     always |
261. |  1215          6          0     always |
262. |  1215          8          0     always |
263. |  1215         10          0     always |
264. |  1215         12          0     always |
265. |  1215         14          0     always |
266. |  1215         16          0     always |
267. |  1215         18          0     always |
268. |  1215         20          0     always |
269. |  1215         22          0     always |
270. |  1215         24          0     always |
271. |  1215         26          0     always |
272. |  1215         28          0     always |
273. |  1215         30          0     always |
274. |  1215         32          0     always |
275. |  1215         34          0     always |
276. |  1215         36          0     always |
277. |  1215         38          0     always |
278. |  1215         40          0     always |
279. |  1215         42          0     always |
280. |  1215         44          0     always |
281. |  1215         46          0     always |
282. |  1215         48          0     always |
283. |  1215         56          0     varies |
284. |  1215         58          0     varies |
285. |  1215         60          0     varies |
286. |  1215         62          0     varies |
287. |  1215         64          0     varies |
288. |  1215         68          0     varies |
289. |  1215         70          0     varies |
290. |  1215         72          0     varies |
291. |  1215         74          0     varies |
292. |  1215         76          0     varies |
293. |  1215         78          0     varies |
294. |  1215         80          0     varies |
295. |  1215         82          0     varies |
296. |  1215         84          0     varies |
     |----------------------------------------|
297. |  1218          0          0      never |
298. |  1218          2          0      never |
299. |  1218          4          0      never |
300. |  1218          6          0      never |
301. |  1218          8          0      never |
302. |  1218         10          0      never |
303. |  1218         12          0      never |
304. |  1218         14          0      never |
305. |  1218         16          0      never |
306. |  1218         18          0      never |
307. |  1218         20          0      never |
308. |  1218         22          0      never |
309. |  1218         24          1     varies |
310. |  1218         26          0     varies |
311. |  1218         28          0     varies |
312. |  1218         30          0     varies |
313. |  1218         32          0     varies |
314. |  1218         34          0     varies |
315. |  1218         36          0     varies |
316. |  1218         38          0     varies |
317. |  1218         40          0     varies |
318. |  1218         42          0     varies |
319. |  1218         44          0     varies |
320. |  1218         46          0     varies |
321. |  1218         48          1     varies |
322. |  1218         58          0     varies |
323. |  1218         60          0     varies |
324. |  1218         62          0     varies |
325. |  1218         64          0     varies |
326. |  1218         66          0     varies |
327. |  1218         68          0     varies |
328. |  1218         70          0     varies |
329. |  1218         72          0     varies |
330. |  1218         74          0     varies |
331. |  1218         76          0     varies |
332. |  1218         80          0     varies |
333. |  1218         82          0     varies |
     |----------------------------------------|
334. |  1219          0          0      never |
335. |  1219          2          0      never |
336. |  1219          4          0      never |
337. |  1219          6          0      never |
338. |  1219          8          0      never |
339. |  1219         10          0      never |
340. |  1219         14          0      never |
341. |  1219         16          0      never |
342. |  1219         18          0      never |
343. |  1219         20          0      never |
344. |  1219         22          1     varies |
345. |  1219         24          0     varies |
346. |  1219         26          0     varies |
347. |  1219         28          0     varies |
348. |  1219         30          0     varies |
349. |  1219         32          0     varies |
350. |  1219         34          0     varies |
351. |  1219         36          0     varies |
352. |  1219         38          0     varies |
353. |  1219         40          0     varies |
354. |  1219         42          0     varies |
355. |  1219         44          0     varies |
356. |  1219         46          0     varies |
357. |  1219         48          0     varies |
358. |  1219         58          0     varies |
359. |  1219         64          0     varies |
360. |  1219         66          0     varies |
361. |  1219         68          0     varies |
362. |  1219         70          0     varies |
363. |  1219         72          0     varies |
364. |  1219         74          0     varies |
365. |  1219         76          0     varies |
366. |  1219         78          0     varies |
367. |  1219         82          0     varies |
     |----------------------------------------|
368. |  1236          0          0      never |
369. |  1236          2          0      never |
370. |  1236          4          0      never |
371. |  1236          6          0      never |
372. |  1236          8          0      never |
373. |  1236         10          0      never |
374. |  1236         12          0      never |
375. |  1236         14          0      never |
376. |  1236         16          0      never |
377. |  1236         18          0      never |
378. |  1236         20          0      never |
379. |  1236         22          0      never |
380. |  1236         24          0      never |
381. |  1236         26          1     varies |
382. |  1236         28          0     varies |
383. |  1236         30          0     varies |
384. |  1236         32          0     varies |
385. |  1236         34          0     varies |
386. |  1236         36          0     varies |
387. |  1236         38          0     varies |
388. |  1236         40          0     varies |
389. |  1236         42          0     varies |
390. |  1236         44          0     varies |
391. |  1236         46          0     varies |
392. |  1236         48          0     varies |
393. |  1236         64          0     varies |
394. |  1236         68          0     varies |
395. |  1236         70          0     varies |
396. |  1236         72          0     varies |
397. |  1236         74          0     varies |
398. |  1236         76          0     varies |
399. |  1236         78          0     varies |
400. |  1236         80          0     varies |
401. |  1236         82          0     varies |
     |----------------------------------------|
402. |  1244          0          0      never |
403. |  1244          2          0      never |
404. |  1244          4          0      never |
405. |  1244          6          0      never |
406. |  1244          8          0      never |
407. |  1244         10          0      never |
408. |  1244         12          0      never |
409. |  1244         14          0      never |
410. |  1244         16          0      never |
411. |  1244         18          0      never |
412. |  1244         20          0      never |
413. |  1244         22          0      never |
414. |  1244         24          0      never |
415. |  1244         26          0      never |
416. |  1244         28          0      never |
417. |  1244         30          0      never |
418. |  1244         32          0      never |
419. |  1244         34          0      never |
420. |  1244         36          0      never |
421. |  1244         38          0      never |
422. |  1244         40          0      never |
423. |  1244         42          0      never |
424. |  1244         44          1     varies |
425. |  1244         46          0     varies |
426. |  1244         48          0     varies |
427. |  1244         58          0     varies |
428. |  1244         62          0     varies |
429. |  1244         64          0     varies |
430. |  1244         66          0     varies |
431. |  1244         68          1     varies |
432. |  1244         70          0     varies |
433. |  1244         72          0     varies |
434. |  1244         76          0     varies |
435. |  1244         78          0     varies |
436. |  1244         80          0     varies |
437. |  1244         82          0     varies |
     |----------------------------------------|
438. |  1261          0          0     always |
439. |  1261          2          0     always |
440. |  1261          4          0     always |
441. |  1261          6          0     always |
442. |  1261          8          0     always |
443. |  1261         10          0     always |
444. |  1261         12          0     always |
445. |  1261         14          0     always |
446. |  1261         16          0     always |
447. |  1261         18          0     always |
448. |  1261         20          0     always |
449. |  1261         22          0     always |
450. |  1261         24          0     always |
451. |  1261         26          0     always |
452. |  1261         30          0     always |
453. |  1261         32          0     always |
454. |  1261         34          0     always |
455. |  1261         36          0     always |
456. |  1261         38          0     always |
457. |  1261         40          0     always |
458. |  1261         42          0     always |
459. |  1261         46          0     always |
460. |  1261         48          0     always |
461. |  1261         60          1     always |
462. |  1261         64          0     always |
463. |  1261         66          0     varies |
464. |  1261         68          0     varies |
465. |  1261         70          0     varies |
466. |  1261         72          0     varies |
467. |  1261         74          0     varies |
468. |  1261         76          0     varies |
469. |  1261         78          0     varies |
470. |  1261         80          0     varies |
471. |  1261         82          0     varies |
     |----------------------------------------|
472. |  1274          0          0     always |
473. |  1274          2          0     always |
474. |  1274          4          0     always |
475. |  1274          6          0     always |
476. |  1274          8          0     always |
477. |  1274         10          0     always |
478. |  1274         12          0     always |
479. |  1274         14          0     varies |
480. |  1274         16          0     varies |
481. |  1274         18          0     varies |
482. |  1274         20          1     varies |
483. |  1274         22          0     varies |
484. |  1274         24          0     varies |
485. |  1274         26          0     varies |
486. |  1274         28          0     varies |
487. |  1274         30          0     varies |
488. |  1274         32          0     varies |
489. |  1274         34          1     varies |
490. |  1274         36          1     varies |
491. |  1274         38          0     varies |
492. |  1274         40          1     varies |
493. |  1274         42          0     varies |
494. |  1274         44          0     varies |
495. |  1274         46          0     varies |
496. |  1274         48          1     varies |
497. |  1274         56          0     varies |
498. |  1274         58          0     varies |
499. |  1274         60          0     varies |
500. |  1274         62          1     varies |
501. |  1274         64          0     varies |
502. |  1274         66          0     varies |
503. |  1274         70          0     varies |
504. |  1274         72          1     varies |
505. |  1274         74          0     varies |
506. |  1274         76          1     varies |
507. |  1274         78          0     varies |
508. |  1274         80          0     varies |
509. |  1274         82          0     varies |
     |----------------------------------------|
510. |  1295          0          0      never |
511. |  1295          2          0      never |
512. |  1295          4          0      never |
513. |  1295          8          0      never |
514. |  1295         10          0      never |
515. |  1295         12          0      never |
516. |  1295         14          0      never |
517. |  1295         16          0      never |
518. |  1295         18          0      never |
519. |  1295         22          0      never |
520. |  1295         24          0      never |
521. |  1295         26          0      never |
522. |  1295         30          0      never |
523. |  1295         32          0      never |
524. |  1295         34          0      never |
525. |  1295         36          0      never |
526. |  1295         38          1     varies |
527. |  1295         40          0     varies |
528. |  1295         44          0     varies |
529. |  1295         46          0     varies |
530. |  1295         50          0     varies |
531. |  1295         58          0     varies |
532. |  1295         64          0     varies |
533. |  1295         70          1     varies |
534. |  1295         74          0     varies |
535. |  1295         76          0     varies |
536. |  1295         78          1     varies |
537. |  1295         80          0     varies |
538. |  1295         82          0     varies |
     |----------------------------------------|
539. |  1316          0          0     always |
540. |  1316          2          0     always |
541. |  1316          4          0     always |
542. |  1316          6          0     always |
543. |  1316          8          0     always |
544. |  1316         10          0     always |
545. |  1316         12          0     always |
546. |  1316         14          0     always |
547. |  1316         16          0     always |
548. |  1316         18          0     always |
549. |  1316         20          0     always |
550. |  1316         22          0     always |
551. |  1316         24          1     always |
552. |  1316         26          0     always |
553. |  1316         28          0     always |
554. |  1316         30          0     always |
555. |  1316         32          0     always |
556. |  1316         34          0     always |
557. |  1316         36          0     always |
558. |  1316         38          0     always |
559. |  1316         40          0     always |
560. |  1316         42          0     always |
561. |  1316         44          0     always |
562. |  1316         46          0     always |
563. |  1316         48          0     always |
564. |  1316         56          0     always |
565. |  1316         58          0     always |
566. |  1316         60          0     varies |
567. |  1316         62          0     varies |
568. |  1316         64          0     varies |
569. |  1316         66          0     varies |
570. |  1316         68          0     varies |
571. |  1316         70          0     varies |
572. |  1316         72          0     varies |
573. |  1316         74          0     varies |
574. |  1316         76          0     varies |
575. |  1316         78          0     varies |
576. |  1316         80          0     varies |
577. |  1316         82          0     varies |
     |----------------------------------------|
578. |  1332          0          0      never |
579. |  1332          2          0      never |
580. |  1332          4          0      never |
581. |  1332          6          0      never |
582. |  1332          8          0      never |
583. |  1332         10          0      never |
584. |  1332         12          0      never |
585. |  1332         14          0      never |
586. |  1332         16          0      never |
587. |  1332         18          0      never |
588. |  1332         20          0      never |
589. |  1332         22          0      never |
590. |  1332         24          0      never |
591. |  1332         26          0      never |
592. |  1332         28          0      never |
593. |  1332         30          0      never |
594. |  1332         32          0      never |
595. |  1332         34          0      never |
596. |  1332         36          0      never |
597. |  1332         40          0      never |
598. |  1332         42          0      never |
599. |  1332         44          0      never |
600. |  1332         46          0      never |
601. |  1332         48          1     varies |
602. |  1332         56          0     varies |
603. |  1332         60          0     varies |
604. |  1332         62          0     varies |
605. |  1332         64          0     varies |
606. |  1332         66          0     varies |
607. |  1332         68          1     varies |
608. |  1332         70          0     varies |
609. |  1332         72          0     varies |
610. |  1332         74          1     varies |
611. |  1332         76          0     varies |
612. |  1332         78          0     varies |
613. |  1332         80          0     varies |
614. |  1332         82          1     varies |
     |----------------------------------------|
615. |  1359          0          0      never |
616. |  1359          2          0      never |
617. |  1359          4          0      never |
618. |  1359          6          0      never |
619. |  1359          8          0      never |
620. |  1359         10          0      never |
621. |  1359         12          0      never |
622. |  1359         14          0      never |
623. |  1359         16          0      never |
624. |  1359         18          0      never |
625. |  1359         20          0      never |
626. |  1359         22          0      never |
627. |  1359         24          0      never |
628. |  1359         26          1     varies |
629. |  1359         28          0     varies |
630. |  1359         30          0     varies |
631. |  1359         32          0     varies |
632. |  1359         34          0     varies |
633. |  1359         36          0     varies |
634. |  1359         38          0     varies |
635. |  1359         40          0     varies |
636. |  1359         42          0     varies |
637. |  1359         44          0     varies |
638. |  1359         46          0     varies |
639. |  1359         48          0     varies |
640. |  1359         58          1     varies |
641. |  1359         60          0     varies |
642. |  1359         62          0     varies |
643. |  1359         66          0     varies |
644. |  1359         68          0     varies |
645. |  1359         70          0     varies |
646. |  1359         72          0     varies |
647. |  1359         74          0     varies |
648. |  1359         76          0     varies |
649. |  1359         78          0     varies |
650. |  1359         80          0     varies |
651. |  1359         82          0     varies |
     |----------------------------------------|
652. |  1370          0          0      never |
653. |  1370          2          0      never |
654. |  1370          4          0      never |
655. |  1370          6          0      never |
656. |  1370          8          0      never |
657. |  1370         10          0      never |
658. |  1370         12          0      never |
659. |  1370         14          0      never |
660. |  1370         16          0      never |
661. |  1370         18          0      never |
662. |  1370         20          0      never |
663. |  1370         22          0      never |
664. |  1370         24          0      never |
665. |  1370         26          0      never |
666. |  1370         28          0      never |
667. |  1370         30          0      never |
668. |  1370         32          0      never |
669. |  1370         34          0      never |
670. |  1370         36          0      never |
671. |  1370         38          0      never |
672. |  1370         40          0      never |
673. |  1370         42          1     varies |
674. |  1370         44          0     varies |
675. |  1370         46          0     varies |
676. |  1370         48          0     varies |
677. |  1370         56          0     varies |
678. |  1370         62          0     varies |
679. |  1370         64          0     varies |
680. |  1370         68          0     varies |
681. |  1370         70          0     varies |
682. |  1370         72          0     varies |
683. |  1370         78          0     varies |
684. |  1370         80          0     varies |
     |----------------------------------------|
685. |  1372          0          0      never |
686. |  1372          2          0      never |
687. |  1372          4          0      never |
688. |  1372          6          0      never |
689. |  1372          8          0      never |
690. |  1372         10          0      never |
691. |  1372         12          0      never |
692. |  1372         14          0      never |
693. |  1372         16          0      never |
694. |  1372         18          0      never |
695. |  1372         20          0      never |
696. |  1372         22          0      never |
697. |  1372         24          0      never |
698. |  1372         26          1     varies |
699. |  1372         28          0     varies |
700. |  1372         30          0     varies |
701. |  1372         32          0     varies |
702. |  1372         34          0     varies |
703. |  1372         36          0     varies |
704. |  1372         38          0     varies |
705. |  1372         40          0     varies |
706. |  1372         42          0     varies |
707. |  1372         44          0     varies |
708. |  1372         46          0     varies |
709. |  1372         48          0     varies |
710. |  1372         58          0     varies |
711. |  1372         60          0     varies |
712. |  1372         62          0     varies |
713. |  1372         64          0     varies |
714. |  1372         66          0     varies |
715. |  1372         68          0     varies |
716. |  1372         70          0     varies |
717. |  1372         74          0     varies |
718. |  1372         76          0     varies |
719. |  1372         78          0     varies |
720. |  1372         80          0     varies |
     |----------------------------------------|
721. |  1375          0          0      never |
722. |  1375          2          0      never |
723. |  1375          4          0      never |
724. |  1375          6          0      never |
725. |  1375          8          1     varies |
726. |  1375         10          0     varies |
727. |  1375         12          0     varies |
728. |  1375         14          0     varies |
729. |  1375         16          0     varies |
730. |  1375         18          0     varies |
731. |  1375         20          0     varies |
732. |  1375         22          1     varies |
733. |  1375         24          0     varies |
734. |  1375         26          0     varies |
735. |  1375         28          0     varies |
736. |  1375         30          0     varies |
737. |  1375         32          0     varies |
738. |  1375         34          0     varies |
739. |  1375         36          0     varies |
740. |  1375         40          1     varies |
741. |  1375         42          0     varies |
742. |  1375         44          0     varies |
743. |  1375         46          0     varies |
744. |  1375         48          0     varies |
745. |  1375         56          0     varies |
746. |  1375         58          0     varies |
747. |  1375         60          0     varies |
748. |  1375         62          0     varies |
749. |  1375         64          0     varies |
750. |  1375         66          0     varies |
751. |  1375         68          0     varies |
752. |  1375         70          0     varies |
753. |  1375         72          0     varies |
754. |  1375         74          0     varies |
755. |  1375         76          0     varies |
756. |  1375         78          0     varies |
757. |  1375         80          0     varies |
     |----------------------------------------|
758. |  1395          0          0      never |
759. |  1395          6          0      never |
760. |  1395          8          0      never |
761. |  1395         10          0      never |
762. |  1395         12          0      never |
763. |  1395         14          0      never |
764. |  1395         16          0      never |
765. |  1395         18          0      never |
766. |  1395         20          0      never |
767. |  1395         22          0      never |
768. |  1395         24          0      never |
769. |  1395         26          0      never |
770. |  1395         28          0      never |
771. |  1395         30          0      never |
772. |  1395         32          0      never |
773. |  1395         34          0      never |
774. |  1395         36          0      never |
775. |  1395         38          0      never |
776. |  1395         40          0      never |
777. |  1395         42          0      never |
778. |  1395         44          0      never |
779. |  1395         46          0      never |
780. |  1395         48          0      never |
781. |  1395         58          0      never |
782. |  1395         60          0      never |
783. |  1395         62          1     varies |
784. |  1395         64          0     varies |
785. |  1395         66          0     varies |
786. |  1395         68          0     varies |
787. |  1395         70          0     varies |
788. |  1395         72          0     varies |
789. |  1395         74          0     varies |
790. |  1395         76          0     varies |
791. |  1395         78          0     varies |
792. |  1395         80          0     varies |
     |----------------------------------------|
793. |  2055          0          0      never |
794. |  2055          2          0      never |
795. |  2055          4          0      never |
796. |  2055          6          0      never |
797. |  2055          8          0      never |
798. |  2055         12          0      never |
799. |  2055         14          0      never |
800. |  2055         16          0      never |
801. |  2055         18          0      never |
802. |  2055         20          0      never |
803. |  2055         24          0      never |
804. |  2055         28          0      never |
805. |  2055         30          0      never |
806. |  2055         32          0      never |
807. |  2055         36          0      never |
808. |  2055         38          0      never |
809. |  2055         40          0      never |
810. |  2055         42          0      never |
811. |  2055         44          1     varies |
812. |  2055         46          0     varies |
813. |  2055         48          0     varies |
814. |  2055         60          0     varies |
815. |  2055         64          0     varies |
816. |  2055         66          0     varies |
817. |  2055         70          0     varies |
818. |  2055         72          0     varies |
819. |  2055         74          0     varies |
820. |  2055         76          0     varies |
821. |  2055         78          0     varies |
822. |  2055         80          0     varies |
823. |  2055         82          0     varies |
     +----------------------------------------+

. use  "E:\users\amy.mason\staph_carriage\Datasets\clean_data4.dta", clear 

. 
. keep patid timepoint spatype pos confirmedneg pos_so_far neg_so_far carriage_to newspa*

. 
. **** drop those not still returning swabs 

. 
. bysort patid: gen last = timepoint[_N]

. 
. drop if last <74
(7,118 observations deleted)

. 
. ********* drop those without varied carriage

. 
. gen green = 1 if carriage=="varies"
(1,429 missing values generated)

. 
. bysort patid: egen greenmax = max(green)
(1051 missing values generated)

. 
. drop if greenmax==.
(1,051 observations deleted)

. 
. 
. 
. ************************

. 
. keep patid timepoint spatype newspa_prev carriage

. 
. 
. 
. noi list, sepby(patid)

     +------------------------------------------------------+
     | patid   timepo~t       spatype   newspa~v   carria~e |
     |------------------------------------------------------|
  1. |   302          0          t620          0     always |
  2. |   302          2          t620          0     always |
  3. |   302          4          t620          0     always |
  4. |   302          6          t620          0     always |
  5. |   302          8          t620          0     always |
  6. |   302         10          t620          0     always |
  7. |   302         12          t620          0     always |
  8. |   302         14          t620          0     always |
  9. |   302         16          t620          0     always |
 10. |   302         18          t620          0     always |
 11. |   302         20          t620          0     always |
 12. |   302         22          t620          0     always |
 13. |   302         24          t620          0     always |
 14. |   302         26          t620          0     always |
 15. |   302         28          t620          0     always |
 16. |   302         30          t620          0     always |
 17. |   302         32                        0     varies |
 18. |   302         34                        0     varies |
 19. |   302         36          t620          1     varies |
 20. |   302         38                        0     varies |
 21. |   302         40          t620          0     varies |
 22. |   302         42          t620          0     varies |
 23. |   302         44          t620          0     varies |
 24. |   302         46          t620          0     varies |
 25. |   302         48          t620          0     varies |
 26. |   302         68          t620          0     varies |
 27. |   302         70         t1414          1     varies |
 28. |   302         72          t620          0     varies |
 29. |   302         74          t620          0     varies |
 30. |   302         78          t620          0     varies |
 31. |   302         80                        0     varies |
 32. |   302         82                        0     varies |
 33. |   302         84                        0     varies |
 34. |   302         86                        0     varies |
 35. |   302         88                        0     varies |
 36. |   302         90                        0     varies |
     |------------------------------------------------------|
 37. |   374          0          t037          0     always |
 38. |   374          2          t037          0     always |
 39. |   374          4          t037          0     always |
 40. |   374          6          t037          0     always |
 41. |   374          8          t037          0     always |
 42. |   374         10          t037          0     always |
 43. |   374         12          t037          0     always |
 44. |   374         14          t037          0     always |
 45. |   374         16          t037          0     always |
 46. |   374         18          t037          0     always |
 47. |   374         20          t037          0     always |
 48. |   374         22          t037          0     always |
 49. |   374         24          t037          0     always |
 50. |   374         26          t037          0     always |
 51. |   374         28          t037          0     always |
 52. |   374         30          t037          0     always |
 53. |   374         32          t037          0     always |
 54. |   374         34          t037          0     always |
 55. |   374         36          t037          0     always |
 56. |   374         38          t037          0     always |
 57. |   374         40          t037          0     always |
 58. |   374         42          t037          0     always |
 59. |   374         44          t037          0     always |
 60. |   374         46          t037          0     always |
 61. |   374         48          t037          0     always |
 62. |   374         64          t037          0     always |
 63. |   374         70          t037          0     always |
 64. |   374         72          t037          0     always |
 65. |   374         74          t037          0     always |
 66. |   374         76          t037          0     always |
 67. |   374         78    t037/t2029          1     always |
 68. |   374         80          t037          0     always |
 69. |   374         82                        0     varies |
 70. |   374         84                        0     varies |
 71. |   374         86         t1402          1     varies |
 72. |   374         88         t8600          1     varies |
     |------------------------------------------------------|
 73. |   407          0          t227          0     always |
 74. |   407          2                        0     varies |
 75. |   407          4                        0     varies |
 76. |   407          6                        0     varies |
 77. |   407          8                        0     varies |
 78. |   407         10                        0     varies |
 79. |   407         12                        0     varies |
 80. |   407         14                        0     varies |
 81. |   407         16                        0     varies |
 82. |   407         18                        0     varies |
 83. |   407         20                        0     varies |
 84. |   407         22                        0     varies |
 85. |   407         24                        0     varies |
 86. |   407         26                        0     varies |
 87. |   407         28                        0     varies |
 88. |   407         30                        0     varies |
 89. |   407         32                        0     varies |
 90. |   407         34                        0     varies |
 91. |   407         38                        0     varies |
 92. |   407         40          t026          1     varies |
 93. |   407         42          t026          0     varies |
 94. |   407         44                        0     varies |
 95. |   407         46                        0     varies |
 96. |   407         48          t026          1     varies |
 97. |   407         66                        0     varies |
 98. |   407         70                        0     varies |
 99. |   407         72                        0     varies |
100. |   407         74                        0     varies |
101. |   407         76                        0     varies |
102. |   407         78                        0     varies |
103. |   407         80                        0     varies |
104. |   407         84                        0     varies |
105. |   407         86                        0     varies |
106. |   407         88                        0     varies |
     |------------------------------------------------------|
107. |   412          0          t209          0     always |
108. |   412          2          t209          0     always |
109. |   412          4          t209          0     always |
110. |   412          6          t209          0     always |
111. |   412         10          t209          0     always |
112. |   412         12          t209          0     always |
113. |   412         14          t209          0     always |
114. |   412         16          t209          0     always |
115. |   412         18                        0     varies |
116. |   412         20                        0     varies |
117. |   412         22                        0     varies |
118. |   412         24                        0     varies |
119. |   412         26                        0     varies |
120. |   412         28                        0     varies |
121. |   412         30                        0     varies |
122. |   412         32          t061          1     varies |
123. |   412         34          t061          0     varies |
124. |   412         36          t061          0     varies |
125. |   412         38          t061          0     varies |
126. |   412         40          t061          0     varies |
127. |   412         42                        0     varies |
128. |   412         44                        0     varies |
129. |   412         46          t061          1     varies |
130. |   412         48                        0     varies |
131. |   412         62          t061          0     varies |
132. |   412         64          t061          0     varies |
133. |   412         66          t061          0     varies |
134. |   412         68          t061          0     varies |
135. |   412         70          t061          0     varies |
136. |   412         72          t061          0     varies |
137. |   412         74          t061          0     varies |
138. |   412         76          t061          0     varies |
139. |   412         78          t061          0     varies |
140. |   412         80          t061          0     varies |
141. |   412         82          t061          0     varies |
142. |   412         84          t061          0     varies |
143. |   412         86                        0     varies |
     |------------------------------------------------------|
144. |   418          0          t127          0     always |
145. |   418          2          t948          0     always |
146. |   418          4          t127          0     always |
147. |   418          6          t127          0     always |
148. |   418          8          t127          0     always |
149. |   418         10          t127          0     always |
150. |   418         12          t127          0     always |
151. |   418         14          t127          0     always |
152. |   418         16          t127          0     always |
153. |   418         18                        0     always |
154. |   418         22          t127          0     always |
155. |   418         24          t127          0     always |
156. |   418         26          t127          0     always |
157. |   418         28          t127          0     always |
158. |   418         30          t127          0     always |
159. |   418         32                        0     varies |
160. |   418         34                        0     varies |
161. |   418         36                        0     varies |
162. |   418         38          t127          1     varies |
163. |   418         40          t127          0     varies |
164. |   418         42          t127          0     varies |
165. |   418         44          t267          1     varies |
166. |   418         46          t267          0     varies |
167. |   418         48          t267          0     varies |
168. |   418         64          t121          1     varies |
169. |   418         66          t121          0     varies |
170. |   418         68                        0     varies |
171. |   418         70                        0     varies |
172. |   418         72                        0     varies |
173. |   418         74                        0     varies |
174. |   418         76                        0     varies |
175. |   418         78          t002          1     varies |
176. |   418         80         t1094          1     varies |
177. |   418         82         t1094          0     varies |
178. |   418         84         t1094          0     varies |
179. |   418         86         t1094          0     varies |
180. |   418         88          t002          1     varies |
     |------------------------------------------------------|
181. |   993          0          t012          0     always |
182. |   993          2          t012          0     always |
183. |   993          4          t012          0     always |
184. |   993          6          t012          0     always |
185. |   993          8          t748          1     always |
186. |   993         10          t012          0     always |
187. |   993         12     t021/t012          0     always |
188. |   993         14                        0     varies |
189. |   993         16                        0     varies |
190. |   993         18                        0     varies |
191. |   993         20                        0     varies |
192. |   993         22                        0     varies |
193. |   993         24                        0     varies |
194. |   993         26                        0     varies |
195. |   993         28                        0     varies |
196. |   993         30                        0     varies |
197. |   993         32        t10514          1     varies |
198. |   993         34        t10514          0     varies |
199. |   993         36        t10514          0     varies |
200. |   993         38        t10514          0     varies |
201. |   993         40        t10514          0     varies |
202. |   993         42        t10514          0     varies |
203. |   993         44                        0     varies |
204. |   993         46         t8062          1     varies |
205. |   993         48         t8062          0     varies |
206. |   993         58         t8062          0     varies |
207. |   993         60          t021          1     varies |
208. |   993         62          t021          0     varies |
209. |   993         64          t364          1     varies |
210. |   993         66          t364          0     varies |
211. |   993         68        t11252          1     varies |
212. |   993         70        t11252          0     varies |
213. |   993         72        t11252          0     varies |
214. |   993         74                        0     varies |
215. |   993         76          t393          1     varies |
216. |   993         78          t393          0     varies |
217. |   993         80                        0     varies |
218. |   993         82                        0     varies |
219. |   993         84          t008          1     varies |
     |------------------------------------------------------|
220. |  1211          0                        0      never |
221. |  1211          2                        0      never |
222. |  1211          4                        0      never |
223. |  1211          6                        0      never |
224. |  1211          8                        0      never |
225. |  1211         10                        0      never |
226. |  1211         12                        0      never |
227. |  1211         14                        0      never |
228. |  1211         16                        0      never |
229. |  1211         18                        0      never |
230. |  1211         20                        0      never |
231. |  1211         22                        0      never |
232. |  1211         24                        0      never |
233. |  1211         26                        0      never |
234. |  1211         28                        0      never |
235. |  1211         30                        0      never |
236. |  1211         32                        0      never |
237. |  1211         34                        0      never |
238. |  1211         36                        0      never |
239. |  1211         38                        0      never |
240. |  1211         40                        0      never |
241. |  1211         42                        0      never |
242. |  1211         44                        0      never |
243. |  1211         46                        0      never |
244. |  1211         48                        0      never |
245. |  1211         58          t056          1     varies |
246. |  1211         60                        0     varies |
247. |  1211         62                        0     varies |
248. |  1211         64                        0     varies |
249. |  1211         68                        0     varies |
250. |  1211         70                        0     varies |
251. |  1211         72                        0     varies |
252. |  1211         74                        0     varies |
253. |  1211         76                        0     varies |
254. |  1211         78                        0     varies |
255. |  1211         80                        0     varies |
256. |  1211         82                        0     varies |
257. |  1211         84                        0     varies |
     |------------------------------------------------------|
258. |  1215          0          t630          0     always |
259. |  1215          2          t630          0     always |
260. |  1215          4          t630          0     always |
261. |  1215          6          t630          0     always |
262. |  1215          8                        0     always |
263. |  1215         10          t630          0     always |
264. |  1215         12          t630          0     always |
265. |  1215         14          t630          0     always |
266. |  1215         16          t630          0     always |
267. |  1215         18          t630          0     always |
268. |  1215         20          t630          0     always |
269. |  1215         22          t630          0     always |
270. |  1215         24                        0     always |
271. |  1215         26          t630          0     always |
272. |  1215         28          t630          0     always |
273. |  1215         30          t630          0     always |
274. |  1215         32          t630          0     always |
275. |  1215         34          t630          0     always |
276. |  1215         36          t630          0     always |
277. |  1215         38          t630          0     always |
278. |  1215         40          t630          0     always |
279. |  1215         42          t630          0     always |
280. |  1215         44          t630          0     always |
281. |  1215         46          t630          0     always |
282. |  1215         48          t630          0     always |
283. |  1215         56                        0     varies |
284. |  1215         58                        0     varies |
285. |  1215         60                        0     varies |
286. |  1215         62                        0     varies |
287. |  1215         64                        0     varies |
288. |  1215         68                        0     varies |
289. |  1215         70                        0     varies |
290. |  1215         72                        0     varies |
291. |  1215         74                        0     varies |
292. |  1215         76                        0     varies |
293. |  1215         78                        0     varies |
294. |  1215         80                        0     varies |
295. |  1215         82                        0     varies |
296. |  1215         84                        0     varies |
     |------------------------------------------------------|
297. |  1218          0                        0      never |
298. |  1218          2                        0      never |
299. |  1218          4                        0      never |
300. |  1218          6                        0      never |
301. |  1218          8                        0      never |
302. |  1218         10                        0      never |
303. |  1218         12                        0      never |
304. |  1218         14                        0      never |
305. |  1218         16                        0      never |
306. |  1218         18                        0      never |
307. |  1218         20                        0      never |
308. |  1218         22                        0      never |
309. |  1218         24          t012          1     varies |
310. |  1218         26          t012          0     varies |
311. |  1218         28          t012          0     varies |
312. |  1218         30          t012          0     varies |
313. |  1218         32          t012          0     varies |
314. |  1218         34          t012          0     varies |
315. |  1218         36          t012          0     varies |
316. |  1218         38          t012          0     varies |
317. |  1218         40          t012          0     varies |
318. |  1218         42          t012          0     varies |
319. |  1218         44          t012          0     varies |
320. |  1218         46          t012          0     varies |
321. |  1218         48     t012/t630          1     varies |
322. |  1218         58          t012          0     varies |
323. |  1218         60          t012          0     varies |
324. |  1218         62                        0     varies |
325. |  1218         64          t012          0     varies |
326. |  1218         66          t012          0     varies |
327. |  1218         68          t012          0     varies |
328. |  1218         70          t012          0     varies |
329. |  1218         72          t275          0     varies |
330. |  1218         74          t012          0     varies |
331. |  1218         76          t012          0     varies |
332. |  1218         80          t012          0     varies |
333. |  1218         82          t012          0     varies |
     |------------------------------------------------------|
334. |  1219          0                        0      never |
335. |  1219          2                        0      never |
336. |  1219          4                        0      never |
337. |  1219          6                        0      never |
338. |  1219          8                        0      never |
339. |  1219         10                        0      never |
340. |  1219         14                        0      never |
341. |  1219         16                        0      never |
342. |  1219         18                        0      never |
343. |  1219         20                        0      never |
344. |  1219         22          t012          1     varies |
345. |  1219         24          t012          0     varies |
346. |  1219         26          t012          0     varies |
347. |  1219         28          t012          0     varies |
348. |  1219         30          t012          0     varies |
349. |  1219         32          t012          0     varies |
350. |  1219         34          t012          0     varies |
351. |  1219         36          t012          0     varies |
352. |  1219         38          t012          0     varies |
353. |  1219         40          t012          0     varies |
354. |  1219         42          t012          0     varies |
355. |  1219         44          t012          0     varies |
356. |  1219         46          t012          0     varies |
357. |  1219         48          t012          0     varies |
358. |  1219         58          t012          0     varies |
359. |  1219         64          t012          0     varies |
360. |  1219         66          t012          0     varies |
361. |  1219         68          t012          0     varies |
362. |  1219         70          t012          0     varies |
363. |  1219         72          t012          0     varies |
364. |  1219         74          t012          0     varies |
365. |  1219         76          t021          0     varies |
366. |  1219         78          t021          0     varies |
367. |  1219         82          t012          0     varies |
     |------------------------------------------------------|
368. |  1236          0                        0      never |
369. |  1236          2                        0      never |
370. |  1236          4                        0      never |
371. |  1236          6                        0      never |
372. |  1236          8                        0      never |
373. |  1236         10                        0      never |
374. |  1236         12                        0      never |
375. |  1236         14                        0      never |
376. |  1236         16                        0      never |
377. |  1236         18                        0      never |
378. |  1236         20                        0      never |
379. |  1236         22                        0      never |
380. |  1236         24                        0      never |
381. |  1236         26          t021          1     varies |
382. |  1236         28          t021          0     varies |
383. |  1236         30          t021          0     varies |
384. |  1236         32          t021          0     varies |
385. |  1236         34          t021          0     varies |
386. |  1236         36          t021          0     varies |
387. |  1236         38          t021          0     varies |
388. |  1236         40          t021          0     varies |
389. |  1236         42          t021          0     varies |
390. |  1236         44          t021          0     varies |
391. |  1236         46          t021          0     varies |
392. |  1236         48          t021          0     varies |
393. |  1236         64                        0     varies |
394. |  1236         68                        0     varies |
395. |  1236         70                        0     varies |
396. |  1236         72                        0     varies |
397. |  1236         74                        0     varies |
398. |  1236         76                        0     varies |
399. |  1236         78                        0     varies |
400. |  1236         80                        0     varies |
401. |  1236         82                        0     varies |
     |------------------------------------------------------|
402. |  1244          0                        0      never |
403. |  1244          2                        0      never |
404. |  1244          4                        0      never |
405. |  1244          6                        0      never |
406. |  1244          8                        0      never |
407. |  1244         10                        0      never |
408. |  1244         12                        0      never |
409. |  1244         14                        0      never |
410. |  1244         16                        0      never |
411. |  1244         18                        0      never |
412. |  1244         20                        0      never |
413. |  1244         22                        0      never |
414. |  1244         24                        0      never |
415. |  1244         26                        0      never |
416. |  1244         28                        0      never |
417. |  1244         30                        0      never |
418. |  1244         32                        0      never |
419. |  1244         34                        0      never |
420. |  1244         36                        0      never |
421. |  1244         38                        0      never |
422. |  1244         40                        0      never |
423. |  1244         42                        0      never |
424. |  1244         44         t2271          1     varies |
425. |  1244         46         t2271          0     varies |
426. |  1244         48         t2271          0     varies |
427. |  1244         58         t2271          0     varies |
428. |  1244         62                        0     varies |
429. |  1244         64                        0     varies |
430. |  1244         66                        0     varies |
431. |  1244         68         t2271          1     varies |
432. |  1244         70         t2271          0     varies |
433. |  1244         72         t2271          0     varies |
434. |  1244         76         t2271          0     varies |
435. |  1244         78                        0     varies |
436. |  1244         80                        0     varies |
437. |  1244         82                        0     varies |
     |------------------------------------------------------|
438. |  1261          0     t084/t280          0     always |
439. |  1261          2          t280          0     always |
440. |  1261          4          t280          0     always |
441. |  1261          6          t280          0     always |
442. |  1261          8          t280          0     always |
443. |  1261         10          t280          0     always |
444. |  1261         12          t280          0     always |
445. |  1261         14          t280          0     always |
446. |  1261         16          t280          0     always |
447. |  1261         18          t280          0     always |
448. |  1261         20          t280          0     always |
449. |  1261         22          t280          0     always |
450. |  1261         24          t280          0     always |
451. |  1261         26          t280          0     always |
452. |  1261         30          t280          0     always |
453. |  1261         32          t280          0     always |
454. |  1261         34          t280          0     always |
455. |  1261         36          t280          0     always |
456. |  1261         38          t280          0     always |
457. |  1261         40                        0     always |
458. |  1261         42          t280          0     always |
459. |  1261         46                        0     always |
460. |  1261         48          t280          0     always |
461. |  1261         60          t127          1     always |
462. |  1261         64          t280          0     always |
463. |  1261         66                        0     varies |
464. |  1261         68                        0     varies |
465. |  1261         70                        0     varies |
466. |  1261         72                        0     varies |
467. |  1261         74                        0     varies |
468. |  1261         76                        0     varies |
469. |  1261         78                        0     varies |
470. |  1261         80                        0     varies |
471. |  1261         82                        0     varies |
     |------------------------------------------------------|
472. |  1274          0          t084          0     always |
473. |  1274          2          t084          0     always |
474. |  1274          4          t084          0     always |
475. |  1274          6          t084          0     always |
476. |  1274          8          t084          0     always |
477. |  1274         10          t084          0     always |
478. |  1274         12          t084          0     always |
479. |  1274         14                        0     varies |
480. |  1274         16                        0     varies |
481. |  1274         18                        0     varies |
482. |  1274         20          t084          1     varies |
483. |  1274         22          t084          0     varies |
484. |  1274         24                        0     varies |
485. |  1274         26                        0     varies |
486. |  1274         28                        0     varies |
487. |  1274         30                        0     varies |
488. |  1274         32                        0     varies |
489. |  1274         34          t084          1     varies |
490. |  1274         36          t012          1     varies |
491. |  1274         38                        0     varies |
492. |  1274         40          t084          1     varies |
493. |  1274         42                        0     varies |
494. |  1274         44                        0     varies |
495. |  1274         46                        0     varies |
496. |  1274         48          t084          1     varies |
497. |  1274         56                        0     varies |
498. |  1274         58                        0     varies |
499. |  1274         60                        0     varies |
500. |  1274         62          t084          1     varies |
501. |  1274         64                        0     varies |
502. |  1274         66                        0     varies |
503. |  1274         70                        0     varies |
504. |  1274         72          t084          1     varies |
505. |  1274         74                        0     varies |
506. |  1274         76         t2422          1     varies |
507. |  1274         78                        0     varies |
508. |  1274         80                        0     varies |
509. |  1274         82                        0     varies |
     |------------------------------------------------------|
510. |  1295          0                        0      never |
511. |  1295          2                        0      never |
512. |  1295          4                        0      never |
513. |  1295          8                        0      never |
514. |  1295         10                        0      never |
515. |  1295         12                        0      never |
516. |  1295         14                        0      never |
517. |  1295         16                        0      never |
518. |  1295         18                        0      never |
519. |  1295         22                        0      never |
520. |  1295         24                        0      never |
521. |  1295         26                        0      never |
522. |  1295         30                        0      never |
523. |  1295         32                        0      never |
524. |  1295         34                        0      never |
525. |  1295         36                        0      never |
526. |  1295         38        t12151          1     varies |
527. |  1295         40        t12151          0     varies |
528. |  1295         44        t12151          0     varies |
529. |  1295         46        t12151          0     varies |
530. |  1295         50        t12151          0     varies |
531. |  1295         58                        0     varies |
532. |  1295         64                        0     varies |
533. |  1295         70        t15752          1     varies |
534. |  1295         74                        0     varies |
535. |  1295         76                        0     varies |
536. |  1295         78          t065          1     varies |
537. |  1295         80          t065          0     varies |
538. |  1295         82          txAH          0     varies |
     |------------------------------------------------------|
539. |  1316          0          t645          0     always |
540. |  1316          2          t645          0     always |
541. |  1316          4          t645          0     always |
542. |  1316          6          t645          0     always |
543. |  1316          8          t645          0     always |
544. |  1316         10          t645          0     always |
545. |  1316         12          t645          0     always |
546. |  1316         14          t645          0     always |
547. |  1316         16          t645          0     always |
548. |  1316         18          t645          0     always |
549. |  1316         20          t645          0     always |
550. |  1316         22          t645          0     always |
551. |  1316         24    t645/t1596          1     always |
552. |  1316         26          t645          0     always |
553. |  1316         28          t645          0     always |
554. |  1316         30          t645          0     always |
555. |  1316         32          t645          0     always |
556. |  1316         34          t645          0     always |
557. |  1316         36          t645          0     always |
558. |  1316         38          t645          0     always |
559. |  1316         40          t645          0     always |
560. |  1316         42          t645          0     always |
561. |  1316         44          t645          0     always |
562. |  1316         46          t645          0     always |
563. |  1316         48          t645          0     always |
564. |  1316         56          t645          0     always |
565. |  1316         58          t645          0     always |
566. |  1316         60                        0     varies |
567. |  1316         62                        0     varies |
568. |  1316         64                        0     varies |
569. |  1316         66                        0     varies |
570. |  1316         68                        0     varies |
571. |  1316         70                        0     varies |
572. |  1316         72                        0     varies |
573. |  1316         74                        0     varies |
574. |  1316         76                        0     varies |
575. |  1316         78                        0     varies |
576. |  1316         80                        0     varies |
577. |  1316         82                        0     varies |
     |------------------------------------------------------|
578. |  1332          0                        0      never |
579. |  1332          2                        0      never |
580. |  1332          4                        0      never |
581. |  1332          6                        0      never |
582. |  1332          8                        0      never |
583. |  1332         10                        0      never |
584. |  1332         12                        0      never |
585. |  1332         14                        0      never |
586. |  1332         16                        0      never |
587. |  1332         18                        0      never |
588. |  1332         20                        0      never |
589. |  1332         22                        0      never |
590. |  1332         24                        0      never |
591. |  1332         26                        0      never |
592. |  1332         28                        0      never |
593. |  1332         30                        0      never |
594. |  1332         32                        0      never |
595. |  1332         34                        0      never |
596. |  1332         36                        0      never |
597. |  1332         40                        0      never |
598. |  1332         42                        0      never |
599. |  1332         44                        0      never |
600. |  1332         46                        0      never |
601. |  1332         48          t410          1     varies |
602. |  1332         56                        0     varies |
603. |  1332         60                        0     varies |
604. |  1332         62                        0     varies |
605. |  1332         64                        0     varies |
606. |  1332         66                        0     varies |
607. |  1332         68        t15751          1     varies |
608. |  1332         70                        0     varies |
609. |  1332         72                        0     varies |
610. |  1332         74          t279          1     varies |
611. |  1332         76          t279          0     varies |
612. |  1332         78          t279          0     varies |
613. |  1332         80          t279          0     varies |
614. |  1332         82          txAJ          1     varies |
     |------------------------------------------------------|
615. |  1359          0                        0      never |
616. |  1359          2                        0      never |
617. |  1359          4                        0      never |
618. |  1359          6                        0      never |
619. |  1359          8                        0      never |
620. |  1359         10                        0      never |
621. |  1359         12                        0      never |
622. |  1359         14                        0      never |
623. |  1359         16                        0      never |
624. |  1359         18                        0      never |
625. |  1359         20                        0      never |
626. |  1359         22                        0      never |
627. |  1359         24                        0      never |
628. |  1359         26          t267          1     varies |
629. |  1359         28          t267          0     varies |
630. |  1359         30          t267          0     varies |
631. |  1359         32          t267          0     varies |
632. |  1359         34          t267          0     varies |
633. |  1359         36          t267          0     varies |
634. |  1359         38          t267          0     varies |
635. |  1359         40          t267          0     varies |
636. |  1359         42          t267          0     varies |
637. |  1359         44          t267          0     varies |
638. |  1359         46          t267          0     varies |
639. |  1359         48          t267          0     varies |
640. |  1359         58   t267/t14529          1     varies |
641. |  1359         60        t14529          0     varies |
642. |  1359         62          t267          0     varies |
643. |  1359         66          t267          0     varies |
644. |  1359         68          t267          0     varies |
645. |  1359         70          t267          0     varies |
646. |  1359         72          t267          0     varies |
647. |  1359         74          t267          0     varies |
648. |  1359         76          t267          0     varies |
649. |  1359         78          t267          0     varies |
650. |  1359         80          t267          0     varies |
651. |  1359         82          t267          0     varies |
     |------------------------------------------------------|
652. |  1370          0                        0      never |
653. |  1370          2                        0      never |
654. |  1370          4                        0      never |
655. |  1370          6                        0      never |
656. |  1370          8                        0      never |
657. |  1370         10                        0      never |
658. |  1370         12                        0      never |
659. |  1370         14                        0      never |
660. |  1370         16                        0      never |
661. |  1370         18                        0      never |
662. |  1370         20                        0      never |
663. |  1370         22                        0      never |
664. |  1370         24                        0      never |
665. |  1370         26                        0      never |
666. |  1370         28                        0      never |
667. |  1370         30                        0      never |
668. |  1370         32                        0      never |
669. |  1370         34                        0      never |
670. |  1370         36                        0      never |
671. |  1370         38                        0      never |
672. |  1370         40                        0      never |
673. |  1370         42         t9973          1     varies |
674. |  1370         44                        0     varies |
675. |  1370         46                        0     varies |
676. |  1370         48                        0     varies |
677. |  1370         56                        0     varies |
678. |  1370         62                        0     varies |
679. |  1370         64                        0     varies |
680. |  1370         68                        0     varies |
681. |  1370         70                        0     varies |
682. |  1370         72                        0     varies |
683. |  1370         78                        0     varies |
684. |  1370         80                        0     varies |
     |------------------------------------------------------|
685. |  1372          0                        0      never |
686. |  1372          2                        0      never |
687. |  1372          4                        0      never |
688. |  1372          6                        0      never |
689. |  1372          8                        0      never |
690. |  1372         10                        0      never |
691. |  1372         12                        0      never |
692. |  1372         14                        0      never |
693. |  1372         16                        0      never |
694. |  1372         18                        0      never |
695. |  1372         20                        0      never |
696. |  1372         22                        0      never |
697. |  1372         24                        0      never |
698. |  1372         26          t002          1     varies |
699. |  1372         28                        0     varies |
700. |  1372         30          t002          0     varies |
701. |  1372         32          t002          0     varies |
702. |  1372         34          t002          0     varies |
703. |  1372         36          t002          0     varies |
704. |  1372         38          t002          0     varies |
705. |  1372         40          t002          0     varies |
706. |  1372         42          t002          0     varies |
707. |  1372         44          t002          0     varies |
708. |  1372         46          t002          0     varies |
709. |  1372         48          t002          0     varies |
710. |  1372         58          t002          0     varies |
711. |  1372         60          t002          0     varies |
712. |  1372         62                        0     varies |
713. |  1372         64                        0     varies |
714. |  1372         66                        0     varies |
715. |  1372         68                        0     varies |
716. |  1372         70                        0     varies |
717. |  1372         74                        0     varies |
718. |  1372         76                        0     varies |
719. |  1372         78                        0     varies |
720. |  1372         80                        0     varies |
     |------------------------------------------------------|
721. |  1375          0                        0      never |
722. |  1375          2                        0      never |
723. |  1375          4                        0      never |
724. |  1375          6                        0      never |
725. |  1375          8          t091          1     varies |
726. |  1375         10          t091          0     varies |
727. |  1375         12          t091          0     varies |
728. |  1375         14          t091          0     varies |
729. |  1375         16          t091          0     varies |
730. |  1375         18          t091          0     varies |
731. |  1375         20          t091          0     varies |
732. |  1375         22         t9726          1     varies |
733. |  1375         24         t9726          0     varies |
734. |  1375         26                        0     varies |
735. |  1375         28                        0     varies |
736. |  1375         30                        0     varies |
737. |  1375         32                        0     varies |
738. |  1375         34                        0     varies |
739. |  1375         36                        0     varies |
740. |  1375         40         t1023          1     varies |
741. |  1375         42                        0     varies |
742. |  1375         44                        0     varies |
743. |  1375         46                        0     varies |
744. |  1375         48                        0     varies |
745. |  1375         56                        0     varies |
746. |  1375         58                        0     varies |
747. |  1375         60                        0     varies |
748. |  1375         62                        0     varies |
749. |  1375         64                        0     varies |
750. |  1375         66                        0     varies |
751. |  1375         68                        0     varies |
752. |  1375         70                        0     varies |
753. |  1375         72                        0     varies |
754. |  1375         74                        0     varies |
755. |  1375         76                        0     varies |
756. |  1375         78                        0     varies |
757. |  1375         80                        0     varies |
     |------------------------------------------------------|
758. |  1395          0                        0      never |
759. |  1395          6                        0      never |
760. |  1395          8                        0      never |
761. |  1395         10                        0      never |
762. |  1395         12                        0      never |
763. |  1395         14                        0      never |
764. |  1395         16                        0      never |
765. |  1395         18                        0      never |
766. |  1395         20                        0      never |
767. |  1395         22                        0      never |
768. |  1395         24                        0      never |
769. |  1395         26                        0      never |
770. |  1395         28                        0      never |
771. |  1395         30                        0      never |
772. |  1395         32                        0      never |
773. |  1395         34                        0      never |
774. |  1395         36                        0      never |
775. |  1395         38                        0      never |
776. |  1395         40                        0      never |
777. |  1395         42                        0      never |
778. |  1395         44                        0      never |
779. |  1395         46                        0      never |
780. |  1395         48                        0      never |
781. |  1395         58                        0      never |
782. |  1395         60                        0      never |
783. |  1395         62          t056          1     varies |
784. |  1395         64                        0     varies |
785. |  1395         66                        0     varies |
786. |  1395         68                        0     varies |
787. |  1395         70                        0     varies |
788. |  1395         72                        0     varies |
789. |  1395         74                        0     varies |
790. |  1395         76                        0     varies |
791. |  1395         78                        0     varies |
792. |  1395         80                        0     varies |
     |------------------------------------------------------|
793. |  2055          0                        0      never |
794. |  2055          2                        0      never |
795. |  2055          4                        0      never |
796. |  2055          6                        0      never |
797. |  2055          8                        0      never |
798. |  2055         12                        0      never |
799. |  2055         14                        0      never |
800. |  2055         16                        0      never |
801. |  2055         18                        0      never |
802. |  2055         20                        0      never |
803. |  2055         24                        0      never |
804. |  2055         28                        0      never |
805. |  2055         30                        0      never |
806. |  2055         32                        0      never |
807. |  2055         36                        0      never |
808. |  2055         38                        0      never |
809. |  2055         40                        0      never |
810. |  2055         42                        0      never |
811. |  2055         44        t12838          1     varies |
812. |  2055         46                        0     varies |
813. |  2055         48                        0     varies |
814. |  2055         60                        0     varies |
815. |  2055         64                        0     varies |
816. |  2055         66                        0     varies |
817. |  2055         70                        0     varies |
818. |  2055         72                        0     varies |
819. |  2055         74                        0     varies |
820. |  2055         76                        0     varies |
821. |  2055         78                        0     varies |
822. |  2055         80                        0     varies |
823. |  2055         82                        0     varies |
     +------------------------------------------------------+

. tab patid

Participant |
         ID |      Freq.     Percent        Cum.
------------+-----------------------------------
        302 |         36        4.37        4.37
        374 |         36        4.37        8.75
        407 |         34        4.13       12.88
        412 |         37        4.50       17.38
        418 |         37        4.50       21.87
        993 |         39        4.74       26.61
       1211 |         38        4.62       31.23
       1215 |         39        4.74       35.97
       1218 |         37        4.50       40.46
       1219 |         34        4.13       44.59
       1236 |         34        4.13       48.72
       1244 |         36        4.37       53.10
       1261 |         34        4.13       57.23
       1274 |         38        4.62       61.85
       1295 |         29        3.52       65.37
       1316 |         39        4.74       70.11
       1332 |         37        4.50       74.61
       1359 |         37        4.50       79.10
       1370 |         33        4.01       83.11
       1372 |         36        4.37       87.48
       1375 |         37        4.50       91.98
       1395 |         35        4.25       96.23
       2055 |         31        3.77      100.00
------------+-----------------------------------
      Total |        823      100.00

. drop if inlist(patid, 1218, 1219, 1359)
(108 observations deleted)

. 
. 
. 
. ************************

. 
. keep patid timepoint spatype newspa_prev carriage

. 
. noi list, sepby(patid)

     +-----------------------------------------------------+
     | patid   timepo~t      spatype   newspa~v   carria~e |
     |-----------------------------------------------------|
  1. |   302          0         t620          0     always |
  2. |   302          2         t620          0     always |
  3. |   302          4         t620          0     always |
  4. |   302          6         t620          0     always |
  5. |   302          8         t620          0     always |
  6. |   302         10         t620          0     always |
  7. |   302         12         t620          0     always |
  8. |   302         14         t620          0     always |
  9. |   302         16         t620          0     always |
 10. |   302         18         t620          0     always |
 11. |   302         20         t620          0     always |
 12. |   302         22         t620          0     always |
 13. |   302         24         t620          0     always |
 14. |   302         26         t620          0     always |
 15. |   302         28         t620          0     always |
 16. |   302         30         t620          0     always |
 17. |   302         32                       0     varies |
 18. |   302         34                       0     varies |
 19. |   302         36         t620          1     varies |
 20. |   302         38                       0     varies |
 21. |   302         40         t620          0     varies |
 22. |   302         42         t620          0     varies |
 23. |   302         44         t620          0     varies |
 24. |   302         46         t620          0     varies |
 25. |   302         48         t620          0     varies |
 26. |   302         68         t620          0     varies |
 27. |   302         70        t1414          1     varies |
 28. |   302         72         t620          0     varies |
 29. |   302         74         t620          0     varies |
 30. |   302         78         t620          0     varies |
 31. |   302         80                       0     varies |
 32. |   302         82                       0     varies |
 33. |   302         84                       0     varies |
 34. |   302         86                       0     varies |
 35. |   302         88                       0     varies |
 36. |   302         90                       0     varies |
     |-----------------------------------------------------|
 37. |   374          0         t037          0     always |
 38. |   374          2         t037          0     always |
 39. |   374          4         t037          0     always |
 40. |   374          6         t037          0     always |
 41. |   374          8         t037          0     always |
 42. |   374         10         t037          0     always |
 43. |   374         12         t037          0     always |
 44. |   374         14         t037          0     always |
 45. |   374         16         t037          0     always |
 46. |   374         18         t037          0     always |
 47. |   374         20         t037          0     always |
 48. |   374         22         t037          0     always |
 49. |   374         24         t037          0     always |
 50. |   374         26         t037          0     always |
 51. |   374         28         t037          0     always |
 52. |   374         30         t037          0     always |
 53. |   374         32         t037          0     always |
 54. |   374         34         t037          0     always |
 55. |   374         36         t037          0     always |
 56. |   374         38         t037          0     always |
 57. |   374         40         t037          0     always |
 58. |   374         42         t037          0     always |
 59. |   374         44         t037          0     always |
 60. |   374         46         t037          0     always |
 61. |   374         48         t037          0     always |
 62. |   374         64         t037          0     always |
 63. |   374         70         t037          0     always |
 64. |   374         72         t037          0     always |
 65. |   374         74         t037          0     always |
 66. |   374         76         t037          0     always |
 67. |   374         78   t037/t2029          1     always |
 68. |   374         80         t037          0     always |
 69. |   374         82                       0     varies |
 70. |   374         84                       0     varies |
 71. |   374         86        t1402          1     varies |
 72. |   374         88        t8600          1     varies |
     |-----------------------------------------------------|
 73. |   407          0         t227          0     always |
 74. |   407          2                       0     varies |
 75. |   407          4                       0     varies |
 76. |   407          6                       0     varies |
 77. |   407          8                       0     varies |
 78. |   407         10                       0     varies |
 79. |   407         12                       0     varies |
 80. |   407         14                       0     varies |
 81. |   407         16                       0     varies |
 82. |   407         18                       0     varies |
 83. |   407         20                       0     varies |
 84. |   407         22                       0     varies |
 85. |   407         24                       0     varies |
 86. |   407         26                       0     varies |
 87. |   407         28                       0     varies |
 88. |   407         30                       0     varies |
 89. |   407         32                       0     varies |
 90. |   407         34                       0     varies |
 91. |   407         38                       0     varies |
 92. |   407         40         t026          1     varies |
 93. |   407         42         t026          0     varies |
 94. |   407         44                       0     varies |
 95. |   407         46                       0     varies |
 96. |   407         48         t026          1     varies |
 97. |   407         66                       0     varies |
 98. |   407         70                       0     varies |
 99. |   407         72                       0     varies |
100. |   407         74                       0     varies |
101. |   407         76                       0     varies |
102. |   407         78                       0     varies |
103. |   407         80                       0     varies |
104. |   407         84                       0     varies |
105. |   407         86                       0     varies |
106. |   407         88                       0     varies |
     |-----------------------------------------------------|
107. |   412          0         t209          0     always |
108. |   412          2         t209          0     always |
109. |   412          4         t209          0     always |
110. |   412          6         t209          0     always |
111. |   412         10         t209          0     always |
112. |   412         12         t209          0     always |
113. |   412         14         t209          0     always |
114. |   412         16         t209          0     always |
115. |   412         18                       0     varies |
116. |   412         20                       0     varies |
117. |   412         22                       0     varies |
118. |   412         24                       0     varies |
119. |   412         26                       0     varies |
120. |   412         28                       0     varies |
121. |   412         30                       0     varies |
122. |   412         32         t061          1     varies |
123. |   412         34         t061          0     varies |
124. |   412         36         t061          0     varies |
125. |   412         38         t061          0     varies |
126. |   412         40         t061          0     varies |
127. |   412         42                       0     varies |
128. |   412         44                       0     varies |
129. |   412         46         t061          1     varies |
130. |   412         48                       0     varies |
131. |   412         62         t061          0     varies |
132. |   412         64         t061          0     varies |
133. |   412         66         t061          0     varies |
134. |   412         68         t061          0     varies |
135. |   412         70         t061          0     varies |
136. |   412         72         t061          0     varies |
137. |   412         74         t061          0     varies |
138. |   412         76         t061          0     varies |
139. |   412         78         t061          0     varies |
140. |   412         80         t061          0     varies |
141. |   412         82         t061          0     varies |
142. |   412         84         t061          0     varies |
143. |   412         86                       0     varies |
     |-----------------------------------------------------|
144. |   418          0         t127          0     always |
145. |   418          2         t948          0     always |
146. |   418          4         t127          0     always |
147. |   418          6         t127          0     always |
148. |   418          8         t127          0     always |
149. |   418         10         t127          0     always |
150. |   418         12         t127          0     always |
151. |   418         14         t127          0     always |
152. |   418         16         t127          0     always |
153. |   418         18                       0     always |
154. |   418         22         t127          0     always |
155. |   418         24         t127          0     always |
156. |   418         26         t127          0     always |
157. |   418         28         t127          0     always |
158. |   418         30         t127          0     always |
159. |   418         32                       0     varies |
160. |   418         34                       0     varies |
161. |   418         36                       0     varies |
162. |   418         38         t127          1     varies |
163. |   418         40         t127          0     varies |
164. |   418         42         t127          0     varies |
165. |   418         44         t267          1     varies |
166. |   418         46         t267          0     varies |
167. |   418         48         t267          0     varies |
168. |   418         64         t121          1     varies |
169. |   418         66         t121          0     varies |
170. |   418         68                       0     varies |
171. |   418         70                       0     varies |
172. |   418         72                       0     varies |
173. |   418         74                       0     varies |
174. |   418         76                       0     varies |
175. |   418         78         t002          1     varies |
176. |   418         80        t1094          1     varies |
177. |   418         82        t1094          0     varies |
178. |   418         84        t1094          0     varies |
179. |   418         86        t1094          0     varies |
180. |   418         88         t002          1     varies |
     |-----------------------------------------------------|
181. |   993          0         t012          0     always |
182. |   993          2         t012          0     always |
183. |   993          4         t012          0     always |
184. |   993          6         t012          0     always |
185. |   993          8         t748          1     always |
186. |   993         10         t012          0     always |
187. |   993         12    t021/t012          0     always |
188. |   993         14                       0     varies |
189. |   993         16                       0     varies |
190. |   993         18                       0     varies |
191. |   993         20                       0     varies |
192. |   993         22                       0     varies |
193. |   993         24                       0     varies |
194. |   993         26                       0     varies |
195. |   993         28                       0     varies |
196. |   993         30                       0     varies |
197. |   993         32       t10514          1     varies |
198. |   993         34       t10514          0     varies |
199. |   993         36       t10514          0     varies |
200. |   993         38       t10514          0     varies |
201. |   993         40       t10514          0     varies |
202. |   993         42       t10514          0     varies |
203. |   993         44                       0     varies |
204. |   993         46        t8062          1     varies |
205. |   993         48        t8062          0     varies |
206. |   993         58        t8062          0     varies |
207. |   993         60         t021          1     varies |
208. |   993         62         t021          0     varies |
209. |   993         64         t364          1     varies |
210. |   993         66         t364          0     varies |
211. |   993         68       t11252          1     varies |
212. |   993         70       t11252          0     varies |
213. |   993         72       t11252          0     varies |
214. |   993         74                       0     varies |
215. |   993         76         t393          1     varies |
216. |   993         78         t393          0     varies |
217. |   993         80                       0     varies |
218. |   993         82                       0     varies |
219. |   993         84         t008          1     varies |
     |-----------------------------------------------------|
220. |  1211          0                       0      never |
221. |  1211          2                       0      never |
222. |  1211          4                       0      never |
223. |  1211          6                       0      never |
224. |  1211          8                       0      never |
225. |  1211         10                       0      never |
226. |  1211         12                       0      never |
227. |  1211         14                       0      never |
228. |  1211         16                       0      never |
229. |  1211         18                       0      never |
230. |  1211         20                       0      never |
231. |  1211         22                       0      never |
232. |  1211         24                       0      never |
233. |  1211         26                       0      never |
234. |  1211         28                       0      never |
235. |  1211         30                       0      never |
236. |  1211         32                       0      never |
237. |  1211         34                       0      never |
238. |  1211         36                       0      never |
239. |  1211         38                       0      never |
240. |  1211         40                       0      never |
241. |  1211         42                       0      never |
242. |  1211         44                       0      never |
243. |  1211         46                       0      never |
244. |  1211         48                       0      never |
245. |  1211         58         t056          1     varies |
246. |  1211         60                       0     varies |
247. |  1211         62                       0     varies |
248. |  1211         64                       0     varies |
249. |  1211         68                       0     varies |
250. |  1211         70                       0     varies |
251. |  1211         72                       0     varies |
252. |  1211         74                       0     varies |
253. |  1211         76                       0     varies |
254. |  1211         78                       0     varies |
255. |  1211         80                       0     varies |
256. |  1211         82                       0     varies |
257. |  1211         84                       0     varies |
     |-----------------------------------------------------|
258. |  1215          0         t630          0     always |
259. |  1215          2         t630          0     always |
260. |  1215          4         t630          0     always |
261. |  1215          6         t630          0     always |
262. |  1215          8                       0     always |
263. |  1215         10         t630          0     always |
264. |  1215         12         t630          0     always |
265. |  1215         14         t630          0     always |
266. |  1215         16         t630          0     always |
267. |  1215         18         t630          0     always |
268. |  1215         20         t630          0     always |
269. |  1215         22         t630          0     always |
270. |  1215         24                       0     always |
271. |  1215         26         t630          0     always |
272. |  1215         28         t630          0     always |
273. |  1215         30         t630          0     always |
274. |  1215         32         t630          0     always |
275. |  1215         34         t630          0     always |
276. |  1215         36         t630          0     always |
277. |  1215         38         t630          0     always |
278. |  1215         40         t630          0     always |
279. |  1215         42         t630          0     always |
280. |  1215         44         t630          0     always |
281. |  1215         46         t630          0     always |
282. |  1215         48         t630          0     always |
283. |  1215         56                       0     varies |
284. |  1215         58                       0     varies |
285. |  1215         60                       0     varies |
286. |  1215         62                       0     varies |
287. |  1215         64                       0     varies |
288. |  1215         68                       0     varies |
289. |  1215         70                       0     varies |
290. |  1215         72                       0     varies |
291. |  1215         74                       0     varies |
292. |  1215         76                       0     varies |
293. |  1215         78                       0     varies |
294. |  1215         80                       0     varies |
295. |  1215         82                       0     varies |
296. |  1215         84                       0     varies |
     |-----------------------------------------------------|
297. |  1236          0                       0      never |
298. |  1236          2                       0      never |
299. |  1236          4                       0      never |
300. |  1236          6                       0      never |
301. |  1236          8                       0      never |
302. |  1236         10                       0      never |
303. |  1236         12                       0      never |
304. |  1236         14                       0      never |
305. |  1236         16                       0      never |
306. |  1236         18                       0      never |
307. |  1236         20                       0      never |
308. |  1236         22                       0      never |
309. |  1236         24                       0      never |
310. |  1236         26         t021          1     varies |
311. |  1236         28         t021          0     varies |
312. |  1236         30         t021          0     varies |
313. |  1236         32         t021          0     varies |
314. |  1236         34         t021          0     varies |
315. |  1236         36         t021          0     varies |
316. |  1236         38         t021          0     varies |
317. |  1236         40         t021          0     varies |
318. |  1236         42         t021          0     varies |
319. |  1236         44         t021          0     varies |
320. |  1236         46         t021          0     varies |
321. |  1236         48         t021          0     varies |
322. |  1236         64                       0     varies |
323. |  1236         68                       0     varies |
324. |  1236         70                       0     varies |
325. |  1236         72                       0     varies |
326. |  1236         74                       0     varies |
327. |  1236         76                       0     varies |
328. |  1236         78                       0     varies |
329. |  1236         80                       0     varies |
330. |  1236         82                       0     varies |
     |-----------------------------------------------------|
331. |  1244          0                       0      never |
332. |  1244          2                       0      never |
333. |  1244          4                       0      never |
334. |  1244          6                       0      never |
335. |  1244          8                       0      never |
336. |  1244         10                       0      never |
337. |  1244         12                       0      never |
338. |  1244         14                       0      never |
339. |  1244         16                       0      never |
340. |  1244         18                       0      never |
341. |  1244         20                       0      never |
342. |  1244         22                       0      never |
343. |  1244         24                       0      never |
344. |  1244         26                       0      never |
345. |  1244         28                       0      never |
346. |  1244         30                       0      never |
347. |  1244         32                       0      never |
348. |  1244         34                       0      never |
349. |  1244         36                       0      never |
350. |  1244         38                       0      never |
351. |  1244         40                       0      never |
352. |  1244         42                       0      never |
353. |  1244         44        t2271          1     varies |
354. |  1244         46        t2271          0     varies |
355. |  1244         48        t2271          0     varies |
356. |  1244         58        t2271          0     varies |
357. |  1244         62                       0     varies |
358. |  1244         64                       0     varies |
359. |  1244         66                       0     varies |
360. |  1244         68        t2271          1     varies |
361. |  1244         70        t2271          0     varies |
362. |  1244         72        t2271          0     varies |
363. |  1244         76        t2271          0     varies |
364. |  1244         78                       0     varies |
365. |  1244         80                       0     varies |
366. |  1244         82                       0     varies |
     |-----------------------------------------------------|
367. |  1261          0    t084/t280          0     always |
368. |  1261          2         t280          0     always |
369. |  1261          4         t280          0     always |
370. |  1261          6         t280          0     always |
371. |  1261          8         t280          0     always |
372. |  1261         10         t280          0     always |
373. |  1261         12         t280          0     always |
374. |  1261         14         t280          0     always |
375. |  1261         16         t280          0     always |
376. |  1261         18         t280          0     always |
377. |  1261         20         t280          0     always |
378. |  1261         22         t280          0     always |
379. |  1261         24         t280          0     always |
380. |  1261         26         t280          0     always |
381. |  1261         30         t280          0     always |
382. |  1261         32         t280          0     always |
383. |  1261         34         t280          0     always |
384. |  1261         36         t280          0     always |
385. |  1261         38         t280          0     always |
386. |  1261         40                       0     always |
387. |  1261         42         t280          0     always |
388. |  1261         46                       0     always |
389. |  1261         48         t280          0     always |
390. |  1261         60         t127          1     always |
391. |  1261         64         t280          0     always |
392. |  1261         66                       0     varies |
393. |  1261         68                       0     varies |
394. |  1261         70                       0     varies |
395. |  1261         72                       0     varies |
396. |  1261         74                       0     varies |
397. |  1261         76                       0     varies |
398. |  1261         78                       0     varies |
399. |  1261         80                       0     varies |
400. |  1261         82                       0     varies |
     |-----------------------------------------------------|
401. |  1274          0         t084          0     always |
402. |  1274          2         t084          0     always |
403. |  1274          4         t084          0     always |
404. |  1274          6         t084          0     always |
405. |  1274          8         t084          0     always |
406. |  1274         10         t084          0     always |
407. |  1274         12         t084          0     always |
408. |  1274         14                       0     varies |
409. |  1274         16                       0     varies |
410. |  1274         18                       0     varies |
411. |  1274         20         t084          1     varies |
412. |  1274         22         t084          0     varies |
413. |  1274         24                       0     varies |
414. |  1274         26                       0     varies |
415. |  1274         28                       0     varies |
416. |  1274         30                       0     varies |
417. |  1274         32                       0     varies |
418. |  1274         34         t084          1     varies |
419. |  1274         36         t012          1     varies |
420. |  1274         38                       0     varies |
421. |  1274         40         t084          1     varies |
422. |  1274         42                       0     varies |
423. |  1274         44                       0     varies |
424. |  1274         46                       0     varies |
425. |  1274         48         t084          1     varies |
426. |  1274         56                       0     varies |
427. |  1274         58                       0     varies |
428. |  1274         60                       0     varies |
429. |  1274         62         t084          1     varies |
430. |  1274         64                       0     varies |
431. |  1274         66                       0     varies |
432. |  1274         70                       0     varies |
433. |  1274         72         t084          1     varies |
434. |  1274         74                       0     varies |
435. |  1274         76        t2422          1     varies |
436. |  1274         78                       0     varies |
437. |  1274         80                       0     varies |
438. |  1274         82                       0     varies |
     |-----------------------------------------------------|
439. |  1295          0                       0      never |
440. |  1295          2                       0      never |
441. |  1295          4                       0      never |
442. |  1295          8                       0      never |
443. |  1295         10                       0      never |
444. |  1295         12                       0      never |
445. |  1295         14                       0      never |
446. |  1295         16                       0      never |
447. |  1295         18                       0      never |
448. |  1295         22                       0      never |
449. |  1295         24                       0      never |
450. |  1295         26                       0      never |
451. |  1295         30                       0      never |
452. |  1295         32                       0      never |
453. |  1295         34                       0      never |
454. |  1295         36                       0      never |
455. |  1295         38       t12151          1     varies |
456. |  1295         40       t12151          0     varies |
457. |  1295         44       t12151          0     varies |
458. |  1295         46       t12151          0     varies |
459. |  1295         50       t12151          0     varies |
460. |  1295         58                       0     varies |
461. |  1295         64                       0     varies |
462. |  1295         70       t15752          1     varies |
463. |  1295         74                       0     varies |
464. |  1295         76                       0     varies |
465. |  1295         78         t065          1     varies |
466. |  1295         80         t065          0     varies |
467. |  1295         82         txAH          0     varies |
     |-----------------------------------------------------|
468. |  1316          0         t645          0     always |
469. |  1316          2         t645          0     always |
470. |  1316          4         t645          0     always |
471. |  1316          6         t645          0     always |
472. |  1316          8         t645          0     always |
473. |  1316         10         t645          0     always |
474. |  1316         12         t645          0     always |
475. |  1316         14         t645          0     always |
476. |  1316         16         t645          0     always |
477. |  1316         18         t645          0     always |
478. |  1316         20         t645          0     always |
479. |  1316         22         t645          0     always |
480. |  1316         24   t645/t1596          1     always |
481. |  1316         26         t645          0     always |
482. |  1316         28         t645          0     always |
483. |  1316         30         t645          0     always |
484. |  1316         32         t645          0     always |
485. |  1316         34         t645          0     always |
486. |  1316         36         t645          0     always |
487. |  1316         38         t645          0     always |
488. |  1316         40         t645          0     always |
489. |  1316         42         t645          0     always |
490. |  1316         44         t645          0     always |
491. |  1316         46         t645          0     always |
492. |  1316         48         t645          0     always |
493. |  1316         56         t645          0     always |
494. |  1316         58         t645          0     always |
495. |  1316         60                       0     varies |
496. |  1316         62                       0     varies |
497. |  1316         64                       0     varies |
498. |  1316         66                       0     varies |
499. |  1316         68                       0     varies |
500. |  1316         70                       0     varies |
501. |  1316         72                       0     varies |
502. |  1316         74                       0     varies |
503. |  1316         76                       0     varies |
504. |  1316         78                       0     varies |
505. |  1316         80                       0     varies |
506. |  1316         82                       0     varies |
     |-----------------------------------------------------|
507. |  1332          0                       0      never |
508. |  1332          2                       0      never |
509. |  1332          4                       0      never |
510. |  1332          6                       0      never |
511. |  1332          8                       0      never |
512. |  1332         10                       0      never |
513. |  1332         12                       0      never |
514. |  1332         14                       0      never |
515. |  1332         16                       0      never |
516. |  1332         18                       0      never |
517. |  1332         20                       0      never |
518. |  1332         22                       0      never |
519. |  1332         24                       0      never |
520. |  1332         26                       0      never |
521. |  1332         28                       0      never |
522. |  1332         30                       0      never |
523. |  1332         32                       0      never |
524. |  1332         34                       0      never |
525. |  1332         36                       0      never |
526. |  1332         40                       0      never |
527. |  1332         42                       0      never |
528. |  1332         44                       0      never |
529. |  1332         46                       0      never |
530. |  1332         48         t410          1     varies |
531. |  1332         56                       0     varies |
532. |  1332         60                       0     varies |
533. |  1332         62                       0     varies |
534. |  1332         64                       0     varies |
535. |  1332         66                       0     varies |
536. |  1332         68       t15751          1     varies |
537. |  1332         70                       0     varies |
538. |  1332         72                       0     varies |
539. |  1332         74         t279          1     varies |
540. |  1332         76         t279          0     varies |
541. |  1332         78         t279          0     varies |
542. |  1332         80         t279          0     varies |
543. |  1332         82         txAJ          1     varies |
     |-----------------------------------------------------|
544. |  1370          0                       0      never |
545. |  1370          2                       0      never |
546. |  1370          4                       0      never |
547. |  1370          6                       0      never |
548. |  1370          8                       0      never |
549. |  1370         10                       0      never |
550. |  1370         12                       0      never |
551. |  1370         14                       0      never |
552. |  1370         16                       0      never |
553. |  1370         18                       0      never |
554. |  1370         20                       0      never |
555. |  1370         22                       0      never |
556. |  1370         24                       0      never |
557. |  1370         26                       0      never |
558. |  1370         28                       0      never |
559. |  1370         30                       0      never |
560. |  1370         32                       0      never |
561. |  1370         34                       0      never |
562. |  1370         36                       0      never |
563. |  1370         38                       0      never |
564. |  1370         40                       0      never |
565. |  1370         42        t9973          1     varies |
566. |  1370         44                       0     varies |
567. |  1370         46                       0     varies |
568. |  1370         48                       0     varies |
569. |  1370         56                       0     varies |
570. |  1370         62                       0     varies |
571. |  1370         64                       0     varies |
572. |  1370         68                       0     varies |
573. |  1370         70                       0     varies |
574. |  1370         72                       0     varies |
575. |  1370         78                       0     varies |
576. |  1370         80                       0     varies |
     |-----------------------------------------------------|
577. |  1372          0                       0      never |
578. |  1372          2                       0      never |
579. |  1372          4                       0      never |
580. |  1372          6                       0      never |
581. |  1372          8                       0      never |
582. |  1372         10                       0      never |
583. |  1372         12                       0      never |
584. |  1372         14                       0      never |
585. |  1372         16                       0      never |
586. |  1372         18                       0      never |
587. |  1372         20                       0      never |
588. |  1372         22                       0      never |
589. |  1372         24                       0      never |
590. |  1372         26         t002          1     varies |
591. |  1372         28                       0     varies |
592. |  1372         30         t002          0     varies |
593. |  1372         32         t002          0     varies |
594. |  1372         34         t002          0     varies |
595. |  1372         36         t002          0     varies |
596. |  1372         38         t002          0     varies |
597. |  1372         40         t002          0     varies |
598. |  1372         42         t002          0     varies |
599. |  1372         44         t002          0     varies |
600. |  1372         46         t002          0     varies |
601. |  1372         48         t002          0     varies |
602. |  1372         58         t002          0     varies |
603. |  1372         60         t002          0     varies |
604. |  1372         62                       0     varies |
605. |  1372         64                       0     varies |
606. |  1372         66                       0     varies |
607. |  1372         68                       0     varies |
608. |  1372         70                       0     varies |
609. |  1372         74                       0     varies |
610. |  1372         76                       0     varies |
611. |  1372         78                       0     varies |
612. |  1372         80                       0     varies |
     |-----------------------------------------------------|
613. |  1375          0                       0      never |
614. |  1375          2                       0      never |
615. |  1375          4                       0      never |
616. |  1375          6                       0      never |
617. |  1375          8         t091          1     varies |
618. |  1375         10         t091          0     varies |
619. |  1375         12         t091          0     varies |
620. |  1375         14         t091          0     varies |
621. |  1375         16         t091          0     varies |
622. |  1375         18         t091          0     varies |
623. |  1375         20         t091          0     varies |
624. |  1375         22        t9726          1     varies |
625. |  1375         24        t9726          0     varies |
626. |  1375         26                       0     varies |
627. |  1375         28                       0     varies |
628. |  1375         30                       0     varies |
629. |  1375         32                       0     varies |
630. |  1375         34                       0     varies |
631. |  1375         36                       0     varies |
632. |  1375         40        t1023          1     varies |
633. |  1375         42                       0     varies |
634. |  1375         44                       0     varies |
635. |  1375         46                       0     varies |
636. |  1375         48                       0     varies |
637. |  1375         56                       0     varies |
638. |  1375         58                       0     varies |
639. |  1375         60                       0     varies |
640. |  1375         62                       0     varies |
641. |  1375         64                       0     varies |
642. |  1375         66                       0     varies |
643. |  1375         68                       0     varies |
644. |  1375         70                       0     varies |
645. |  1375         72                       0     varies |
646. |  1375         74                       0     varies |
647. |  1375         76                       0     varies |
648. |  1375         78                       0     varies |
649. |  1375         80                       0     varies |
     |-----------------------------------------------------|
650. |  1395          0                       0      never |
651. |  1395          6                       0      never |
652. |  1395          8                       0      never |
653. |  1395         10                       0      never |
654. |  1395         12                       0      never |
655. |  1395         14                       0      never |
656. |  1395         16                       0      never |
657. |  1395         18                       0      never |
658. |  1395         20                       0      never |
659. |  1395         22                       0      never |
660. |  1395         24                       0      never |
661. |  1395         26                       0      never |
662. |  1395         28                       0      never |
663. |  1395         30                       0      never |
664. |  1395         32                       0      never |
665. |  1395         34                       0      never |
666. |  1395         36                       0      never |
667. |  1395         38                       0      never |
668. |  1395         40                       0      never |
669. |  1395         42                       0      never |
670. |  1395         44                       0      never |
671. |  1395         46                       0      never |
672. |  1395         48                       0      never |
673. |  1395         58                       0      never |
674. |  1395         60                       0      never |
675. |  1395         62         t056          1     varies |
676. |  1395         64                       0     varies |
677. |  1395         66                       0     varies |
678. |  1395         68                       0     varies |
679. |  1395         70                       0     varies |
680. |  1395         72                       0     varies |
681. |  1395         74                       0     varies |
682. |  1395         76                       0     varies |
683. |  1395         78                       0     varies |
684. |  1395         80                       0     varies |
     |-----------------------------------------------------|
685. |  2055          0                       0      never |
686. |  2055          2                       0      never |
687. |  2055          4                       0      never |
688. |  2055          6                       0      never |
689. |  2055          8                       0      never |
690. |  2055         12                       0      never |
691. |  2055         14                       0      never |
692. |  2055         16                       0      never |
693. |  2055         18                       0      never |
694. |  2055         20                       0      never |
695. |  2055         24                       0      never |
696. |  2055         28                       0      never |
697. |  2055         30                       0      never |
698. |  2055         32                       0      never |
699. |  2055         36                       0      never |
700. |  2055         38                       0      never |
701. |  2055         40                       0      never |
702. |  2055         42                       0      never |
703. |  2055         44       t12838          1     varies |
704. |  2055         46                       0     varies |
705. |  2055         48                       0     varies |
706. |  2055         60                       0     varies |
707. |  2055         64                       0     varies |
708. |  2055         66                       0     varies |
709. |  2055         70                       0     varies |
710. |  2055         72                       0     varies |
711. |  2055         74                       0     varies |
712. |  2055         76                       0     varies |
713. |  2055         78                       0     varies |
714. |  2055         80                       0     varies |
715. |  2055         82                       0     varies |
     +-----------------------------------------------------+

. 
. noi save "E:\users\amy.mason\staph_carriage\Datasets\people_to_stop.dta", replace
(note: file E:\users\amy.mason\staph_carriage\Datasets\people_to_stop.dta not found)
file E:\users\amy.mason\staph_carriage\Datasets\people_to_stop.dta saved

. export excel using "E:\users\amy.mason\staph_carriage\Outpits\People to drop.xls"
file E:\users\amy.mason\staph_carriage\Outpits\People to drop.xls saved

. 
. use  "E:\users\amy.mason\staph_carriage\Datasets\clean_data4.dta", clear

. 
. use  "E:\users\amy.mason\staph_carriage\Datasets\clean_data4.dta", clear 

. 
. keep patid timepoint spatype Result pos confirmedneg pos_so_far neg_so_far carriage_to newspa*

. 
. **** drop those not still returning swabs 

. 
. bysort patid: gen last = timepoint[_N]

. 
. drop if last <74
(7,118 observations deleted)

. 
. ********* drop those without varied carriage

. 
. gen green = 1 if carriage=="varies"
(1,429 missing values generated)

. 
. bysort patid: egen greenmax = max(green)
(1051 missing values generated)

. 
. drop if greenmax==.
(1,051 observations deleted)

. 
. 
. 
. ****************

. 
. * eyeballing: 1218, 1219, 1359 still carrying spatypes from first two years

. 
. 
. 
. drop if inlist(patid, 1218, 1219, 1359)
(108 observations deleted)

. 
. 
. 
. ************************

. 
. keep patid timepoint spatype Result newspa_prev carriage

. 
. noi list, sepby(patid)

     +-----------------------------------------------------------------+
     | patid   timepo~t      Result      spatype   newspa~v   carria~e |
     |-----------------------------------------------------------------|
  1. |   302          0        MSSA         t620          0     always |
  2. |   302          2        MSSA         t620          0     always |
  3. |   302          4        MSSA         t620          0     always |
  4. |   302          6        MSSA         t620          0     always |
  5. |   302          8        MSSA         t620          0     always |
  6. |   302         10        MSSA         t620          0     always |
  7. |   302         12        MSSA         t620          0     always |
  8. |   302         14        MSSA         t620          0     always |
  9. |   302         16        MSSA         t620          0     always |
 10. |   302         18        MSSA         t620          0     always |
 11. |   302         20        MSSA         t620          0     always |
 12. |   302         22        MSSA         t620          0     always |
 13. |   302         24        MSSA         t620          0     always |
 14. |   302         26        MSSA         t620          0     always |
 15. |   302         28        MSSA         t620          0     always |
 16. |   302         30        MSSA         t620          0     always |
 17. |   302         32   No growth                       0     varies |
 18. |   302         34   No growth                       0     varies |
 19. |   302         36        MSSA         t620          1     varies |
 20. |   302         38   No growth                       0     varies |
 21. |   302         40        MSSA         t620          0     varies |
 22. |   302         42        MSSA         t620          0     varies |
 23. |   302         44        MSSA         t620          0     varies |
 24. |   302         46        MSSA         t620          0     varies |
 25. |   302         48        MSSA         t620          0     varies |
 26. |   302         68        MSSA         t620          0     varies |
 27. |   302         70        MSSA        t1414          1     varies |
 28. |   302         72        MSSA         t620          0     varies |
 29. |   302         74        MSSA         t620          0     varies |
 30. |   302         78        MSSA         t620          0     varies |
 31. |   302         80   No growth                       0     varies |
 32. |   302         82   No growth                       0     varies |
 33. |   302         84   No growth                       0     varies |
 34. |   302         86   No growth                       0     varies |
 35. |   302         88   No growth                       0     varies |
 36. |   302         90   No growth                       0     varies |
     |-----------------------------------------------------------------|
 37. |   374          0        MSSA         t037          0     always |
 38. |   374          2        MSSA         t037          0     always |
 39. |   374          4        MSSA         t037          0     always |
 40. |   374          6        MSSA         t037          0     always |
 41. |   374          8        MSSA         t037          0     always |
 42. |   374         10        MSSA         t037          0     always |
 43. |   374         12        MSSA         t037          0     always |
 44. |   374         14        MSSA         t037          0     always |
 45. |   374         16        MSSA         t037          0     always |
 46. |   374         18        MSSA         t037          0     always |
 47. |   374         20        MSSA         t037          0     always |
 48. |   374         22        MSSA         t037          0     always |
 49. |   374         24        MSSA         t037          0     always |
 50. |   374         26        MSSA         t037          0     always |
 51. |   374         28        MSSA         t037          0     always |
 52. |   374         30        MSSA         t037          0     always |
 53. |   374         32        MSSA         t037          0     always |
 54. |   374         34        MSSA         t037          0     always |
 55. |   374         36        MSSA         t037          0     always |
 56. |   374         38        MSSA         t037          0     always |
 57. |   374         40        MSSA         t037          0     always |
 58. |   374         42        MSSA         t037          0     always |
 59. |   374         44        MSSA         t037          0     always |
 60. |   374         46        MSSA         t037          0     always |
 61. |   374         48        MSSA         t037          0     always |
 62. |   374         64        MSSA         t037          0     always |
 63. |   374         70        MSSA         t037          0     always |
 64. |   374         72        MSSA         t037          0     always |
 65. |   374         74        MSSA         t037          0     always |
 66. |   374         76        MSSA         t037          0     always |
 67. |   374         78        MSSA   t037/t2029          1     always |
 68. |   374         80        MSSA         t037          0     always |
 69. |   374         82   No growth                       0     varies |
 70. |   374         84   No growth                       0     varies |
 71. |   374         86        MSSA        t1402          1     varies |
 72. |   374         88        MSSA        t8600          1     varies |
     |-----------------------------------------------------------------|
 73. |   407          0        MSSA         t227          0     always |
 74. |   407          2   No growth                       0     varies |
 75. |   407          4   No growth                       0     varies |
 76. |   407          6   No growth                       0     varies |
 77. |   407          8   No growth                       0     varies |
 78. |   407         10   No growth                       0     varies |
 79. |   407         12   No growth                       0     varies |
 80. |   407         14   No growth                       0     varies |
 81. |   407         16   No growth                       0     varies |
 82. |   407         18   No growth                       0     varies |
 83. |   407         20   No growth                       0     varies |
 84. |   407         22   No growth                       0     varies |
 85. |   407         24   No growth                       0     varies |
 86. |   407         26   No growth                       0     varies |
 87. |   407         28   No growth                       0     varies |
 88. |   407         30   No growth                       0     varies |
 89. |   407         32   No growth                       0     varies |
 90. |   407         34   No growth                       0     varies |
 91. |   407         38   No growth                       0     varies |
 92. |   407         40        MSSA         t026          1     varies |
 93. |   407         42        MSSA         t026          0     varies |
 94. |   407         44   No growth                       0     varies |
 95. |   407         46   No growth                       0     varies |
 96. |   407         48        MSSA         t026          1     varies |
 97. |   407         66   No growth                       0     varies |
 98. |   407         70   No growth                       0     varies |
 99. |   407         72   No growth                       0     varies |
100. |   407         74   No growth                       0     varies |
101. |   407         76   No growth                       0     varies |
102. |   407         78   No growth                       0     varies |
103. |   407         80   No growth                       0     varies |
104. |   407         84   No growth                       0     varies |
105. |   407         86   No growth                       0     varies |
106. |   407         88   No growth                       0     varies |
     |-----------------------------------------------------------------|
107. |   412          0        MSSA         t209          0     always |
108. |   412          2        MSSA         t209          0     always |
109. |   412          4        MSSA         t209          0     always |
110. |   412          6        MSSA         t209          0     always |
111. |   412         10        MSSA         t209          0     always |
112. |   412         12        MSSA         t209          0     always |
113. |   412         14        MSSA         t209          0     always |
114. |   412         16        MSSA         t209          0     always |
115. |   412         18   No growth                       0     varies |
116. |   412         20   No growth                       0     varies |
117. |   412         22   No growth                       0     varies |
118. |   412         24   No growth                       0     varies |
119. |   412         26   No growth                       0     varies |
120. |   412         28   No growth                       0     varies |
121. |   412         30   No growth                       0     varies |
122. |   412         32        MSSA         t061          1     varies |
123. |   412         34        MSSA         t061          0     varies |
124. |   412         36        MSSA         t061          0     varies |
125. |   412         38        MSSA         t061          0     varies |
126. |   412         40        MSSA         t061          0     varies |
127. |   412         42   No growth                       0     varies |
128. |   412         44   No growth                       0     varies |
129. |   412         46        MSSA         t061          1     varies |
130. |   412         48   No growth                       0     varies |
131. |   412         62        MSSA         t061          0     varies |
132. |   412         64        MSSA         t061          0     varies |
133. |   412         66        MSSA         t061          0     varies |
134. |   412         68        MSSA         t061          0     varies |
135. |   412         70        MSSA         t061          0     varies |
136. |   412         72        MSSA         t061          0     varies |
137. |   412         74        MSSA         t061          0     varies |
138. |   412         76        MSSA         t061          0     varies |
139. |   412         78        MSSA         t061          0     varies |
140. |   412         80        MSSA         t061          0     varies |
141. |   412         82        MSSA         t061          0     varies |
142. |   412         84        MSSA         t061          0     varies |
143. |   412         86   No growth                       0     varies |
     |-----------------------------------------------------------------|
144. |   418          0        MSSA         t127          0     always |
145. |   418          2        MSSA         t948          0     always |
146. |   418          4        MSSA         t127          0     always |
147. |   418          6        MSSA         t127          0     always |
148. |   418          8        MSSA         t127          0     always |
149. |   418         10        MSSA         t127          0     always |
150. |   418         12        MSSA         t127          0     always |
151. |   418         14        MSSA         t127          0     always |
152. |   418         16        MSSA         t127          0     always |
153. |   418         18   No growth                       0     always |
154. |   418         22        MSSA         t127          0     always |
155. |   418         24        MSSA         t127          0     always |
156. |   418         26        MSSA         t127          0     always |
157. |   418         28        MSSA         t127          0     always |
158. |   418         30        MSSA         t127          0     always |
159. |   418         32   No growth                       0     varies |
160. |   418         34   No growth                       0     varies |
161. |   418         36   No growth                       0     varies |
162. |   418         38        MSSA         t127          1     varies |
163. |   418         40        MSSA         t127          0     varies |
164. |   418         42        MSSA         t127          0     varies |
165. |   418         44        MSSA         t267          1     varies |
166. |   418         46        MSSA         t267          0     varies |
167. |   418         48        MSSA         t267          0     varies |
168. |   418         64        MSSA         t121          1     varies |
169. |   418         66        MSSA         t121          0     varies |
170. |   418         68   No growth                       0     varies |
171. |   418         70   No growth                       0     varies |
172. |   418         72   No growth                       0     varies |
173. |   418         74   No growth                       0     varies |
174. |   418         76   No growth                       0     varies |
175. |   418         78        MSSA         t002          1     varies |
176. |   418         80        MSSA        t1094          1     varies |
177. |   418         82        MSSA        t1094          0     varies |
178. |   418         84        MSSA        t1094          0     varies |
179. |   418         86        MSSA        t1094          0     varies |
180. |   418         88        MSSA         t002          1     varies |
     |-----------------------------------------------------------------|
181. |   993          0        MRSA         t012          0     always |
182. |   993          2        MRSA         t012          0     always |
183. |   993          4        MRSA         t012          0     always |
184. |   993          6        MRSA         t012          0     always |
185. |   993          8        MSSA         t748          1     always |
186. |   993         10        MRSA         t012          0     always |
187. |   993         12        MRSA    t021/t012          0     always |
188. |   993         14   No growth                       0     varies |
189. |   993         16   No growth                       0     varies |
190. |   993         18   No growth                       0     varies |
191. |   993         20   No growth                       0     varies |
192. |   993         22   No growth                       0     varies |
193. |   993         24   No growth                       0     varies |
194. |   993         26   No growth                       0     varies |
195. |   993         28   No growth                       0     varies |
196. |   993         30   No growth                       0     varies |
197. |   993         32        MSSA       t10514          1     varies |
198. |   993         34        MSSA       t10514          0     varies |
199. |   993         36        MSSA       t10514          0     varies |
200. |   993         38        MSSA       t10514          0     varies |
201. |   993         40        MSSA       t10514          0     varies |
202. |   993         42        MSSA       t10514          0     varies |
203. |   993         44   No growth                       0     varies |
204. |   993         46        MSSA        t8062          1     varies |
205. |   993         48        MSSA        t8062          0     varies |
206. |   993         58        MSSA        t8062          0     varies |
207. |   993         60        MSSA         t021          1     varies |
208. |   993         62        MSSA         t021          0     varies |
209. |   993         64        MSSA         t364          1     varies |
210. |   993         66        MSSA         t364          0     varies |
211. |   993         68        MSSA       t11252          1     varies |
212. |   993         70        MSSA       t11252          0     varies |
213. |   993         72        MSSA       t11252          0     varies |
214. |   993         74   No growth                       0     varies |
215. |   993         76        MSSA         t393          1     varies |
216. |   993         78        MSSA         t393          0     varies |
217. |   993         80   No growth                       0     varies |
218. |   993         82   No growth                       0     varies |
219. |   993         84        MSSA         t008          1     varies |
     |-----------------------------------------------------------------|
220. |  1211          0   No growth                       0      never |
221. |  1211          2   No growth                       0      never |
222. |  1211          4   No growth                       0      never |
223. |  1211          6   No growth                       0      never |
224. |  1211          8   No growth                       0      never |
225. |  1211         10   No growth                       0      never |
226. |  1211         12   No growth                       0      never |
227. |  1211         14   No growth                       0      never |
228. |  1211         16   No growth                       0      never |
229. |  1211         18   No growth                       0      never |
230. |  1211         20   No growth                       0      never |
231. |  1211         22   No growth                       0      never |
232. |  1211         24   No growth                       0      never |
233. |  1211         26   No growth                       0      never |
234. |  1211         28   No growth                       0      never |
235. |  1211         30   No growth                       0      never |
236. |  1211         32   No growth                       0      never |
237. |  1211         34   No growth                       0      never |
238. |  1211         36   No growth                       0      never |
239. |  1211         38   No growth                       0      never |
240. |  1211         40   No growth                       0      never |
241. |  1211         42   No growth                       0      never |
242. |  1211         44   No growth                       0      never |
243. |  1211         46   No growth                       0      never |
244. |  1211         48   No growth                       0      never |
245. |  1211         58        MSSA         t056          1     varies |
246. |  1211         60   No growth                       0     varies |
247. |  1211         62   No growth                       0     varies |
248. |  1211         64   No growth                       0     varies |
249. |  1211         68   No growth                       0     varies |
250. |  1211         70   No growth                       0     varies |
251. |  1211         72   No growth                       0     varies |
252. |  1211         74   No growth                       0     varies |
253. |  1211         76   No growth                       0     varies |
254. |  1211         78   No growth                       0     varies |
255. |  1211         80   No growth                       0     varies |
256. |  1211         82   No growth                       0     varies |
257. |  1211         84   No growth                       0     varies |
     |-----------------------------------------------------------------|
258. |  1215          0        MSSA         t630          0     always |
259. |  1215          2        MSSA         t630          0     always |
260. |  1215          4        MSSA         t630          0     always |
261. |  1215          6        MSSA         t630          0     always |
262. |  1215          8   No growth                       0     always |
263. |  1215         10        MSSA         t630          0     always |
264. |  1215         12        MSSA         t630          0     always |
265. |  1215         14        MSSA         t630          0     always |
266. |  1215         16        MSSA         t630          0     always |
267. |  1215         18        MSSA         t630          0     always |
268. |  1215         20        MSSA         t630          0     always |
269. |  1215         22        MSSA         t630          0     always |
270. |  1215         24   No growth                       0     always |
271. |  1215         26        MSSA         t630          0     always |
272. |  1215         28        MSSA         t630          0     always |
273. |  1215         30        MSSA         t630          0     always |
274. |  1215         32        MSSA         t630          0     always |
275. |  1215         34        MSSA         t630          0     always |
276. |  1215         36        MSSA         t630          0     always |
277. |  1215         38        MSSA         t630          0     always |
278. |  1215         40        MSSA         t630          0     always |
279. |  1215         42        MSSA         t630          0     always |
280. |  1215         44        MSSA         t630          0     always |
281. |  1215         46        MSSA         t630          0     always |
282. |  1215         48        MSSA         t630          0     always |
283. |  1215         56   No growth                       0     varies |
284. |  1215         58   No growth                       0     varies |
285. |  1215         60   No growth                       0     varies |
286. |  1215         62   No growth                       0     varies |
287. |  1215         64   No growth                       0     varies |
288. |  1215         68   No growth                       0     varies |
289. |  1215         70   No growth                       0     varies |
290. |  1215         72   No growth                       0     varies |
291. |  1215         74   No growth                       0     varies |
292. |  1215         76   No growth                       0     varies |
293. |  1215         78   No growth                       0     varies |
294. |  1215         80   No growth                       0     varies |
295. |  1215         82   No growth                       0     varies |
296. |  1215         84   No growth                       0     varies |
     |-----------------------------------------------------------------|
297. |  1236          0   No growth                       0      never |
298. |  1236          2   No growth                       0      never |
299. |  1236          4   No growth                       0      never |
300. |  1236          6   No growth                       0      never |
301. |  1236          8   No growth                       0      never |
302. |  1236         10   No growth                       0      never |
303. |  1236         12   No growth                       0      never |
304. |  1236         14   No growth                       0      never |
305. |  1236         16   No growth                       0      never |
306. |  1236         18   No growth                       0      never |
307. |  1236         20   No growth                       0      never |
308. |  1236         22   No growth                       0      never |
309. |  1236         24   No growth                       0      never |
310. |  1236         26        MSSA         t021          1     varies |
311. |  1236         28        MSSA         t021          0     varies |
312. |  1236         30        MSSA         t021          0     varies |
313. |  1236         32        MSSA         t021          0     varies |
314. |  1236         34        MSSA         t021          0     varies |
315. |  1236         36        MSSA         t021          0     varies |
316. |  1236         38        MSSA         t021          0     varies |
317. |  1236         40        MSSA         t021          0     varies |
318. |  1236         42        MSSA         t021          0     varies |
319. |  1236         44        MSSA         t021          0     varies |
320. |  1236         46        MSSA         t021          0     varies |
321. |  1236         48        MSSA         t021          0     varies |
322. |  1236         64   No growth                       0     varies |
323. |  1236         68   No growth                       0     varies |
324. |  1236         70   No growth                       0     varies |
325. |  1236         72   No growth                       0     varies |
326. |  1236         74   No growth                       0     varies |
327. |  1236         76   No growth                       0     varies |
328. |  1236         78   No growth                       0     varies |
329. |  1236         80   No growth                       0     varies |
330. |  1236         82   No growth                       0     varies |
     |-----------------------------------------------------------------|
331. |  1244          0   No growth                       0      never |
332. |  1244          2   No growth                       0      never |
333. |  1244          4   No growth                       0      never |
334. |  1244          6   No growth                       0      never |
335. |  1244          8   No growth                       0      never |
336. |  1244         10   No growth                       0      never |
337. |  1244         12   No growth                       0      never |
338. |  1244         14   No growth                       0      never |
339. |  1244         16   No growth                       0      never |
340. |  1244         18   No growth                       0      never |
341. |  1244         20   No growth                       0      never |
342. |  1244         22   No growth                       0      never |
343. |  1244         24   No growth                       0      never |
344. |  1244         26   No growth                       0      never |
345. |  1244         28   No growth                       0      never |
346. |  1244         30   No growth                       0      never |
347. |  1244         32   No growth                       0      never |
348. |  1244         34   No growth                       0      never |
349. |  1244         36   No growth                       0      never |
350. |  1244         38   No growth                       0      never |
351. |  1244         40   No growth                       0      never |
352. |  1244         42   No growth                       0      never |
353. |  1244         44        MSSA        t2271          1     varies |
354. |  1244         46        MSSA        t2271          0     varies |
355. |  1244         48        MSSA        t2271          0     varies |
356. |  1244         58        MSSA        t2271          0     varies |
357. |  1244         62   No growth                       0     varies |
358. |  1244         64   No growth                       0     varies |
359. |  1244         66   No growth                       0     varies |
360. |  1244         68        MSSA        t2271          1     varies |
361. |  1244         70        MSSA        t2271          0     varies |
362. |  1244         72        MSSA        t2271          0     varies |
363. |  1244         76        MSSA        t2271          0     varies |
364. |  1244         78   No growth                       0     varies |
365. |  1244         80   No growth                       0     varies |
366. |  1244         82   No growth                       0     varies |
     |-----------------------------------------------------------------|
367. |  1261          0        MSSA    t084/t280          0     always |
368. |  1261          2        MSSA         t280          0     always |
369. |  1261          4        MSSA         t280          0     always |
370. |  1261          6        MSSA         t280          0     always |
371. |  1261          8        MSSA         t280          0     always |
372. |  1261         10        MSSA         t280          0     always |
373. |  1261         12        MSSA         t280          0     always |
374. |  1261         14        MSSA         t280          0     always |
375. |  1261         16        MSSA         t280          0     always |
376. |  1261         18        MSSA         t280          0     always |
377. |  1261         20        MSSA         t280          0     always |
378. |  1261         22        MSSA         t280          0     always |
379. |  1261         24        MSSA         t280          0     always |
380. |  1261         26        MSSA         t280          0     always |
381. |  1261         30        MSSA         t280          0     always |
382. |  1261         32        MSSA         t280          0     always |
383. |  1261         34        MSSA         t280          0     always |
384. |  1261         36        MSSA         t280          0     always |
385. |  1261         38        MSSA         t280          0     always |
386. |  1261         40   No growth                       0     always |
387. |  1261         42        MSSA         t280          0     always |
388. |  1261         46   No growth                       0     always |
389. |  1261         48        MSSA         t280          0     always |
390. |  1261         60        MSSA         t127          1     always |
391. |  1261         64        MSSA         t280          0     always |
392. |  1261         66   No growth                       0     varies |
393. |  1261         68   No growth                       0     varies |
394. |  1261         70   No growth                       0     varies |
395. |  1261         72   No growth                       0     varies |
396. |  1261         74   No growth                       0     varies |
397. |  1261         76   No growth                       0     varies |
398. |  1261         78   No growth                       0     varies |
399. |  1261         80   No growth                       0     varies |
400. |  1261         82   No growth                       0     varies |
     |-----------------------------------------------------------------|
401. |  1274          0        MSSA         t084          0     always |
402. |  1274          2        MSSA         t084          0     always |
403. |  1274          4        MSSA         t084          0     always |
404. |  1274          6        MSSA         t084          0     always |
405. |  1274          8        MSSA         t084          0     always |
406. |  1274         10        MSSA         t084          0     always |
407. |  1274         12        MSSA         t084          0     always |
408. |  1274         14   No growth                       0     varies |
409. |  1274         16   No growth                       0     varies |
410. |  1274         18   No growth                       0     varies |
411. |  1274         20        MSSA         t084          1     varies |
412. |  1274         22        MSSA         t084          0     varies |
413. |  1274         24   No growth                       0     varies |
414. |  1274         26   No growth                       0     varies |
415. |  1274         28   No growth                       0     varies |
416. |  1274         30   No growth                       0     varies |
417. |  1274         32   No growth                       0     varies |
418. |  1274         34        MSSA         t084          1     varies |
419. |  1274         36        MSSA         t012          1     varies |
420. |  1274         38   No growth                       0     varies |
421. |  1274         40        MSSA         t084          1     varies |
422. |  1274         42   No growth                       0     varies |
423. |  1274         44   No growth                       0     varies |
424. |  1274         46   No growth                       0     varies |
425. |  1274         48        MSSA         t084          1     varies |
426. |  1274         56   No growth                       0     varies |
427. |  1274         58   No growth                       0     varies |
428. |  1274         60   No growth                       0     varies |
429. |  1274         62        MSSA         t084          1     varies |
430. |  1274         64   No growth                       0     varies |
431. |  1274         66   No growth                       0     varies |
432. |  1274         70   No growth                       0     varies |
433. |  1274         72        MSSA         t084          1     varies |
434. |  1274         74   No growth                       0     varies |
435. |  1274         76        MSSA        t2422          1     varies |
436. |  1274         78   No growth                       0     varies |
437. |  1274         80   No growth                       0     varies |
438. |  1274         82   No growth                       0     varies |
     |-----------------------------------------------------------------|
439. |  1295          0   No growth                       0      never |
440. |  1295          2   No growth                       0      never |
441. |  1295          4   No growth                       0      never |
442. |  1295          8   No growth                       0      never |
443. |  1295         10   No growth                       0      never |
444. |  1295         12   No growth                       0      never |
445. |  1295         14   No growth                       0      never |
446. |  1295         16   No growth                       0      never |
447. |  1295         18   No growth                       0      never |
448. |  1295         22   No growth                       0      never |
449. |  1295         24   No growth                       0      never |
450. |  1295         26   No growth                       0      never |
451. |  1295         30   No growth                       0      never |
452. |  1295         32   No growth                       0      never |
453. |  1295         34   No growth                       0      never |
454. |  1295         36   No growth                       0      never |
455. |  1295         38        MSSA       t12151          1     varies |
456. |  1295         40        MSSA       t12151          0     varies |
457. |  1295         44        MSSA       t12151          0     varies |
458. |  1295         46        MSSA       t12151          0     varies |
459. |  1295         50        MSSA       t12151          0     varies |
460. |  1295         58   No growth                       0     varies |
461. |  1295         64   No growth                       0     varies |
462. |  1295         70        MSSA       t15752          1     varies |
463. |  1295         74   No growth                       0     varies |
464. |  1295         76   No growth                       0     varies |
465. |  1295         78        MSSA         t065          1     varies |
466. |  1295         80        MSSA         t065          0     varies |
467. |  1295         82        MSSA         txAH          0     varies |
     |-----------------------------------------------------------------|
468. |  1316          0        MSSA         t645          0     always |
469. |  1316          2        MSSA         t645          0     always |
470. |  1316          4        MSSA         t645          0     always |
471. |  1316          6        MSSA         t645          0     always |
472. |  1316          8        MSSA         t645          0     always |
473. |  1316         10        MSSA         t645          0     always |
474. |  1316         12        MSSA         t645          0     always |
475. |  1316         14        MSSA         t645          0     always |
476. |  1316         16        MSSA         t645          0     always |
477. |  1316         18        MSSA         t645          0     always |
478. |  1316         20        MSSA         t645          0     always |
479. |  1316         22        MSSA         t645          0     always |
480. |  1316         24        MSSA   t645/t1596          1     always |
481. |  1316         26        MSSA         t645          0     always |
482. |  1316         28        MSSA         t645          0     always |
483. |  1316         30        MSSA         t645          0     always |
484. |  1316         32        MSSA         t645          0     always |
485. |  1316         34        MSSA         t645          0     always |
486. |  1316         36        MSSA         t645          0     always |
487. |  1316         38        MSSA         t645          0     always |
488. |  1316         40        MSSA         t645          0     always |
489. |  1316         42        MSSA         t645          0     always |
490. |  1316         44        MSSA         t645          0     always |
491. |  1316         46        MSSA         t645          0     always |
492. |  1316         48        MSSA         t645          0     always |
493. |  1316         56        MSSA         t645          0     always |
494. |  1316         58        MSSA         t645          0     always |
495. |  1316         60   No growth                       0     varies |
496. |  1316         62   No growth                       0     varies |
497. |  1316         64   No growth                       0     varies |
498. |  1316         66   No growth                       0     varies |
499. |  1316         68   No growth                       0     varies |
500. |  1316         70   No growth                       0     varies |
501. |  1316         72   No growth                       0     varies |
502. |  1316         74   No growth                       0     varies |
503. |  1316         76   No growth                       0     varies |
504. |  1316         78   No growth                       0     varies |
505. |  1316         80   No growth                       0     varies |
506. |  1316         82   No growth                       0     varies |
     |-----------------------------------------------------------------|
507. |  1332          0   No growth                       0      never |
508. |  1332          2   No growth                       0      never |
509. |  1332          4   No growth                       0      never |
510. |  1332          6   No growth                       0      never |
511. |  1332          8   No growth                       0      never |
512. |  1332         10   No growth                       0      never |
513. |  1332         12   No growth                       0      never |
514. |  1332         14   No growth                       0      never |
515. |  1332         16   No growth                       0      never |
516. |  1332         18   No growth                       0      never |
517. |  1332         20   No growth                       0      never |
518. |  1332         22   No growth                       0      never |
519. |  1332         24   No growth                       0      never |
520. |  1332         26   No growth                       0      never |
521. |  1332         28   No growth                       0      never |
522. |  1332         30   No growth                       0      never |
523. |  1332         32   No growth                       0      never |
524. |  1332         34   No growth                       0      never |
525. |  1332         36   No growth                       0      never |
526. |  1332         40   No growth                       0      never |
527. |  1332         42   No growth                       0      never |
528. |  1332         44   No growth                       0      never |
529. |  1332         46   No growth                       0      never |
530. |  1332         48        MSSA         t410          1     varies |
531. |  1332         56   No growth                       0     varies |
532. |  1332         60   No growth                       0     varies |
533. |  1332         62   No growth                       0     varies |
534. |  1332         64   No growth                       0     varies |
535. |  1332         66   No growth                       0     varies |
536. |  1332         68        MSSA       t15751          1     varies |
537. |  1332         70   No growth                       0     varies |
538. |  1332         72   No growth                       0     varies |
539. |  1332         74        MSSA         t279          1     varies |
540. |  1332         76        MSSA         t279          0     varies |
541. |  1332         78        MSSA         t279          0     varies |
542. |  1332         80        MSSA         t279          0     varies |
543. |  1332         82        MSSA         txAJ          1     varies |
     |-----------------------------------------------------------------|
544. |  1370          0   No growth                       0      never |
545. |  1370          2   No growth                       0      never |
546. |  1370          4   No growth                       0      never |
547. |  1370          6   No growth                       0      never |
548. |  1370          8   No growth                       0      never |
549. |  1370         10   No growth                       0      never |
550. |  1370         12   No growth                       0      never |
551. |  1370         14   No growth                       0      never |
552. |  1370         16   No growth                       0      never |
553. |  1370         18   No growth                       0      never |
554. |  1370         20   No growth                       0      never |
555. |  1370         22   No growth                       0      never |
556. |  1370         24   No growth                       0      never |
557. |  1370         26   No growth                       0      never |
558. |  1370         28   No growth                       0      never |
559. |  1370         30   No growth                       0      never |
560. |  1370         32   No growth                       0      never |
561. |  1370         34   No growth                       0      never |
562. |  1370         36   No growth                       0      never |
563. |  1370         38   No growth                       0      never |
564. |  1370         40   No growth                       0      never |
565. |  1370         42        MSSA        t9973          1     varies |
566. |  1370         44   No growth                       0     varies |
567. |  1370         46   No growth                       0     varies |
568. |  1370         48   No growth                       0     varies |
569. |  1370         56   No growth                       0     varies |
570. |  1370         62   No growth                       0     varies |
571. |  1370         64   No growth                       0     varies |
572. |  1370         68   No growth                       0     varies |
573. |  1370         70   No growth                       0     varies |
574. |  1370         72   No growth                       0     varies |
575. |  1370         78   No growth                       0     varies |
576. |  1370         80   No growth                       0     varies |
     |-----------------------------------------------------------------|
577. |  1372          0   No growth                       0      never |
578. |  1372          2   No growth                       0      never |
579. |  1372          4   No growth                       0      never |
580. |  1372          6   No growth                       0      never |
581. |  1372          8   No growth                       0      never |
582. |  1372         10   No growth                       0      never |
583. |  1372         12   No growth                       0      never |
584. |  1372         14   No growth                       0      never |
585. |  1372         16   No growth                       0      never |
586. |  1372         18   No growth                       0      never |
587. |  1372         20   No growth                       0      never |
588. |  1372         22   No growth                       0      never |
589. |  1372         24   No growth                       0      never |
590. |  1372         26        MSSA         t002          1     varies |
591. |  1372         28   No growth                       0     varies |
592. |  1372         30        MSSA         t002          0     varies |
593. |  1372         32        MSSA         t002          0     varies |
594. |  1372         34        MSSA         t002          0     varies |
595. |  1372         36        MSSA         t002          0     varies |
596. |  1372         38        MSSA         t002          0     varies |
597. |  1372         40        MSSA         t002          0     varies |
598. |  1372         42        MSSA         t002          0     varies |
599. |  1372         44        MSSA         t002          0     varies |
600. |  1372         46        MSSA         t002          0     varies |
601. |  1372         48        MSSA         t002          0     varies |
602. |  1372         58        MSSA         t002          0     varies |
603. |  1372         60        MSSA         t002          0     varies |
604. |  1372         62   No growth                       0     varies |
605. |  1372         64   No growth                       0     varies |
606. |  1372         66   No growth                       0     varies |
607. |  1372         68   No growth                       0     varies |
608. |  1372         70   No growth                       0     varies |
609. |  1372         74   No growth                       0     varies |
610. |  1372         76   No growth                       0     varies |
611. |  1372         78   No growth                       0     varies |
612. |  1372         80   No growth                       0     varies |
     |-----------------------------------------------------------------|
613. |  1375          0   No growth                       0      never |
614. |  1375          2   No growth                       0      never |
615. |  1375          4   No growth                       0      never |
616. |  1375          6   No growth                       0      never |
617. |  1375          8        MSSA         t091          1     varies |
618. |  1375         10        MSSA         t091          0     varies |
619. |  1375         12        MSSA         t091          0     varies |
620. |  1375         14        MSSA         t091          0     varies |
621. |  1375         16        MSSA         t091          0     varies |
622. |  1375         18        MSSA         t091          0     varies |
623. |  1375         20        MSSA         t091          0     varies |
624. |  1375         22        MSSA        t9726          1     varies |
625. |  1375         24        MSSA        t9726          0     varies |
626. |  1375         26   No growth                       0     varies |
627. |  1375         28   No growth                       0     varies |
628. |  1375         30   No growth                       0     varies |
629. |  1375         32   No growth                       0     varies |
630. |  1375         34   No growth                       0     varies |
631. |  1375         36   No growth                       0     varies |
632. |  1375         40        MRSA        t1023          1     varies |
633. |  1375         42   No growth                       0     varies |
634. |  1375         44   No growth                       0     varies |
635. |  1375         46   No growth                       0     varies |
636. |  1375         48   No growth                       0     varies |
637. |  1375         56   No growth                       0     varies |
638. |  1375         58   No growth                       0     varies |
639. |  1375         60   No growth                       0     varies |
640. |  1375         62   No growth                       0     varies |
641. |  1375         64   No growth                       0     varies |
642. |  1375         66   No growth                       0     varies |
643. |  1375         68   No growth                       0     varies |
644. |  1375         70   No growth                       0     varies |
645. |  1375         72   No growth                       0     varies |
646. |  1375         74   No growth                       0     varies |
647. |  1375         76   No growth                       0     varies |
648. |  1375         78   No growth                       0     varies |
649. |  1375         80   No growth                       0     varies |
     |-----------------------------------------------------------------|
650. |  1395          0   No growth                       0      never |
651. |  1395          6   No growth                       0      never |
652. |  1395          8   No growth                       0      never |
653. |  1395         10   No growth                       0      never |
654. |  1395         12   No growth                       0      never |
655. |  1395         14   No growth                       0      never |
656. |  1395         16   No growth                       0      never |
657. |  1395         18   No growth                       0      never |
658. |  1395         20   No growth                       0      never |
659. |  1395         22   No growth                       0      never |
660. |  1395         24   No growth                       0      never |
661. |  1395         26   No growth                       0      never |
662. |  1395         28   No growth                       0      never |
663. |  1395         30   No growth                       0      never |
664. |  1395         32   No growth                       0      never |
665. |  1395         34   No growth                       0      never |
666. |  1395         36   No growth                       0      never |
667. |  1395         38   No growth                       0      never |
668. |  1395         40   No growth                       0      never |
669. |  1395         42   No growth                       0      never |
670. |  1395         44   No growth                       0      never |
671. |  1395         46   No growth                       0      never |
672. |  1395         48   No growth                       0      never |
673. |  1395         58   No growth                       0      never |
674. |  1395         60   No growth                       0      never |
675. |  1395         62        MSSA         t056          1     varies |
676. |  1395         64   No growth                       0     varies |
677. |  1395         66   No growth                       0     varies |
678. |  1395         68   No growth                       0     varies |
679. |  1395         70   No growth                       0     varies |
680. |  1395         72   No growth                       0     varies |
681. |  1395         74   No growth                       0     varies |
682. |  1395         76   No growth                       0     varies |
683. |  1395         78   No growth                       0     varies |
684. |  1395         80   No growth                       0     varies |
     |-----------------------------------------------------------------|
685. |  2055          0   No growth                       0      never |
686. |  2055          2   No growth                       0      never |
687. |  2055          4   No growth                       0      never |
688. |  2055          6   No growth                       0      never |
689. |  2055          8   No growth                       0      never |
690. |  2055         12   No growth                       0      never |
691. |  2055         14   No growth                       0      never |
692. |  2055         16   No growth                       0      never |
693. |  2055         18   No growth                       0      never |
694. |  2055         20   No growth                       0      never |
695. |  2055         24   No growth                       0      never |
696. |  2055         28   No growth                       0      never |
697. |  2055         30   No growth                       0      never |
698. |  2055         32   No growth                       0      never |
699. |  2055         36   No growth                       0      never |
700. |  2055         38   No growth                       0      never |
701. |  2055         40   No growth                       0      never |
702. |  2055         42   No growth                       0      never |
703. |  2055         44        MSSA       t12838          1     varies |
704. |  2055         46   No growth                       0     varies |
705. |  2055         48   No growth                       0     varies |
706. |  2055         60   No growth                       0     varies |
707. |  2055         64   No growth                       0     varies |
708. |  2055         66   No growth                       0     varies |
709. |  2055         70   No growth                       0     varies |
710. |  2055         72   No growth                       0     varies |
711. |  2055         74   No growth                       0     varies |
712. |  2055         76   No growth                       0     varies |
713. |  2055         78   No growth                       0     varies |
714. |  2055         80   No growth                       0     varies |
715. |  2055         82   No growth                       0     varies |
     +-----------------------------------------------------------------+

. 
. noi save "E:\users\amy.mason\staph_carriage\Datasets\people_to_stop.dta", replace
file E:\users\amy.mason\staph_carriage\Datasets\people_to_stop.dta saved

. export excel using "E:\users\amy.mason\staph_carriage\Outpits\People to drop.xls, replace
file E:\users\amy.mason\staph_carriage\Outpits\People to drop.xls, replace.xls saved

. export excel using "E:\users\amy.mason\staph_carriage\Outpits\People to drop.xls
file E:\users\amy.mason\staph_carriage\Outpits\People to drop.xls already exists
r(602);

. help export

. export excel using "E:\users\amy.mason\staph_carriage\Outpits\People to drop.xls, clear
file E:\users\amy.mason\staph_carriage\Outpits\People to drop.xls, clear saved

. export excel using "E:\users\amy.mason\staph_carriage\Outpits\People to drop.xls, clear
file E:\users\amy.mason\staph_carriage\Outpits\People to drop.xls, clear already exists
r(602);

. export excel using "E:\users\amy.mason\staph_carriage\Outpits\People_to_drop.xls, replace
file E:\users\amy.mason\staph_carriage\Outpits\People_to_drop.xls, replace.xls saved

. export excel using "E:\users\amy.mason\staph_carriage\Outpits\People_to_drop.xls, replace
file E:\users\amy.mason\staph_carriage\Outpits\People_to_drop.xls, replace.xls already exists
r(602);

. export excel using "E:\users\amy.mason\staph_carriage\Outpits\People to drop.xls", replace
file E:\users\amy.mason\staph_carriage\Outpits\People to drop.xls saved

. export excel using "E:\users\amy.mason\staph_carriage\Outpits\People to drop.xls", replace
file E:\users\amy.mason\staph_carriage\Outpits\People to drop.xls saved

. export excel using "E:\users\amy.mason\staph_carriage\Outpits\People to stop.xls", replace
file E:\users\amy.mason\staph_carriage\Outpits\People to stop.xls saved

. use  "E:\users\amy.mason\staph_carriage\Datasets\clean_data4.dta", clear

. use pipeline_clean_all_values_wide, clear
file pipeline_clean_all_values_wide.dta not found
r(601);

. 
. 
. 
. **************************

. 
. noi di  "Recall order is  Mykrobe Mykrobe Genefinder"
Recall order is  Mykrobe Mykrobe Genefinder

. 
. 
. 
. 
. 
. noi tab site ValueA, m
variable site not found
r(111);

. 
. gen agree  = (ValueA=="AAA"| ValueA=="PPP" )
ValueA not found
r(111);

. 
. drop if agree==1
agree not found
r(111);

. set li 130

. 
. 
. 
. cap log close
